{
  "PRIMARY 1": {
    "THEMES": [
      {
        "THEME NAME": "NUMBER AND NUMERATION",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Whole Number",
            "TOPICS": [
              {
                "TOPIC NAME": "Whole numbers 1-5",
                "PERFORMANCE OBJECTIVES": [
                  "sort and classify number of objects in a group or collection;",
                  "identify number of objects in a group or collection;",
                  "count correctly up to 5;",
                  "write correctly number 1-5;",
                  "arrange numbers 1-5 in order of their magnitudes (quantities)"
                ],
                "CONTENT": [
                  "Sorting and classifying objects leading to idea of 1-5",
                  "Identification of numbers of objects 1-5",
                  "Reading of number 1-5",
                  "Writing of numbers 1-5",
                  "Ordering of number 1-5"
                ],
                "TEACHER ACTIVITIES": [
                  "Mixes the collections and asks pupils to sort them according to types.",
                  "Guides pupils to form groups: one for stones, two for bottle tops, three for beans, four for buttons and five for balls.",
                  "Asks pupils to show one bottle top, 2 bottle tops, up to 5 bottle tops.",
                  "Reads number 1-5.",
                  "Guides pupils to write the numbers in order in their books and arrange numbers in order of their magnitude using counters and other objects."
                ],
                "PUPILS ACTIVITIES": [
                  "Sort them according to types.",
                  "Sort and classify the mixed collection by forming groups for objects e.g. pick a stone, pick two bottle tops etc.",
                  "Read the numbers 1-5.",
                  "Write the number 1-5 in exercise book.",
                  "Use counters to arrange objects in magnitude or in ordering form."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Counters: stones beans, bottle tops, buttons, leaves, nylon bags",
                  "Number cards"
                ],
                "EVALUATION GUIDE": [
                  "sort given number of objects from a collection;",
                  "arrange given number of objects from a collection together;",
                  "read given numbers on board;",
                  "write numbers 1-5 on the board/ exercise book;",
                  "order given numbers in order of their magnitudes form."
                ]
              },
              {
                "TOPIC NAME": "Whole number 0 (Zero)",
                "PERFORMANCE OBJECTIVES": [
                  "recognize that the symbol 0 stands for nothingness;",
                  "read the number 0;",
                  "Write 0."
                ],
                "CONTENT": [
                  "Symbol 0"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to put one stone in one bag, two stones in the sack bag and three stones in the third bag and none in the fourth bag;",
                  "recognize the symbol 0;",
                  "write the number 0;",
                  "remove the stones in each bag until there is no stone left."
                ],
                "PUPILS ACTIVITIES": [
                  "Put the stones into the bags as directed by the teacher."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Stones, seeds, bottle covers, etc",
                  "Nylon bags or any other container."
                ],
                "EVALUATION GUIDE": [
                  "remove objects from the bags till nothing is left in the bags;",
                  "write and pronounce the number 0;",
                  "give an example in the home of zero Situation, etc."
                ]
              },
              {
                "TOPIC NAME": "Whole numbers 6-9",
                "PERFORMANCE OBJECTIVES": [
                  "sort and classify numbers of objects in a group or collection;",
                  "identify number of objects in a group or collection;",
                  "Count and read correctly from 1-9;",
                  "write correctly number 6-9;",
                  "arrange the numbers 6-9 in order of their magnitudes (quantities)."
                ],
                "CONTENT": [
                  "Sorting and classifying objects leading to idea of 6-9.",
                  "Identification of numbers 6-9.",
                  "Counting and reading numbers 1-9.",
                  "Writing of numbers 6-9.",
                  "Ordering number 6-9."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to mix the collection and sort out the balls pebbles, bottle tops and buttons together.",
                  "Guides pupils to classify each group of similar objects as follows: a. count out five balls; b. add one ball to it;",
                  "Leads pupils to recognize this as 6 i.e. 5 balls and 1 ball gives 6;",
                  "Count out 6 pebbles and add 1 pebbles to it and lead them to recognize it as 7 up to 9 buttons etc.",
                  "Guides pupils to read the numbers 1-9.",
                  "Guides pupils to write the numbers 1-9.",
                  "Arranges the numbers in order of their magnitude using objects such as balls, pebbles, etc in a collection.",
                  "Leads pupils to write the numbers in order of their magnitudes."
                ],
                "PUPILS ACTIVITIES": [
                  "Sort and classify the mixed collection e.g. collection of balls, collection of pebbles, etc.",
                  "Identify the numbers 6-9 through the activities and the use of Flash cards.",
                  "Count and read numbers 1-9 on the board and Flash cards.",
                  "Write the numbers 1-9",
                  "Use collection of objects to arrange numbers in magnitude or in ordering form."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Counters: balls, pebbles, buttons bottle tops, leaves and oranges etc.",
                  "Flash cards of numbers 1-9"
                ],
                "EVALUATION GUIDE": [
                  "arrange given number of objects from a collection together;",
                  "identify numbers 6 - 9;",
                  "read numbers 1-9 on board and flash cards;",
                  "write numbers 1-9 on the board/ exercise book;",
                  "order numbers 1-9 in their magnitude."
                ]
              },
              {
                "TOPIC NAME": "Whole number 10",
                "PERFORMANCE OBJECTIVES": [
                  "recognize 10 as a group;",
                  "use idea of place value limited to tens and units."
                ],
                "CONTENT": [
                  "Recognition of 10 as a group.",
                  "Use of place value- Tens and Units (i.e. T,U)."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads pupils to recognize 10.",
                  "Records the number 10 on board.",
                  "Leads them to write 10.",
                  "Gives a group of 11 bottle tops, 12 buttons and 13 balls to pupils up to 20 balls.",
                  "Asks them to group each in tens and keep the remainder by the side.",
                  "Leads pupils to recognize that 11 bottles is 1 group of ten and 1. This is called eleven (11), 12 buttons is 1 group of ten and 2 buttons (called twelve).",
                  "Guides pupils to carry out similar activities for 13 balls up to 20 balls. Thus, 11 = 1 ten and 1 unit"
                ],
                "PUPILS ACTIVITIES": [
                  "Sort the collection in 8, 9 and 10.",
                  "Recognize number 10.",
                  "Read the number 10.",
                  "Write the number 10.",
                  "Count 11 bottle tops, 12 buttons, 13 objects, 13 balls up to 20 objects.",
                  "Count values under tens and units (i.e. T,U)",
                  "Write value under T.U."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Counters: bottle tops, button, balls, toes and fingers etc."
                ],
                "EVALUATION GUIDE": [
                  "bring ten objects from a collection;",
                  "read and write 10, 11, 12 13, up to 20 in T and U."
                ]
              },
              {
                "TOPIC NAME": "Whole Numbers 1-99",
                "PERFORMANCE OBJECTIVES": [
                  "identify and read correctly the numbers 1-99;",
                  "write correctly the numbers 1-99."
                ],
                "CONTENT": [
                  "Identification and reading of numbers 1-99.",
                  "Writing of numbers 1-99."
                ],
                "TEACHER ACTIVITIES": [
                  "Uses the teaching resources to assist pupils identify and read the numbers 1-99.",
                  "Guides pupils to write numbers 1-99."
                ],
                "PUPILS ACTIVITIES": [
                  "Read numbers 1-99",
                  "Write numbers 1-99"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Flash cards of numbers"
                ],
                "EVALUATION GUIDE": [
                  "identify and read correctly given numbers between 1-99;",
                  "write correctly the numbers 1-99."
                ]
              },
              {
                "TOPIC NAME": "Fractions",
                "PERFORMANCE OBJECTIVES": [
                  "identify 1/2 and 1/4 using concrete objects and shapes,"
                ],
                "CONTENT": [
                  "Identification of 1/2 and 1/4 using concrete objects and shapes."
                ],
                "TEACHER ACTIVITIES": [
                  "Presents each object as one whole.",
                  "Cuts and divides an object into two equal parts, and explains that each part is 1/2.",
                  "Cuts on object (e.g. an orange) into four equal parts, and explains that each part is 1/4.",
                  "Asks pupils to colour half and one quarter of shapes in their workbooks."
                ],
                "PUPILS ACTIVITIES": [
                  "Practice writing such objects into 1 and 1/4.",
                  "Match drawings of 1/2 and 1/4 of objects on the board with cuttings of 1/2 and 1/4.",
                  "Draw whole shapes (e.g. squares, circles) and their corresponding values and quarters in their exercise books.",
                  "Colour 1/2 and 1/4 of shapes in their workbooks.",
                  "Give example of things that can be shared into 1/2 and 1/4.",
                  "Suggest reasons for sharing things into 1/2 and 1/4."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Oranges, apples, paper cuttings of shapes: • Squares • rectangles, • circle.",
                  "Coloured pencils and; pair of scissors"
                ],
                "EVALUATION GUIDE": [
                  "cut given oranges into given part;",
                  "label given drawing of halves and quarters of objects and shapes;",
                  "fold rectangular or circular shapes into halves and quarters;",
                  "colour 1/2 and 1/4 of given shapes;",
                  "give examples of things that can be shared into 1/2 and 1/4."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "BASIC OPERATIONS",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Basic Operations",
            "TOPICS": [
              {
                "TOPIC NAME": "Addition",
                "PERFORMANCE OBJECTIVES": [
                  "add two whole numbers from 1 to 3 with sum less than 5;",
                  "add two or three whole numbers from 1 to 8 with sum not up to 10;",
                  "add two or three numbers from 0 to 9 with sum not greater than 18;",
                  "add 2-digit whole numbers with sum not greater than 40 without exchanging or renaming;",
                  "cross check numeracy in addition is readable."
                ],
                "CONTENT": [
                  "Addition through practical work: i. addition of whole numbers with sum less than 5 ii. addition of whole numbers with sum less than 10 iii. addition of whole numbers with sum less than 18 iv. addition of items of 2-digit whole numbers with sum not greater than 40"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to group the objects into ones, twos, threes and fours to form sum less than 5 e.g. 2 balls and 2 pencils give 4 balls.",
                  "Groups objects up to nine to form sum less than 10. e.g. 5 oranges and 2 oranges gives 7 oranges.",
                  "Groups objects from 1 to 9 with sum not greater than 18 e.g. 9 bean seed and 8 bean seed gives 17 bean seeds.",
                  "Groups objects into tens, elevens twelve etc. with sum not greater than 40. e.g. 22 leaves and 14 leaves give 36 leaves.",
                  "Emphasizes correctness in addition so as to value precision.",
                  "Leads pupils to give examples of everyday life where accuracy is required."
                ],
                "PUPILS ACTIVITIES": [
                  "Group objects into ones, two, threes and fours to form sums less than 5 and count the total.",
                  "Combine two or more similar objects less than 10 and count the total.",
                  "Combine two or three similar objects less than 18 and count the total.",
                  "Combine two group of 2-digit numbers less than 40 and count the total.",
                  "Crosscheck accuracy in previous addition.",
                  "Gives examples in everyday life where accuracy of addition in needed."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Oranges",
                  "balls",
                  "Leaves",
                  "Bottle tops",
                  "Number Beads, etc."
                ],
                "EVALUATION GUIDE": [
                  "add given whole numbers;",
                  "add two or three given whole numbers less than 10;",
                  "add two or three given whole numbers less than 18;",
                  "add 2- digit numbers and record their result;",
                  "mention three everyday activities where accuracy is necessary."
                ]
              },
              {
                "TOPIC NAME": "Subtraction",
                "PERFORMANCE OBJECTIVES": [
                  "subtract from whole numbers not greater than 9;",
                  "subtract from whole numbers not greater than 18;",
                  "crosscheck accuracy in subtraction."
                ],
                "CONTENT": [
                  "Subtraction from whole numbers not greater than 9.",
                  "Subtraction from whole numbers not greater than 18."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to group a particular set of objects e.g. orange into 1, 2, 3, 4, 5, 6, 7, 8, and 9.",
                  "Leads pupils to take a group of objects and take away a lesser number of the same objects from the group e.g. in a group of 8 oranges take away 6 oranges.",
                  "Guides pupils to group a particular object e.g. been seeds into sets of 18, 17, 16, 15, 14, 14, 12, 11, 10, 9, 8.",
                  "Guides/leads pupils to count a group of objects and take away a lesser number of the same objects from the group e.g. in a group of 16 bean seeds take away 10 bean seeds.",
                  "Leads pupils to give examples of everyday life where accuracy in subtraction is required.",
                  "Emphasizes the importance of accuracy of subtraction in everyday activities."
                ],
                "PUPILS ACTIVITIES": [
                  "Group objects such as oranges, stones etc into 1, 2, 3, 4, 5, 6, 7, 8, and 9.",
                  "Count one given group of objects and remove a lesser number of the same objects from the group.",
                  "Group objects such as bean seeds into 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8.",
                  "Count one given group of objects and remove a lesser number of the same objects from the group.",
                  "Give examples of everyday life where accuracy in subtraction is needed."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Stones",
                  "Oranges",
                  "Bean seeds",
                  "balls",
                  "Bottle tops",
                  "Number Beads, etc"
                ],
                "EVALUATION GUIDE": [
                  "subtract given whole numbers not greater than 9;",
                  "subtract given whole numbers not greater than 18;",
                  "mention two examples of everyday activities where accuracy in subtraction is needed."
                ]
              },
              {
                "TOPIC NAME": "Addition - Missing Numbers",
                "PERFORMANCE OBJECTIVES": [
                  "find missing numbers in a statement;",
                  "cross-check the correctness of addition in everyday life."
                ],
                "CONTENT": [
                  "Finding missing numbers e.g. 8+ = 9 7 + = 9 5+ = 8"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to take a set of objects and constitute two groups of known unequal numbers.",
                  "Guides pupils to count the smaller group and determine the number of objects to be added to obtain the number in the bigger groups e.g. 8+ = 9",
                  "Emphasizes the need for correct addition everyday activities.",
                  "Guides pupils to give examples of everyday activities where accuracy of addition is needed."
                ],
                "PUPILS ACTIVITIES": [
                  "Group on object into two, of unequal numbers.",
                  "Count the number of objects in group and determine the number of objects to be added to obtain the number in a bigger group",
                  "Cross-check the need for accuracy in addition in everyday activities.",
                  "Give examples of activities requiring accuracy of addition."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pebbles",
                  "Oranges",
                  "balls",
                  "Bottle tops",
                  "Number Beads, etc"
                ],
                "EVALUATION GUIDE": [
                  "find missing numbers in a given statement;",
                  "mention four areas where accuracy of addition is required in daily life."
                ]
              },
              {
                "TOPIC NAME": "Subtraction - Missing Numbers",
                "PERFORMANCE OBJECTIVES": [
                  "find missing numbers in a statement;",
                  "cross-check the correctness of subtraction in everyday life."
                ],
                "CONTENT": [
                  "Finding missing numbers e.g. 8- = 4 7 = 5 5- = 3"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to take a set of objects and constitute two groups of known unequal numbers.",
                  "Guides pupils to count the bigger group and determine the number of objects to be subtracted to obtain the number in the bigger groups e.g. 8- = 3.",
                  "Emphasizes the need for correct additions land subtraction in everyday activities.",
                  "Guides pupils to give examples of everyday activities where accuracy of subtraction is needed"
                ],
                "PUPILS ACTIVITIES": [
                  "Group on object into two, of unequal numbers.",
                  "Count the number of objects in group and determine the number of objects to be added to obtain the number in the bigger group.",
                  "Cross-check subtraction for accuracy",
                  "Give examples of activities requiring accuracy of subtraction."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pebbles",
                  "Oranges",
                  "balls",
                  "Bottle tops",
                  "Number Beads, etc"
                ],
                "EVALUATION GUIDE": [
                  "Find missing numbers in a given statement;",
                  "mention four areas where accuracy of subtraction is required in daily life."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "ALGEBRAIC PROCESSES",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Algebraic Operations",
            "TOPICS": [
              {
                "TOPIC NAME": "Open Sentences",
                "PERFORMANCE OBJECTIVES": [
                  "find missing numbers in an open sentence;",
                  "solve simple related open sentences."
                ],
                "CONTENT": [
                  "Open Sentences"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to find missing Numbers in an example : - 1+ = 3 - 2 + = 5",
                  "Guides pupils to solve simple open sentences."
                ],
                "PUPILS ACTIVITIES": [
                  "Solve series of problems involving open sentences.",
                  "Solve simple related open sentences."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Bottle tops",
                  "Number cards",
                  "Dot cards",
                  "Pupils themselves, etc."
                ],
                "EVALUATION GUIDE": [
                  "solve given problems on open sentences;",
                  "find simple numbers in open sentences."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "MENSURATION AND GEOMETRY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Primary Measures",
            "TOPICS": [
              {
                "TOPIC NAME": "Money",
                "PERFORMANCE OBJECTIVES": [
                  "recognize different denomination of Nigerian coins;",
                  "add coins to obtain sums not exceeding 25k;",
                  "calculate change obtainable from 10k or less;",
                  "trace coins using brown and white papers."
                ],
                "CONTENT": [
                  "Nigerian coins 25k, 10k, 5k, 1k, and 1/2k.",
                  "Sum of two or three coins.",
                  "Shopping with a 10k piece and receiving change.",
                  "Tracing of coins."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads pupils through various activities to recognize the different denominations of Nigeria coins.",
                  "Devises suitable games for pupils to play in order to recognize the coins.",
                  "Uses Flash cards to show addition of coins e.g. 12k + 10k = 22k 11 + 8k = 19k 13k + 10k = 23k.",
                  "Guides pupils in practical experience in buying and selling.",
                  "Traces various denominations of Nigeria coins using: brown paper and crayon; white paper and pencil."
                ],
                "PUPILS ACTIVITIES": [
                  "Engage in sorting of coins into various denominations from the collection of coins.",
                  "Identify the different denominations.",
                  "Practice addition with sum not exceeding 25k.",
                  "Buy and sell from class shopping corner.",
                  "Trace different Nigeria coins as demonstrated by the teacher."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Actual coins, model coins or paper coins",
                  "Tracing paper",
                  "Brown paper",
                  "White Paper",
                  "Crayon"
                ],
                "EVALUATION GUIDE": [
                  "gives a collection of coins;",
                  "identify some as specified by the teacher;",
                  "do simple exercise on the addition of money not exceeding 25k.",
                  "calculate change when they buy or sell something by a simple game;",
                  "traces any given coin."
                ]
              },
              {
                "TOPIC NAME": "Length",
                "PERFORMANCE OBJECTIVES": [
                  "develop the idea of length;",
                  "compare length of two or three objects;",
                  "order similar objects according to lengths;",
                  "measure length and distance in their natural units;",
                  "apply the length and ordering of lengths in our environment."
                ],
                "CONTENT": [
                  "Idea of length.",
                  "Comparison of length of two or more objects to develop the idea of \"longer than\" and \"shorter than\".",
                  "Ordering of lengths of objects.",
                  "Measuring of length and distance using natural units such as hand span, steps arms length, strides, etc.",
                  "Measuring and ordering of length."
                ],
                "TEACHER ACTIVITIES": [
                  "Directs a pupil to move from one point to another in the classroom using his/her steps.",
                  "Asks pupils to measure the length of their table with their hand span.",
                  "Use strides to move from one corner of the classroom to another.",
                  "Guides the pupils to use arm length to measure the width of the classroom.",
                  "Gives pupils the idea of length in each case above.",
                  "Guides pupils to measure these objects with strings or sticks of varying lengths.",
                  "Guides pupils to arrange the objects according to their lengths.",
                  "Guides pupils to measure the length of their desks using their hand span record their results.",
                  "Guides pupils to measure the length of the floor of the classroom with their foot or the walls with their arms length and record their results.",
                  "Guides pupils to measure and order given objects by length."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe the pupil move in the class.",
                  "Measure their table with their hand span.",
                  "Move from one corner of the classroom to another.",
                  "Discuss their idea of length.",
                  "Measure these objects with strings or sticks of varying lengths.",
                  "Compare two pencils or sticks of different lengths and say which one is shorter than the other.",
                  "Arrange the objects in order of lengths.",
                  "Measure the length of their desks using their hand span and record their results.",
                  "Measure the length of the floor of the classroom with their foot or the walls with their arms length and record their results.",
                  "Measure and order given objects by length."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pencils, Sticks, Desk, Strings, the classroom, pupils themselves, etc."
                ],
                "EVALUATION GUIDE": [
                  "give examples of lengths;",
                  "measure given lengths with steps, hand spans, strides and foot and give answers;",
                  "compare lengths of given objects using \"longer than\" and \"shorter than\";",
                  "order given bundles of sticks of various length;",
                  "measure different given lengths using different natural units;",
                  "measure and order given objects by length."
                ]
              },
              {
                "TOPIC NAME": "Time",
                "PERFORMANCE OBJECTIVES": [
                  "demonstrate knowledge of the idea of time;",
                  "mention when certain things are done : - Home - School."
                ],
                "CONTENT": [
                  "Introduce the idea of time.",
                  "Time when certain things are done e.g. - Morning; - Afternoon; - Evening; - Night.",
                  "Time and events when certain activities take place."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to state when things are done at home and school."
                ],
                "PUPILS ACTIVITIES": [
                  "State the time when certain things are done e.g: - Sleep - Go to school etc",
                  "State when some events take place at home and school.",
                  "Play a drama on time and events to do certain activities."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts indicating activities peculiar to different periods of the day"
                ],
                "EVALUATION GUIDE": [
                  "state the time of sleeping;",
                  "coming to school etc."
                ]
              },
              {
                "TOPIC NAME": "Weight",
                "PERFORMANCE OBJECTIVES": [
                  "Compare the weights of some common objects in the school using the terms light and heavy."
                ],
                "CONTENT": [
                  "Lifting objects.",
                  "Estimating and comparing their weights."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides the pupils to lift two different objects to compare their weights."
                ],
                "PUPILS ACTIVITIES": [
                  "Lift two different objects and say which one is light and heavy."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Weight balance.",
                  "See-saw etc."
                ],
                "EVALUATION GUIDE": [
                  "show two different objects and select which one is heavier than the other."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "Shapes",
            "TOPICS": [
              {
                "TOPIC NAME": "Three dimensional shapes",
                "PERFORMANCE OBJECTIVES": [
                  "sort out cubes, cuboids, cylinders and spheres;",
                  "identify and name cuboids, cubes, cylinders and spheres;",
                  "distinguish between cuboids and cubes;",
                  "mention solid shapes in homes and environment."
                ],
                "CONTENT": [
                  "Cubes, cuboids cylinders and spheres."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to sort out these objects (Solids) according to shapes.",
                  "Leads pupils to identify and name the sorted solids.",
                  "Guides pupils to distinguish between cuboids and cubes.",
                  "Leads pupils to mention the solid shapes in homes and environment."
                ],
                "PUPILS ACTIVITIES": [
                  "Sort out objects (solids) according to shapes.",
                  "Identify and name the stored solids (shapes).",
                  "Distinguish between cuboids and cubes.",
                  "Mention the solid shapes in their homes and environment."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Ludo dice, match boxes empty packets of sugar, empty tins of Milo, milk, balls different sizes etc.",
                  "Charts showing pictures of: - Cuboids - Cubes - Cylinder - Spheres"
                ],
                "EVALUATION GUIDE": [
                  "sort out different solids (shapes) according to their shapes;",
                  "identity and name different solids (shapes);",
                  "distinguish between given cuboids and cubes;",
                  "give examples of solid shapes in their homes and environment."
                ]
              },
              {
                "TOPIC NAME": "Two dimensional shapes",
                "PERFORMANCE OBJECTIVES": [
                  "identify a Square, a Rectangle and a Circle.",
                  "match and name a square, a rectangle and a Circle.",
                  "distinguish between squares and rectangles.",
                  "mention square, rectangular and circular shapes in homes."
                ],
                "CONTENT": [
                  "Squares, Rectangles and Circles."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to mention groups of objects with similar flat faces such as squares, rectangles and circles.",
                  "Leads pupils to discover the distinguishing features of square, rectangle and circle.",
                  "Guides pupils to mention square, rectangular and circular shapes in their homes."
                ],
                "PUPILS ACTIVITIES": [
                  "Group objects with similar flat faces.",
                  "Discover distinguishing features of square, rectangle and circle.",
                  "Mention the square, rectangular and circular shapes in their homes."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Shapes, drawings and Cut-outs of: -squares -rectangles -circles.",
                  "Empty tins of bournvita, milk, etc.",
                  "Empty packets of sugar, chalk, etc"
                ],
                "EVALUATION GUIDE": [
                  "match a given flat face with the name: square, rectangle and circle;",
                  "distinguish between given square and rectangle;",
                  "name three square, rectangular and circular shapes in their homes."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "EVERY DAY STATISTICS",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Data Collection and Presentation",
            "TOPICS": [
              {
                "TOPIC NAME": "Data Collection",
                "PERFORMANCE OBJECTIVES": [
                  "collect data on their ages at home and school;",
                  "collect data on their heights."
                ],
                "CONTENT": [
                  "Data Collection on: 1. Ages of pupils; 2. Height of pupils."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to mention their ages.",
                  "Leads pupils to measure their heights."
                ],
                "PUPILS ACTIVITIES": [
                  "Measure their ages.",
                  "Measure their heights.",
                  "Group themselves according to their ages and heights."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pupils themselves.",
                  "Cards written ages.",
                  "Wall rule, etc."
                ],
                "EVALUATION GUIDE": [
                  "group themselves according to their: - ages - heights",
                  "mention their ages/heights."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  "PRIMARY 2": {
    "THEMES": [
      {
        "THEME NAME": "NUMBER AND NUMERATION",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Whole Number",
            "TOPICS": [
              {
                "TOPIC NAME": "Whole numbers 1-200",
                "PERFORMANCE OBJECTIVES": [
                  "count numbers correctly from 1-200;",
                  "identify and read numbers from 1 - 200;",
                  "identify order and write numbers up to 200."
                ],
                "CONTENT": [
                  "Counting of numbers from 1-200.",
                  "Identification and reading of numbers from 1-200.",
                  "Introduction of place value of a number.",
                  "Ordering of numbers up to 200.",
                  "Writing numbers up to 200."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to: - revise counting of numbers from 1-99 using counters and 100-square charts; - add one counter to 99 counters, and recap that 100 is equal to 99 plus one i.e. 100 = 99 + 1; - count numbers 1 to 200.",
                  "Guides pupils to identify and read numbers from 1- 200.",
                  "Builds up piles in tens and units, and demonstrates that bringing three piles of tens and eight sticks represents 38, etc.",
                  "Builds up piles in tens and units.",
                  "Guides pupils to use bundles or piles to demonstrate place value.",
                  "Guides pupils to order given piles of numbers",
                  "Write numbers up to 200"
                ],
                "PUPILS ACTIVITIES": [
                  "Revise counting from 1-99.",
                  "Layout bottle tops in rows and columns of ten up to 100.",
                  "Count from one to two hundred(1-200)",
                  "Identify and read numbers from 1- 200.",
                  "Build up piles to correspond with the number given.",
                  "Build up piles in tens and units.",
                  "Write number in expanded form and use same to find place value.",
                  "Order given piles of numbers.",
                  "Write numbers up to 200."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Concrete objects such as bottle tops, sticks, seeds, small waterproof bags for bundles of seeds/bottle tops, ropes, straws and two hundred square charts etc.",
                  "Flash cards",
                  "Sticks, Charts of numbers 1-200 etc."
                ],
                "EVALUATION GUIDE": [
                  "arrange and count correctly using bottle tops in tens up to two hundreds;",
                  "count bundles of straw in tens and hundreds up to two hundreds;",
                  "build Piles corresponding to given numbers;",
                  "say the number representing a pile;",
                  "build piles corresponding to a given number;",
                  "identify and read given numbers on Flash cards;",
                  "write given numbers in expanded form;",
                  "order given piles of numbers;",
                  "write numbers up to 200."
                ]
              },
              {
                "TOPIC NAME": "Fractions",
                "PERFORMANCE OBJECTIVES": [
                  "divide a collection of concrete objects into two equal parts and four equal parts;",
                  "obtain 3/4 of a concrete object."
                ],
                "CONTENT": [
                  "1/2 and 1/4 of any given collection.",
                  "3/4 of any given collection."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to divide the objects into two equal parts and four equal parts i.e. (1/2 of 10 = 5), (1/4 of 20 = 5)",
                  "Guides pupils divide the objects into four equal parts to obtain three quarter.",
                  "Guides pupils fold cardboard papers once and fold again to get four parts and shade the three parts, or cut an orange into four equal parts and remove one part."
                ],
                "PUPILS ACTIVITIES": [
                  "Divide the objects into two equal parts and four equal parts i.e. (1/2 of 10 = 5), (1/4 of 20 = 5).",
                  "Divide the objects into four equal parts to obtain three- quarters.",
                  "Fold cardboard papers once and fold again to get four parts and shade the three parts, or cut an orange into four equal parts and remove one part."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Oranges, Cardboard papers, etc"
                ],
                "EVALUATION GUIDE": [
                  "find 1/2 and 1/4 of given collections of objects;",
                  "find 3/4 of given collections of objects."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "BASIC OPERATIONS",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Basic Operations",
            "TOPICS": [
              {
                "TOPIC NAME": "Addition",
                "PERFORMANCE OBJECTIVES": [
                  "add 2-digit numbers without exchanging or renaming;",
                  "add 3-digit numbers without exchanging or renaming;",
                  "add 2-digit numbers with exchanging or renaming;",
                  "add 3 numbers taking two at a time."
                ],
                "CONTENT": [
                  "Revision of addition of 2-digit numbers without exchanging or renaming.",
                  "Addition of 3-digit numbers without exchanging or renaming.",
                  "Addition of 2-digit numbers with exchanging or renaming.",
                  "Addition of 3 numbers taking two at a time."
                ],
                "TEACHER ACTIVITIES": [
                  "Revises addition of 2-digit numbers without exchanging or renaming",
                  "Guides pupils to solve addition problems of 3-digit numbers. e.g. 141 + 125 =",
                  "Leads pupils to arrange counters in bundles of tens and write e.g. 35 sticks = 3 bundles of sticks and 5 pieces.",
                  "Leads pupils to count and say the numbers in the expanded form and be able to write the numerals in that form e.g. 96 = 9 tens + 6 units.",
                  "Guides pupils to solve some addition problems on the board e.g. 76 + 19 =",
                  "Guides pupils to mention the number of tens and units in each of the numbers ,writes it on the board e.g 76 = 70 + 6 19 = 10 + 9 80 15 But 15 = 10 + 5 80+15=80+10+5=95",
                  "Guides pupils on verbal addition using Flash cards."
                ],
                "PUPILS ACTIVITIES": [
                  "Revises addition of 2-digit numbers without exchanging or renaming.",
                  "Solves addition of 3-digit numbers such as 141 + 125 = 266",
                  "Provides answers to the given problems.",
                  "Arrange counters in bundles of tens and units.",
                  "Count and say the numbers in the expanded form and write the numerals as 96 = 9 tens + 6 units 75 = 7 tens + 5 units 58 = 5 tens + 8 units.",
                  "Add given 2-digit number on the board.",
                  "Mention the number of tens and units in each of the numbers on the board.",
                  "Solve the verbal addition contained in addition cards."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Number Beads",
                  "Bean seed",
                  "Cards, etc",
                  "Charts on addition of 3-digit numbers without renaming, etc",
                  "Counters such as, sticks, bottle tops.",
                  "Addition cards."
                ],
                "EVALUATION GUIDE": [
                  "add given 2-digit numbers without exchanging or renaming;",
                  "add 3-digit numbers vertically without exchanging or renaming;",
                  "add 2-digit numbers with exchanging and renaming;",
                  "add 3 given numbers taking at a time."
                ]
              },
              {
                "TOPIC NAME": "Subtraction",
                "PERFORMANCE OBJECTIVES": [
                  "subtract 2-digit numbers without exchanging or renaming;",
                  "subtract 2-digit numbers with exchanging and renaming;",
                  "apply addition and subtraction in everyday activities."
                ],
                "CONTENT": [
                  "Subtraction of 2-digit numbers without exchanging or renaming.",
                  "Subtraction of 2-digit numbers with exchanging or renaming."
                ],
                "TEACHER ACTIVITIES": [
                  "Revises subtraction of 1-digit numbers.",
                  "Leads pupils to identify number of tens and write in 2-digit numbers i.e. place value.",
                  "Guides pupils in the use of counters to demonstrate subtraction as taking away in 2-digit numbers e.g. 44-12 = 44 -12",
                  "Guides pupils to identify the digits that are in tens and units eg, 43 = 4 tens + 3 units 57 = 5 tens + 7 units 83 = 8 tens + 3 units",
                  "Leads pupils to give examples of everyday activities where accuracy of addition and subtraction are required.",
                  "Guides pupils in solving subtraction problems on the board e.g. 54 - 47",
                  "Guides pupils to mention the number of tens and units in a given e.g. Subtract 47 from 54, rename 54 = 40 + 14; then subtract"
                ],
                "PUPILS ACTIVITIES": [
                  "Solve quick problems on subtraction of 1-digit numbers.",
                  "Practice expressing place values e.g. 36 = 3 tens, 6 unit 28 = 2 tens, 8 units.",
                  "Give the answer to given problem using counter e.g. counts 44 and take away 12 44-12 = 32 44 -12 32",
                  "Mention the digits in the tens and units in the expanded form.",
                  "Give examples of everyday activities where accuracy of addition and subtraction are required.",
                  "Subtract, given 2- digit numbers.",
                  "Mention the numbers of tens and units in a given number."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Number cards",
                  "Cardboard strips with numerals and number line, etc.",
                  "Number Beads",
                  "Sticks",
                  "Counters such as: Oranges Beans seeds Bottle tops."
                ],
                "EVALUATION GUIDE": [
                  "subtract 2-digit numbers without exchanging or renaming;",
                  "subtract 2-digit numbers with exchanging and renaming;",
                  "mention 4 everyday activities where accuracy is needed."
                ]
              },
              {
                "TOPIC NAME": "Multiplication",
                "PERFORMANCE OBJECTIVES": [
                  "multiply numbers using repeated additions;",
                  "apply correctness in multiplications as important in everyday activities."
                ],
                "CONTENT": [
                  "Multiplication as repeated addition and the use of symbol 'x'"
                ],
                "TEACHER ACTIVITIES": [
                  "Uses counters to demonstrate the idea of multiplication as repeated additions e.g. 2+2+2= 6 and 4+4= 8 i.e. three sets of two and two sets of four.",
                  "Guides pupils to use the symbol 'x' to mean multiplication i.e. 2+2+2 = 2 x 3 = 6 and 4+4 = 4 x 2 = 8.",
                  "Emphasizes correct multiplication as an important exercise in everyday activities.",
                  "Guides pupils to give examples of everyday activities where multiplication is necessary e.g. trading 1 dozen of books = 12 books 3 dozen of books = 3 x 12 = 36 books"
                ],
                "PUPILS ACTIVITIES": [
                  "Use counters to carry out multiplication as repeated addition",
                  "Use the symbol 'x' in multiplication.",
                  "Apply the value of multiplications in everyday activities.",
                  "Give examples of daily activities where multiplication is necessary."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Number cards",
                  "Cardboard strips with numerals and number line, etc.",
                  "Number Beads",
                  "Sticks",
                  "Counters such as: Oranges Beans seeds Bottle tops."
                ],
                "EVALUATION GUIDE": [
                  "multiply the given numbers using repeated addition;",
                  "mention some everyday activities that require accurate multiplication."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "ALGEBRAIC PROCESSES",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Open Sentences",
            "TOPICS": [
              {
                "TOPIC NAME": "Open Sentences",
                "PERFORMANCE OBJECTIVES": [
                  "find missing numbers in an open sentence;",
                  "Solve simple related quantitative aptitude problems."
                ],
                "CONTENT": [
                  "Open Sentences"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to find missing Numbers such as : • 2+  = 5 • 6-  = 3",
                  "Guides pupils to solve simple related quantitative aptitude problems."
                ],
                "PUPILS ACTIVITIES": [
                  "Solve series of problems involving open sentences.",
                  "Solve simple related quantitative aptitude problems."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Bottle tops",
                  "Number cards",
                  "Dot cards",
                  "Pupils themselves"
                ],
                "EVALUATION GUIDE": [
                  "solve given problems on open sentences;",
                  "find missing no in a simple related quantitative aptitude problems."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "MENSURATION AND GEOMETRY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Primary Measures",
            "TOPICS": [
              {
                "TOPIC NAME": "Money",
                "PERFORMANCE OBJECTIVES": [
                  "enumerate the uses of money;",
                  "recognize all types of Nigerian coins and bank notes;",
                  "change money up to #20 into small units and shop with money not greater than #20."
                ],
                "CONTENT": [
                  "Uses of money",
                  "Nigerian coins an bank notes",
                  "Changing units of money e.g. 10k coins = 10kpiece; two 5kpiece = 10k #5 = 5 x 1.00 = 10 x 50k = 20 x 25k etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to list the various uses of money.",
                  "Guides pupils recognize and identify the Nigerian coins and bank notes.",
                  "Brings various articles to the class with price tags not more than #20.models of coins are also brought to the class by the teacher.",
                  "Guides pupils shop in the class."
                ],
                "PUPILS ACTIVITIES": [
                  "Mention the uses of money.",
                  "Recognize and identify the Nigerian coins and bank notes.",
                  "Change money up to #20 into small units and shop with money not greater than #20."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Nigerian coins and bank notes.",
                  "Chart of coins and bank notes.",
                  "Various articles with price tag less than N5."
                ],
                "EVALUATION GUIDE": [
                  "list various uses of money;",
                  "recognize and identify given Nigeria coins and bank notes;",
                  "collect correct change from buying an article from the class shop."
                ]
              },
              {
                "TOPIC NAME": "Length",
                "PERFORMANCE OBJECTIVES": [
                  "compare their natural units with another e.g. arm's length;",
                  "identify the differences in arm's length and other parts of the body used for measurement;",
                  "use meters and centimetres as standard measuring units;",
                  "identify the need for lengths and measurement using standardized units."
                ],
                "CONTENT": [
                  "Comparing natural units of groups of lengths.",
                  "Measurement in metres and centimetres."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to measure the length of the classroom with their foot and arms length and record their results.",
                  "Lead pupils to find out the difference in arm's length and other parts of the body used for measurement.",
                  "Guides pupils to use metre rule to measure some objects in the class.",
                  "Emphasizes on the importance of standard unit as opposed to natural units of measurement.",
                  "Leads pupils to identify the need for standard unit of measure within the society."
                ],
                "PUPILS ACTIVITIES": [
                  "Measure the length of their classroom with their foot and arms length and compare their results with one another.",
                  "Identify the difference in arms length and other parts of the body used for measurement.",
                  "Use metre rule to measure some objects in the class.",
                  "note the importance of standard unit as opposed to natural units of measurement",
                  "Identify the need for standard units in measurement."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The classroom.",
                  "Pupils themselves etc.",
                  "Metre rule 30cm ruler."
                ],
                "EVALUATION GUIDE": [
                  "measure the width of their classroom with their foot and arm's length;",
                  "measure the width of their classroom with rule;",
                  "explain the value of standardized unit of measure."
                ]
              },
              {
                "TOPIC NAME": "Time",
                "PERFORMANCE OBJECTIVES": [
                  "give time to the hour and half;",
                  "name and arrange days of the week."
                ],
                "CONTENT": [
                  "Reading clocks to the hour and half hour.",
                  "Naming days of the week and arranging them in order"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the long and short hands of the clock.",
                  "Leads pupils to relate half hour to half of the clock face and emphasize the convention of say 'half past'.",
                  "Writes a given time on the board.",
                  "Guides pupils name the days of the week.",
                  "Leads pupils to arrange and learn the days of the week in order from Sunday to Saturday."
                ],
                "PUPILS ACTIVITIES": [
                  "Say the time as shown on clocks (real or card board).",
                  "Write given time in 'their exercise' books.",
                  "Name the days of the week",
                  "Arrange and learn the days of the week in order from Sunday to Saturday."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Real clocks",
                  "Card board clocks",
                  "Dummy Clock",
                  "Calendars",
                  "Table of days of the week"
                ],
                "EVALUATION GUIDE": [
                  "say the time on a given cardboard clock or time on the clock drawn on the cardboard;",
                  "write the time of a given diagram or cardboard on the board/ exercise book;",
                  "name the days of week;",
                  "name the day before and after a given day."
                ]
              },
              {
                "TOPIC NAME": "Weight",
                "PERFORMANCE OBJECTIVES": [
                  "order objects according to their weights."
                ],
                "CONTENT": [
                  "Comparison and ordering of objects by weight"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides the pupils in comparing the weights of objects taking two at a time by using: Hand balancing Improvised scale Bathroom scale",
                  "Obtains the weights of different pupils using see-saw and bath-room scales.",
                  "Arranges the objects/pupils weights obtained to determine which object/pupils weight is \"heavier than the other\"."
                ],
                "PUPILS ACTIVITIES": [
                  "Compare weights of objects and their weights using: hand balancing improvised scale, bath-room scale and see-saw",
                  "Arrange the objects/pupils weights obtained to determine which object/pupils weight is \"heavier than the other\"."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Stones, Oranges, Coconut, improvised scale, bathroom scale, strings, length of sticks, see-saw, etc"
                ],
                "EVALUATION GUIDE": [
                  "compare the weights of two given objects and pupils and determine which or who is \"heavier than the other\""
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "Secondary Measures",
            "TOPICS": [
              {
                "TOPIC NAME": "Capacity",
                "PERFORMANCE OBJECTIVES": [
                  "identify and name objects that could be used for measuring capacity e.g. cups, empty containers buckets etc.;",
                  "order containers based on their capacities."
                ],
                "CONTENT": [
                  "Identifying and naming of objects that could be used for measuring capacity e.g. cups, empty containers, buckets etc.",
                  "Ordering of containers based on their capacities"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to say the uses of the empty containers and emphasizes the use of the containers for measuring capacity.",
                  "Guides pupils to measure into different containers of different sizes with a small container and noting how many in each case.",
                  "Guides pupil to arrange the containers according to the number of times the small containers was measured.",
                  "Explains the arrangements and leads pupils to the idea of ordering of containers based on capacities."
                ],
                "PUPILS ACTIVITIES": [
                  "Say the uses of each of these containers.",
                  "Measure and note the number of times in each case.",
                  "Arrange the containers according to the number of times the small containers was measured."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Cups",
                  "Buckets",
                  "Empty containers",
                  "Tins etc."
                ],
                "EVALUATION GUIDE": [
                  "use a small cup to measure water into a container and say how many of the cups of water would fill the container;",
                  "order given containers based on capacities."
                ]
              },
              {
                "TOPIC NAME": "Area",
                "PERFORMANCE OBJECTIVES": [
                  "compare areas of surfaces;",
                  "identify the use of standard measuring units;"
                ],
                "CONTENT": [
                  "Areas of different objects: rectangles, squares, triangles circles and other surfaces.",
                  "The idea of larger than, smaller than largest, smallest and the same."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to compare areas of different surfaces.",
                  "Leads pupils to appreciate standard measuring units."
                ],
                "PUPILS ACTIVITIES": [
                  "Compare areas of different surfaces.",
                  "Identify the use of standard measuring units."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Plane shapes (square and rectangles etc)"
                ],
                "EVALUATION GUIDE": [
                  "compare areas of given surfaces."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "Shapes",
            "TOPICS": [
              {
                "TOPIC NAME": "Three Dimensional shapes",
                "PERFORMANCE OBJECTIVES": [
                  "identify and count the flat faces of a cube and a cuboid;",
                  "identify and count the corners of a cube and a cuboid;",
                  "identify and count the edges of a cube and a cuboid;",
                  "identify objects at home that are cuboids and cubes;",
                  "identify the curved surfaces of a cylinder;",
                  "mention three dimensional objects in their homes that are cylinders and spheres."
                ],
                "CONTENT": [
                  "Properties of a cube and a cuboid: • Faces • Corners • Edges",
                  "Properties of a Cylinder and a sphere: ■ Curved surface"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides the pupils to identify and count the faces, corners and edges of a cuboid and a cube.",
                  "Leads pupils to mention objects at homes that are cuboids and cubes.",
                  "Guides pupils to identify the flat curved surfaces of a cylinder and a sphere.",
                  "Lead pupil to mention the differences between the flat faces and the curved surfaces of a cylinder and a sphere",
                  "Leads pupils to mention object at homes that are cylinders and spheres."
                ],
                "PUPILS ACTIVITIES": [
                  "Identify and count the faces, corners and edges of a cuboids and a cube.",
                  "Copy the board summary.",
                  "Mention objects at home that are cuboids and cubes",
                  "Identify the flat faces and curved surfaces of a cylinder and a sphere",
                  "Mention the differences between the flat faces and the curved surfaces of a Cylinder and a sphere.",
                  "Mention objects at home that are cylinders and spheres"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Boxes, tins, balls, paper cuttings and drawing of cubes and cuboids, etc",
                  "Balls, milk tin, paper cuttings and drawings, etc"
                ],
                "EVALUATION GUIDE": [
                  "identify cuboids and cubes from a given collection of three dimensional objects;",
                  "count the faces, corners and edger of a given cube and cuboids;",
                  "mention three objects each that are cuboids and cubes;",
                  "Complete a chart to indicate the number of flat faces, corners, edges and curved surfaces of a cube, a cuboid, a cylinder and a sphere;",
                  "mention six three dimensional objects each in their home that are cylinders and spheres."
                ]
              },
              {
                "TOPIC NAME": "Two dimensional shapes",
                "PERFORMANCE OBJECTIVES": [
                  "identify a square, a rectangle, a circle and a triangle;",
                  "indicate which corner of a 2- dimensional shape is a \"square corner\"."
                ],
                "CONTENT": [
                  "Identification of shapes: Square Rectangle Circle Triangle",
                  "\"Square corners\" in shapes"
                ],
                "TEACHER ACTIVITIES": [
                  "Brings squares, rectangles, circle and triangle materials to class.",
                  "Leads pupils to identify square and rectangular faces of cubes and cuboids, and circular faces of cylinders;",
                  "Leads pupils to draw triangles by joining three non-collinear points.",
                  "Leads pupils to. discover that a triangle has three sides and three corners.",
                  "Guides pupils to discover corners that are \"square corners\" in cubes, cuboids, squares, rectangles and some triangles.",
                  "Guides pupils to discover that a square or a rectangle has foursquare corners.",
                  "Guides pupils to. discover that some triangles have only one \"square corner\" while other triangles have no \"square corner.\""
                ],
                "PUPILS ACTIVITIES": [
                  "Identify square and rectangular faces of cubes and cuboids, and circular faces of cylinders.",
                  "Draw triangles by joining three non- collinear points.",
                  "Identify that a triangle has three sides and three corners.",
                  "Discover corners that are \"square corners\" in cubes, cuboids, squares, rectangles and some triangles.",
                  "Discover that a square or a rectangle has four square corners.",
                  "Discover that some triangles have only one \"square corner\" while other triangles have no \"square corner\"."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Cubes, match boxes, tins, paper cuttings and drawings of squares, rectangles, triangles circles."
                ],
                "EVALUATION GUIDE": [
                  "identify objects that have square, rectangular and circular faces;",
                  "draw different types of triangles in their exercise books;",
                  "match given shapes with their corresponding names;",
                  "identify \"square corners\" of a given cube, cuboids, square, rectangles or triangle."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "EVERY DAY STATISTICS",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Data Collection and Presentation",
            "TOPICS": [
              {
                "TOPIC NAME": "Data Collection",
                "PERFORMANCE OBJECTIVES": [
                  "collect data and arrange them in arrays;",
                  "collect data and arrange them in groups."
                ],
                "CONTENT": [
                  "Collecting data and arranging them in arrays.",
                  "Collecting data and arranging them in groups."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to collect data and arrange them in arrays.",
                  "Arrange them in groups such as group of boys and group of girls"
                ],
                "PUPILS ACTIVITIES": [
                  "Collect data and arrange them in arrays.",
                  "Collect data and arrange them in groups."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pupils themselves.",
                  "Cards written ages.",
                  "Wall rule, etc."
                ],
                "EVALUATION GUIDE": []
              }
            ]
          }
        ]
      }
    ]
  },
  "PRIMARY 3": {
    "THEMES": [
      {
        "THEME NAME": "NUMBER AND NUMERATION",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Whole Number",
            "TOPICS": [
              {
                "TOPIC NAME": "Whole numbers up to 999",
                "PERFORMANCE OBJECTIVES": [
                  "count correctly numbers up to 999;",
                  "state the place value of a digit in a 3-digit number;",
                  "order whole numbers and use the symbol < and >;",
                  "mention the need for counting and ordering."
                ],
                "CONTENT": [
                  "Correct counting of numbers up to 999.",
                  "Counting in groups of Hundreds, Tens, and units (H.T.U.).",
                  "Ordering whole numbers with symbols < and >."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to prepare piles or bundles in hundreds, tens and units.",
                  "Guides pupils to count up to 999.",
                  "Guides pupils to identify and read out the numbers up to 999.",
                  "Guides pupils to prepare a collection of counters in hundreds, tens and units.",
                  "Guides pupils to count numbers in hundreds, tens and units.",
                  "Guides pupils to expands a given number say 432 in hundreds, tens and units as: 432 400 + 30 + 2.",
                  "Guides pupils to compare two given whole numbers using the procedure of considering the numbers under hundred first, if the numbers are equal, the numbers under Tens are considered and so on. For example, comparing 516 and 342, 3 and 5 are under H respectively, but 5 is greater than 3. Then 342 is less than 516 or 516 is greater than 342.",
                  "Leads pupils to mention the importance of counting and ordering of whole numbers."
                ],
                "PUPILS ACTIVITIES": [
                  "Prepare piles or bundles of given collection in hundreds, tens and units.",
                  "Count up to 999.",
                  "Identify and read out the numbers up to 999.",
                  "Prepare a collection of counters in hundreds, tens and units.",
                  "Count numbers in hundreds, tens and units.",
                  "Expand and present whole numbers in hundreds, tens and units.",
                  "Compare the given numbers using symbols of < and >.",
                  "Mention the need for counting and ordering in everyday activities."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Match sticks",
                  "Bottle tops",
                  "Seeds",
                  "Rope",
                  "Rubber band",
                  "Pebbles",
                  "Charts of written whole numbers",
                  "Place value chart",
                  "Counters",
                  "Abacus",
                  "Inequality chart",
                  "Elbow sign"
                ],
                "EVALUATION GUIDE": [
                  "count objects in hundreds, tens and units;",
                  "identify and read out given numbers up to 999;",
                  "state the place value of a digit in a given whole number;",
                  "order pairs of 3-digit numbers using < and > symbols."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "Fraction",
            "TOPICS": [
              {
                "TOPIC NAME": "Fractions",
                "PERFORMANCE OBJECTIVES": [
                  "state fraction of a group of concrete objects;",
                  "divide shapes into 1/2, 1/3, 1/4 etc.;",
                  "write fractions which have the same value as a given fraction;",
                  "use the symbol < or > to order fractions."
                ],
                "CONTENT": [
                  "Fractions (1/2, 1/3, 1/4, 1/5, 1/6)",
                  "Fractions of shapes: squares, circle, rectangle and triangle.",
                  "Equivalent fractions.",
                  "Ordering of fractions."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to divide a given number into parts without remainder to form fractions.",
                  "Guides pupils to divide shapes into given number of parts without remainder.",
                  "Guides pupils to match the division with the corresponding fraction e.g. 1/2, 1/3, 1/4 etc.",
                  "Guides pupils to divide different set of objects into two to discover that 1/2 = 2/4 = 3/6 = 4/8",
                  "Guides pupils to divide different sets of objects into 3 to discover that 1/3 = 2/6 = 4/12.",
                  "Guides pupils to use 2 pieces of paper of the same size and marker to divide first into 2 and second into four equal parts, colour and match the outcome.",
                  "Guides pupils to divide sets of objects.",
                  "Using the number of objects for the various fractions, leads pupils to identify which fraction is less than (<) or greater than (>) the other, e.g. 1/4 < 1/2 1/5 < 1/4 and 1/4 > 1/5 1/2 > 1/5"
                ],
                "PUPILS ACTIVITIES": [
                  "Divide a set of objects into various fractions (e.g. 1/2, 1/3, 1/4, 1/5, 1/6).",
                  "Divide shapes into given number of parts without remainder.",
                  "Match division of sets of object or shapes into various parts with a fraction: 1/2, 1/3, 1/4 etc.",
                  "Divide different set of objects into two to discover that 1/2 = 2/4 = 3/6 = 4/8",
                  "Divide, colour and match the outcome of the marked paper.",
                  "Divide sets of objects.",
                  "Using the result obtained above, identify which fraction is less than (<) or greater than (>) the other."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Concrete objects: counters, paper cut outs in shapes of square, circle, rectangle and triangle,",
                  "Papers of equal sizes, Markers, Coloured pencils or crayon, Inequality chart, etc."
                ],
                "EVALUATION GUIDE": [
                  "divide a given set of objects into 1/2, 1/3, 1/4, 1/5;",
                  "divide given shapes into fractions: 1/2, 1/3, 1/4, 1/5, 1/6;",
                  "divide given set of objects into a given number of part to form required equivalent fractions;",
                  "order given set of fractions using the symbol < or >."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "BASIC OPERATIONS",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Basic Operations",
            "TOPICS": [
              {
                "TOPIC NAME": "Addition",
                "PERFORMANCE OBJECTIVES": [
                  "add 2-digit numbers with exchanging or renaming;",
                  "add 3 digit numbers;",
                  "add 3 numbers taking two at a time;",
                  "add fractions with the same denominator;",
                  "mention the need for correct addition of numbers and fractions in everyday activities."
                ],
                "CONTENT": [
                  "Addition of 2-digit numbers with exchanging or renaming",
                  "Addition of 3-digit numbers",
                  "Addition of 3 numbers taking two at a time",
                  "Addition of fractions with the same denominator"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to arrange counters in bundles of tens and write e.g. 35 stones = 3 bundles of stone and 5 piece.",
                  "Guides pupils to count and say the numbers in the expanded form and be able to write the numerals in that form e.g. 96 = 9 tens + 6 units 75 = 7 tens + 5 units 58 = 5 tens + 8 units",
                  "Guides pupils in solving some addition problems on the board e.g. 76 + 19 =",
                  "Guides pupils to mention the number of tens and units in each of the numbers written on the chalkboard: 76 = 70 + 6 19 = 10 + 9 80 15 But 15 = 10 + 5 80+15=80+10+5=95",
                  "Guides pupils to add two numbers with 3-digits that involves exchanging or renaming.",
                  "Guides pupils on the use of abacus in adding numbers.",
                  "Guides pupils on oral additions using addition cards. Flash the addition cards to the pupils and let them respond by giving correct answers to questions such as: 5+8, 7+4, 6+5+7 etc. contained in addition cards.",
                  "Guides pupils to identify fraction with same denominator from the fraction boards.",
                  "Guides pupils to add fractions having the same denominator: 3/6 + 2/6 = 3/5 + 2/5 =",
                  "Guides pupils to give examples of daily activities that demand correctness in addition of numbers addition of fractions."
                ],
                "PUPILS ACTIVITIES": [
                  "Arrange counters in bundles of tens and units.",
                  "Count and say the numbers in the expanded form and write the numerals as: 96 = 9 tens + 6 units.",
                  "Add given 2-digit number on the board.",
                  "Mention the number of tens and units in each of the numbers on the board.",
                  "Add two numbers with 3-digits that involve renaming or exchanging.",
                  "Use abacus to perform addition of two numbers with 3-digits",
                  "Respond to the oral addition contained in addition card.",
                  "Use fraction board to bring out fractions with the same denominator.",
                  "Add fraction with the same denominator.",
                  "Mention the need for correct addition of whole numbers and fraction.",
                  "Give examples of daily activities requiring correct additions of whole number and fractions."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts and flash cards, etc. Addition cards, etc. Fraction card, Fraction board, etc.",
                  "Counters, charts Abacus, etc."
                ],
                "EVALUATION GUIDE": [
                  "add 2-digit numbers with exchanging and renaming;",
                  "add two given 3-digits numbers with exchanging;",
                  "add two numbers with 3-digits that involve renaming using abacus;",
                  "add 3 given numbers taking two at a time;",
                  "add given fractions with the same denominator;",
                  "identify the total parts to be coloured when a cardboard is divided into 2/6 + 3/6 = 5/6;",
                  "give three examples of everyday activities that demands accuracy of addition of numbers and fractions."
                ]
              },
              {
                "TOPIC NAME": "Subtraction",
                "PERFORMANCE OBJECTIVES": [
                  "subtract 2-digit numbers with exchanging or renaming;",
                  "subtract 3 - digit numbers;",
                  "subtract 3 numbers taking two at a time;",
                  "subtract fractions with the same denominator;",
                  "mention the need for correct subtraction of numbers and fractions in everyday activities."
                ],
                "CONTENT": [
                  "Subtraction of 2-digit numbers with exchanging or renaming.",
                  "Subtraction of 3-digit numbers.",
                  "Subtraction of 3 numbers taking two at a time.",
                  "Subtraction of fractions with the same denominator."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to arrange counters in bundles of tens and write e.g. 35 stones = 3 bundles of stone and 5 piece.",
                  "Guides pupils to count and say the numbers in the expanded form and be able to write the numerals in that form.",
                  "Guides pupils in solving some subtraction problems involving 2-digit numbers e.g. 54 - 47 =",
                  "Guides pupils to identify the number of tens and units e.g. 54 = 40 + 14 = 5 4 -47 = 40 + 7 -4 7 7",
                  "Guides pupils to subtract two numbers with 3-digits that involves exchanging or renaming.",
                  "Guides pupils to make use of abacus to subtract 3-digit numbers.",
                  "Drills pupils on mental additions with respect to subtraction using addition cards. Flash the addition cards to the pupils and let them respond by giving correct answers to questions such as: 8-5, 7-4, 10-5-4 etc. contained in addition cards.",
                  "Guide pupils to subtract fractions with the same denominators using the fraction board.",
                  "Emphasizes the need to be correct in subtraction of everyday activities.",
                  "Leads pupils to give examples of daily activities that demands correctness in: ■ Subtraction of numbers ■ subtraction of fractions"
                ],
                "PUPILS ACTIVITIES": [
                  "Arrange counters in bundles of tens and units.",
                  "Count and express the numbers in the expanded form and write the numerals as: 96 = 9 tens + 6 units.",
                  "Subtract given 2-digit number.",
                  "Identify the tens and units in given numbers.",
                  "Subtract two numbers with 3-digits that involve renaming or exchanging e.g. 876 - 487 982 - 540.",
                  "Use abacus to perform subtraction of two numbers with 3-digits.",
                  "Respond to the mental additions contained in addition card, presented to the by the teacher.",
                  "Identify fractions with same denominators.",
                  "Subtract fractions with the same denominators.",
                  "Mention the need for correct subtraction of whole numbers and fraction.",
                  "Give examples of daily activities requiring correct subtraction of whole number and fractions."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Counters such as stones, sticks, bottle tops, etc.",
                  "Charts, Abacus, subtraction cards, Fraction board, Flash cards, etc."
                ],
                "EVALUATION GUIDE": [
                  "subtract 2-digit numbers with exchanging and renaming;",
                  "subtract two given 3-digits numbers with exchanging or renaming;",
                  "subtract 2-digit numbers with exchanging and renaming;",
                  "subtract two given 3-digits numbers with exchanging or renaming."
                ]
              },
              {
                "TOPIC NAME": "Multiplication",
                "PERFORMANCE OBJECTIVES": [
                  "multiply from 1 x 1 to 9 x 9",
                  "multiply 2-digit number by 1-digit number;",
                  "multiply three 1-digit numbers taking two at a time;",
                  "carry out correct multiplication in everyday activities."
                ],
                "CONTENT": [
                  "Basic multiplication from 1 x 1 to 9 x 9.",
                  "Multiplication of 2-digit number by 1-digit e.g. 2 3 X 4 or 23 x 4 =",
                  "Multiplication of three 1-digit numbers taking two at a time e.g."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils in the use of square charts to carry out multiplication from 1 x 1 to 9 x 9.",
                  "Guides pupils to use repeated addition for multiplication e.g. 23 x 4 = i.e. 23+23+23+23 =",
                  "Guides pupils to use multiplication chart to multiply 2-digit number by 1-digit number horizontally or vertically e.g. 31 x 6 or 3 1 X 8",
                  "Guides pupils to multiply three 1- digit numbers taking two at a time e.g. 7 x 8 x 9 = (7x 8) x 9 = 56 x 9 = 504 Or 7x8x9 = 7x (8 x9) = 7 x 72 = 504",
                  "Emphasizes the need to carry out correct multiplication in everyday activities.",
                  "Leads pupils to give examples of areas where correct multiplication is important in everyday activities."
                ],
                "PUPILS ACTIVITIES": [
                  "Use square charts and multiplication tables to carry out multiplication from 1 x 1 to 9 x 9.",
                  "Carry out multiplication of 2-digit number by 1-digit number and use repeated addition for multiplication.",
                  "Practice multiplication of 2-digit numbers by 1-digit number horizontally or vertically.",
                  "Carry out series of multiplication of three 1-digit numbers taking two at a time",
                  "Carry out correct multiplication in everyday activities.",
                  "Give examples of everyday activities that require correct multiplication."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "10 x10 Square chart.",
                  "Multiplication table.",
                  "Chart showing multiplication of 2-digit number by 1-digit number.",
                  "Multiplications chart for three 1-digit numbers.",
                  "Multiplication table"
                ],
                "EVALUATION GUIDE": [
                  "carry out given multiplications from 1 x 1 to 9 x 9;",
                  "multiply given 2-digit number by 1-digit number;",
                  "multiply 2-digit number by 1-digit number vertically or horizontally;",
                  "multiply given three 1-digit numbers taking two at a time;",
                  "give examples of everyday activities that require correct multiplications."
                ]
              },
              {
                "TOPIC NAME": "Division",
                "PERFORMANCE OBJECTIVES": [
                  "divide whole numbers not exceeding 48 by 2, 3, 4, 5 and 6 without remainder;",
                  "express whole numbers not exceeding 48 as products of factors;",
                  "find a missing factor in a given numbers;",
                  "distinguish between factors and multiples;",
                  "carry out correct division in everyday activities."
                ],
                "CONTENT": [
                  "Division of whole numbers not exceeding 48 by 2, 3, 4, 5 and 6 without remainder.",
                  "Factors of Whole numbers not exceeding 48.",
                  "Finding a missing factor in a given number.",
                  "Factors and multiples of numbers."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils through division of whole numbers such as 20/5 or 20 ÷ 5.",
                  "Leads pupils divide by grouping and repeated subtraction, using counters not exceeding 48.",
                  "Guides pupils in expressing whole numbers not exceeding 48 as product of their factors e.g. 36 = 2 x 3 x 6.",
                  "Guides pupils to use rectangular pattern of numbers to find two, or three factors of whole numbers e.g.",
                  "Guides pupils to use rectangular pattern of number to solve many examples e.g. 30 = 2 x 3 x",
                  "Guides pupils to write out multiples of a given number e.g. multiple of 3 = 3, 6, 9, 12, 15, 18",
                  "Leads pupils distinguish between factors and multiples of given numbers.",
                  "Emphasizes the need to be accurate in carrying out divisions in everyday activities.",
                  "Leads pupils to give examples of everyday activities where correct division is needed."
                ],
                "PUPILS ACTIVITIES": [
                  "Divide whole numbers not exceeding 48 by 2. 3, 4, 5, 6.",
                  "Solve division problems using grouping and repeated subtractions.",
                  "Use rectangular pattern of numbers to find factor of given numbers.",
                  "Work problems involving finding missing factors of given numbers.",
                  "Distinguish between factors and multiples of given numbers.",
                  "Perform correct division in everyday activities such as: sharing of items among brothers and sisters; giving instances in everyday activities that demands accurate division."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Counters, Charts containing divisions not exceeding 48, Charts of factors of whole numbers, Rectangular pattern of numbers, Charts containing worked example, etc."
                ],
                "EVALUATION GUIDE": [
                  "divide whole numbers not exceeding 48 by 2,3,4,5 and 6 by grouping and repeated subtractions;",
                  "express given whole numbers not exceeding 48 as products of their factors;",
                  "construct rectangular pattern of numbers and use same to find factors of given numbers;",
                  "find missing factor of a given number",
                  "distinguish between factors and multiples of given numbers.",
                  "give examples of everyday activities that require correct divisions."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "ALGEBRAIC PROCESSES",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Open Sentences",
            "TOPICS": [
              {
                "TOPIC NAME": "Open Sentences",
                "PERFORMANCE OBJECTIVES": [
                  "find missing number in an open sentence;",
                  "identify the relationship between: addition and subtraction;",
                  "solve related quantitative aptitude problems."
                ],
                "CONTENT": [
                  "Open sentences"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to find missing numbers example 1. 9 +  = 15 2. 18-  = 7",
                  "Leads pupils to appreciate the relationship between + and -.",
                  "Guides pupils to solve quantitative aptitude problems on open sentences."
                ],
                "PUPILS ACTIVITIES": [
                  "Solve series of problems involving open sentences.",
                  "Give examples of open sentences in everyday life.",
                  "Solve related quantitative aptitude problems."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Chart containing worked examples on open sentences."
                ],
                "EVALUATION GUIDE": [
                  "solve given problems on open sentences;",
                  "find missing numbers in quantitative aptitude diagrams."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "MENSURATION AND GEOMETRY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Primary Measures",
            "TOPICS": [
              {
                "TOPIC NAME": "Money",
                "PERFORMANCE OBJECTIVES": [
                  "change money not exceeding #20 into smaller units;",
                  "shop effectively with money not greater than #20 using the idea of addition and subtraction;",
                  "perform simple multiplication involving money with product not exceeding #20."
                ],
                "CONTENT": [
                  "Changing money not exceeding #20 into smaller units.",
                  "Shopping involving addition and subtraction with money not greater than #20.",
                  "Multiplication involving money with product not exceeding #20."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to realize that there are five 1k coins in a 5k coin, two 5k coins in a 10k coin, five 10k coins in a 50k coin etc.",
                  "Gives pupils say 50k and ask them to change it into 10k coins etc.",
                  "Sets up a shopping corner in the classroom with items such as empty packets of Omo, tins of geisha, etc.",
                  "Appoints a pupil as shopkeeper and another as a customer. The customer goes to the shop keeper to buy some items, adds up the cost and gives the shop keeper an amount which may require change; money involved should not be greater than #20.",
                  "Guides pupils to solve problems on addition and subtraction of money not greater than #20.",
                  "Do mental skills with respect to multiplication of simple number e.g. 2x2, 5x2, 3x4, 4x4 etc.",
                  "Guides discussions on problems involving multiplication of money with product not exceeding #20 e.g. 12k x 3 = 36k N4 x 4 = 16"
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in the changing of money into smaller units not exceeding #20.",
                  "Collect items to be kept in the shopping corner.",
                  "Act as a shop keeper or as a customer.",
                  "Respond to mental skill on multiplications of given numbers.",
                  "Solve problems on multiplication involving money with product not greater than #20."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Real money and Models Money",
                  "Empty tins of milk, Geisha, Bournvita",
                  "Empty packets of sugar, Lipton",
                  "Empty packets of matches",
                  "Addition cards containing mental additions on simple multiplication."
                ],
                "EVALUATION GUIDE": [
                  "say how many of a given smaller denominations are contained in a bigger denomination such as #20;",
                  "do given exercises on addition and subtraction of money;",
                  "solve given problems on multiplication involving money with products not exceeding #20 to pupils to solve."
                ]
              },
              {
                "TOPIC NAME": "Length",
                "PERFORMANCE OBJECTIVES": [
                  "measure the length and/or width of room, table, building and straight edged materials, etc.;",
                  "mention importance/benefits of standard units of measurement;",
                  "find perimeters of regular figures in metres and centimeters by measurement;",
                  "identify perimeter of regular shapes in their environment;"
                ],
                "CONTENT": [
                  "Measure of lengths, widths and comparison of estimates with actual measurement using steps and hand span.",
                  "Measuring and finding the perimeter of regular figures in metres and centimeters."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to measure their table using hand spans.",
                  "Records their results in a tabular form for pupils to see which child has the longest span and who has the shortest span.",
                  "Estimate the length of various objects in their class.",
                  "Guides pupils to measure length of given objects using standard units.",
                  "Leads pupils to state the need for standard measuring units in centimeters.",
                  "Leads pupils to mention the importance/benefits of standard units.",
                  "Asks pupils to measure the two lengths and two widths of their tables and add their results.",
                  "Guides pupils to pick regular figures and measure all distances round and record their results.",
                  "Guides pupils to records all the results of their activities on the boards in a tabular form.",
                  "Leads pupils to find out that the distance round a plane object is called perimeter.",
                  "Leads pupils to find perimeter of regular shapes in their environment."
                ],
                "PUPILS ACTIVITIES": [
                  "Measure their table using their hand spans.",
                  "Find out which child has the longest and who has the shortest hand span.",
                  "Estimate the length of various objects in the class.",
                  "Measure the length of given objects using standard units of measurement.",
                  "Apply standard units of measure",
                  "Measure the two lengths and two widths of their tables and add their results.",
                  "Measure given regular figures and measure all distances round and record their results.",
                  "Record their results in a tabular form",
                  "Find the distance round a given plane object or space is called a perimeter.",
                  "Find the perimeter of plane shapes in the environment."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Ropes",
                  "Tapes",
                  "Rulers",
                  "Desks",
                  "Tables",
                  "Hand span of the pupil, etc.",
                  "Cut-outs of squares, rectangle triangles and teachers' table"
                ],
                "EVALUATION GUIDE": [
                  "measure given objects using hand spans standard units;",
                  "find perimeters of given figures by measurement."
                ]
              },
              {
                "TOPIC NAME": "Length II",
                "PERFORMANCE OBJECTIVES": [
                  "compare their non standard measures e.g. arms length;",
                  "identify the differences in the non-standard measures;",
                  "use meters and centimeters as standard measuring units;",
                  "identify the need for lengths and measurement using standardized units."
                ],
                "CONTENT": [
                  "Comparing non standard measures e.g. arms length.",
                  "Measurement in metres and centimeters."
                ],
                "TEACHER ACTIVITIES": [
                  "Asks pupils to measure the length of the classroom with their foot and arms length and record their results.",
                  "Lead pupils to find out the difference in arms length and other non standard measure used.",
                  "Guides pupils to use metre rule to measure some objects in the class.",
                  "Emphasizes the importance of standard unit as opposed to natural units of measurement.",
                  "Leads pupils to identify the need for standardize unit of measure within the society."
                ],
                "PUPILS ACTIVITIES": [
                  "Measure the length of their classroom with their foot and arms length and compare their results with one another.",
                  "Find out the difference in arms length and other non standard measures.",
                  "Use metre rule to measure some objects in the class.",
                  "Note the importance of standard unit as opposed to natural units of measurement.",
                  "Identify the need for standardized unit in measurement."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The classroom",
                  "Arms length",
                  "Foot, other nonstand ard measures",
                  "Metre rule",
                  "30cm ruler",
                  "Biro",
                  "Pencil"
                ],
                "EVALUATION GUIDE": [
                  "measure the length and width of their classroom with their foot and arms length;",
                  "measure the length and width of their classroom using standard measuring units;",
                  "explain the value of standardized unit of measure."
                ]
              },
              {
                "TOPIC NAME": "Time",
                "PERFORMANCE OBJECTIVES": [
                  "say time accurately in hours and minutes;",
                  "give dates in day and month;",
                  "mention the importance of time in daily life activities."
                ],
                "CONTENT": [
                  "Time on the clock.",
                  "Calendar reading of the days of the months, year and reading of dates."
                ],
                "TEACHER ACTIVITIES": [
                  "Uses clock chart to demonstrate to the pupils how to tell time.",
                  "Leads pupils to state time in minutes, hours, \"half past\" and \"quarter to\"",
                  "Designs activities that will enable pupils to state time in hours and minutes.",
                  "Displays calendar and guides pupils to say dates and when certain events like. Christmas, New Year, Easter, id-el-kabir and Nigerian Independence are celebrated.",
                  "Leads pupils to identify the use of time and dates in daily life activities."
                ],
                "PUPILS ACTIVITIES": [
                  "State time in minutes, hours, \"half past\" and \"quarter to\"",
                  "Participate in the activities that will enable them state time in hours and minutes",
                  "Study the calendar and say when certain events like Christmas, New Year, Easter, id-el-kabir and Nigerian Independence are celebrated. to locate the dates as indicated by the teacher.",
                  "Identify the use of time and date in daily life activities."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Clock charts",
                  "Real clock Calendars, etc"
                ],
                "EVALUATION GUIDE": [
                  "work exercises on how to tell time in minutes and hours;",
                  "draw clock faces to show different times;",
                  "demonstrate the ability to read calendar and state the date of a particular event in Nigeria;",
                  "say the number of days in every given month and the number of months in any given year."
                ]
              },
              {
                "TOPIC NAME": "Weight",
                "PERFORMANCE OBJECTIVES": [
                  "measure weights of objects in grams and kilograms;",
                  "make meaningful comparison of weight of objects like rocks, minerals;",
                  "appreciate the need for grams and kilogram as standard units of measure for transactions."
                ],
                "CONTENT": [
                  "Introduction of grams and kilograms as units of measurement.",
                  "Weights of some rocks and minerals."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to obtain the weight of some objects.",
                  "Explains that the weight of small objects like packets of sugar tins of milk are expressed in grams while the weight of heavy objects such as stones and human are expressed in kilograms.",
                  "Guides pupils to obtain the weight of some the rocks and minerals.",
                  "Leads pupils to apply the grams and kilograms as standard units of measure for transactions."
                ],
                "PUPILS ACTIVITIES": [
                  "Obtain the weight of some of these objects.",
                  "Note that the weight of small objects like packets of sugar tins of milk are expressed in grams while the weight of heavy objects such as stones and human are expressed in kilograms.",
                  "Weigh some of the rocks and minerals samples.",
                  "Apply grams and kilograms as standard unit of measure for transactions."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A scale or balance,",
                  "Tins of milk and tomatoes puree,",
                  "Block of stones,",
                  "Packets of sugar, large tin of bournvita",
                  "Samples of different rocks and minerals e.g. Marble Different types of stone"
                ],
                "EVALUATION GUIDE": [
                  "weigh selected objects and make a chart of their results;",
                  "give examples of objects in the class or at home whose weights could be expressed in grams ■ kilograms",
                  "determine the weight of given rocks and minerals samples and explain those that could be expressed in kilograms and in grams."
                ]
              },
              {
                "TOPIC NAME": "Capacity",
                "PERFORMANCE OBJECTIVES": [
                  "identify litre as a unit of measuring capacity;",
                  "measure liquid e.g. water using a graduated cylinder up to any stated number of litres;",
                  "identify the need for accuracy in measuring liquids e.g. kerosine, water petrol etc."
                ],
                "CONTENT": [
                  "Identifying litre as a unit of measuring capacity",
                  "Measuring liquid e.g. water with graduated cylinder up to any stated number of litres"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to learn the following: 10 millilitres (ml) = 1 centiliter (cl) 10 centiitres (cl) = 1 deciliter (dl) 10 decilitres (dl) = 1 litre (1) 1000 litres = 1 kilolitre (kl)",
                  "Leads pupils to identify the litre as a unit of measurement and used in daily life as a measure of capacity of containers such as the ones used in measuring liquids eg kerosene, petrol etc.",
                  "Guides pupils measure into the graduated cylinder and calculate the number of it that will fill a given container.",
                  "Guides pupils to identify the need for accuracy in measuring liquids e.g. kerosine, water, petrol etc."
                ],
                "PUPILS ACTIVITIES": [
                  "Study and copy the given information on units of litres.",
                  "Identify the litre as a measure of capacity of container such bottles, kerosine, petrol and water containers.",
                  "Measure into the graduated cylinder and calculate the number of it that will fill a given container.",
                  "Identify the need for accuracy in measuring liquids e.g. kerosine, water, petrol. etc."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Empty used Syringes, Bottles, Graduated cylinder, Empty containers, Water. etc."
                ],
                "EVALUATION GUIDE": [
                  "say how many milliliters and decilitre make 1 litre;",
                  "measure out four litres of water with a graduated cylinder."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "Shapes",
            "TOPICS": [
              {
                "TOPIC NAME": "Symmetry",
                "PERFORMANCE OBJECTIVES": [
                  "identify shapes with line(s) of symmetry;",
                  "identify lines of symmetry in everyday life;",
                  "state properties of squares, rectangles and triangles;",
                  "identify that some shapes in everyday life are square, rectangular, triangular and circular and therefore see mathematics in everyday life;",
                  "distinguish between curves and straight lines;",
                  "identify the presence of straight lines and curves in real life situations;",
                  "draw squares, rectangles, triangles and circles."
                ],
                "CONTENT": [
                  "Line(s) of symmetry",
                  "Properties of: ■ squares ■ rectangles ■ triangles.",
                  "Curves and straight lines",
                  "Drawing of squares, rectangles, triangles and circles."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to identify lines of symmetry by folding given plane shapes.",
                  "Leads pupils to identify lines of symmetry in everyday life.",
                  "Guides pupils to identify the properties of squares, rectangles and triangles: number of sides, corners, lines of symmetry, equal line, \"square corners\", etc.",
                  "Guides pupils to record properties of each plane shape.",
                  "Leads pupils to identify various shapes in everyday life.",
                  "Guides pupils to draw straight lines and curves.",
                  "Leads pupils to explain the differences between a curve and a straight line.",
                  "Leads pupils to identify straight line and curves in real life situations.",
                  "Guides pupils to draw squares, rectangles, triangles and circles using rulers, square cornered shapes, circular tins, and coins.",
                  "Emphasizes on different types of triangles."
                ],
                "PUPILS ACTIVITIES": [
                  "Identify lines of symmetry by folding given plane shapes.",
                  "Identify lines of symmetry in everyday life.",
                  "Identify the properties of squares, rectangles and triangles",
                  "Identify various shapes in our environment",
                  "Draw straight lines and curves.",
                  "Mention the differences between a curve and a straight line.",
                  "Mention the presence of straight lines and curves in everyday life.",
                  "Draw squares, rectangles, triangles and circles using rulers, square cornered shapes, circular tins, and coins.",
                  "Mention the different types of triangles."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Plane shapes, Leaves, Pictures, Squares, Rectangles, Triangles, Cut out of: Squares Rectangles Triangles, Ruler, Pencil, Broomsticks, Straight edges, Square cornered shapes, Circular tins, Coins etc."
                ],
                "EVALUATION GUIDE": [
                  "verify whether or not given plane shapes have lines of symmetry;",
                  "find the number of lines of symmetry in each given plane shape;",
                  "identify line(s) symmetry in everyday life;",
                  "state the relationship between sides and angles of a square, a rectangle and a triangle;",
                  "state important properties of squares, rectangles and triangles;",
                  "explain the difference between a straight line and a curve;",
                  "identify everyday examples of straight lines and curves e.g. rainbow, line between the wall and the floor of a house, a tight rope pulling a cow, etc.",
                  "draw and label a square, a rectangle, a triangle, and a circle;",
                  "explain the differences between equilateral, isosceles and right-angled triangles."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "EVERY DAY STATISTICS",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Data Collection and Presentation",
            "TOPICS": [
              {
                "TOPIC NAME": "Pictograms",
                "PERFORMANCE OBJECTIVES": [
                  "read and represent information in pictograms using vertical and horizontal arrangements;",
                  "represent information on a pictogram;",
                  "identify the most common features of pictogram (the mode);",
                  "mention the usefulness of pictogram (the mode)."
                ],
                "CONTENT": [
                  "Pictograms",
                  "Pictogram mode"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to represent information in a pictogram.",
                  "Guide pupils to represent information involving everyday life in a pictogram",
                  "Guides pupils find the mode in a pictogram.",
                  "Leads pupils to mention the usefulness and applications of mode in real life."
                ],
                "PUPILS ACTIVITIES": [
                  "Represent information in a pictogram.",
                  "Represent information involving everyday life in a pictogram.",
                  "Find the mode in a pictogram.",
                  "Mention the usefulness and applications of mode in real life."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Cardboard of pictograms arranged vertically and horizontally.",
                  "Cut outs of pictures for pictograms.",
                  "Pictograms with one mode for each pictogram.",
                  "Mathematical activity or game.",
                  "Data from emerging issues such as environmental degradation , etc."
                ],
                "EVALUATION GUIDE": [
                  "represent given information on a pictogram;",
                  "give three examples of life situation where pictograms can be applied;",
                  "find the mode on a given pictogram;",
                  "state the mode of an information or an event within environment."
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}