{
  "JSS ONE": {
    "THEMES": [
      {
        "THEME NAME": "GOD AND HIS CREATION",
        "SUB THEMES": [
          {
            "SUB THEME NAME": null,
            "TOPICS": [
              {
                "TOPIC NAME": "Who is God",
                "PERFORMANCE OBJECTIVES": [
                  "explain who God is;",
                  "list some attributes of God;",
                  "give the names of God in different Nigerian languages."
                ],
                "CONTENT": [
                  "Who is God? (Supreme being, the Creator of the universe, etc.) Gen. 1:1; Jer. 10:12",
                  "Attributes of God (Sovereign creator, omnipresence, invisible, only wise God, Spirit), etc.",
                  "Names of God in different Nigerian languages e.g. Ubangiji (Hausa), Olorun (Yoruba), Chineke (Igbo), Abasi (Efik), Tamara (Ijaw), Shekwo (Gbagyi), Soko (Nupe) etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides the students to discuss who God is.",
                  "Guides students to list and discuss the attributes of God.",
                  "Asks the students to mention the names of God in their own language."
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate in the discussion on who God is.",
                  "List and discuss the attributes of God.",
                  "Give names of God in their different languages.",
                  "Copy points into their note books.",
                  "Ask and answer questions."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible",
                  "Word cards of names of God in Different Nigerian languages."
                ],
                "EVALUATION GUIDE": [
                  "state who God is;",
                  "list five attributes of God;",
                  "write the names of God in five Nigerian languages."
                ]
              },
              {
                "TOPIC NAME": "God’s Creation",
                "PERFORMANCE OBJECTIVES": [
                  "give sequential account of the Biblical narration on the creation of the world;",
                  "state the purpose of the creation of human beings;",
                  "narrate the account of the first set of human beings created by God."
                ],
                "CONTENT": [
                  "Biblical account of the creation. Gen. 1 & 2.",
                  "Why God created human beings: (know, worship, serve him), etc.",
                  "Songs about creation in English and different Nigerian languages (e.g. all things bright and beautiful, the Lord God made them all)."
                ],
                "TEACHER ACTIVITIES": [
                  "Tell the story of creation.",
                  "Leads students to read the story.",
                  "Explains and discusses reason why God made man and woman.",
                  "Guides students to differentiate between living beings and non-living things."
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate in the discussion on God’s creation.",
                  "Read and search Bible passages on creation.",
                  "Tell stories about creation.",
                  "Copy points into notes",
                  "Sing songs",
                  "Draw things created by God."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible",
                  "Biography showing sequence of creation",
                  "Students as human resources.",
                  "Natural school environment showing trees, birds, soil, rocks, stones etc."
                ],
                "EVALUATION GUIDE": [
                  "give an orderly Biblical account of the creation from day one to day six;",
                  "narrate the story of the creation of man and woman;",
                  "state at least two reasons why God made human beings."
                ]
              },
              {
                "TOPIC NAME": "Human Beings Share in God’s Creative Activities",
                "PERFORMANCE OBJECTIVES": [
                  "explain the meaning of the term “marriage”;",
                  "mention the purpose of marriage;",
                  "explain that, despite the problems of homo-sexuality, God made marriage to be between man and woman;",
                  "list things made by man."
                ],
                "CONTENT": [
                  "Sharing in God’s creative activities through Marriage; Jn.2:1 - The meaning of marriage – Gen. 2:22 – 25. Eph. 5: 21 – 31.",
                  "Purposes of marriage companionship, procreation, Gen.1:28 responsibility, preventing immorality, STDs, HIV Virus/AIDS, etc.",
                  "Things invented by man e.g. cars, chairs, aeroplanes, buildings, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to read relevant Bible passages.",
                  "Guides students in discussing ways marriages prevent immorality and the spread of STDs, HIV/AIDS Virus, etc.",
                  "Guides game on identification of things made by man.",
                  "Takes students on field trips to churches, maternity homes, hills and teach them birth and wedding songs."
                ],
                "STUDENTS ACTIVITIES": [
                  "Watch and appreciate wedding pictures.",
                  "Participates in class discussion",
                  "Sing and dance to marriage and birth songs;",
                  "Read Bible passages;",
                  "Copy chalk board summaries into their notes and role play wedding ceremonies;",
                  "Go on field trips and discuss observations during field trips."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible",
                  "Bible Pictures.",
                  "Word and sentence card",
                  "Wedding discussion.",
                  "Costumes",
                  "Learners’ environment",
                  "Artificial flowers, bird, dolls, etc.",
                  "Invitation cards to weddings.",
                  "Audio visual materials of wedding songs and music."
                ],
                "EVALUATION GUIDE": [
                  "give the meaning of marriage;",
                  "state two functions of marriage;",
                  "give two reasons why man should not marry his fellow man and vice versa;",
                  "list three things made by man."
                ]
              },
              {
                "TOPIC NAME": "Disobedience",
                "PERFORMANCE OBJECTIVES": [
                  "identify disobedience as sin;",
                  "give Biblical account of first human disobedience;",
                  "enumerate their own acts of disobedience and consequences;",
                  "identify consequences of disobedience against the national laws e.g. vandalization of public properties, disobeying traffic light, etc."
                ],
                "CONTENT": [
                  "Biblical account of first human disobedience. Gen 3: 1 – 19",
                  "Consequences of Adam and Eve’s disobedience. Gen 3: 14 -19",
                  "Acts of disobedience and its consequences"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains meaning of disobedience.",
                  "Leads students to recognize disobedience as sin.",
                  "Guides students to read Bible passages.",
                  "Guides students to respect and obey the laws of the nation using the national pledge."
                ],
                "STUDENTS ACTIVITIES": [
                  "Read individually the Bible passages.",
                  "Participate and copy down points in their notes.",
                  "Write apology letter to parents. Bring reports of parent’s feelings at receiving apology letters.",
                  "Recite national pledge."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Educational television.",
                  "Film strips",
                  "The Bible.",
                  "Projectors.",
                  "Students as learning resources.",
                  "Printed or written copy of the national pledge."
                ],
                "EVALUATION GUIDE": [
                  "explain the term disobedience;",
                  "give a Biblical account of the first human disobedience;",
                  "mention two consequence of Adam and Eve’s disobedience;",
                  "state three acts of disobedience common among Nigerian youths today."
                ]
              },
              {
                "TOPIC NAME": "Reconciliation",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of reconciliation and identify conditions necessary for reconciliations;",
                  "narrate the story of the prodigal son;",
                  "list and demonstrate ways of reconciliation;",
                  "recount the story of Jacobs’s reconciliation with Esau."
                ],
                "CONTENT": [
                  "Meaning of reconciliation.",
                  "Conditions necessary for reconciliation e.g. Father of the prodigal son reconciles with his son Lk. 15:11-32.",
                  "Ways of reconciling with offenders (Shake hands, hug, say I am sorry, give gifts, forgive etc) eg Esau reconciles with Jacob Gen. 33 1-11."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains reconciliation.",
                  "Guides students to identify conditions necessary for reconciliation.",
                  "Vividly narrates the story of the prodigal son.",
                  "Reads and guides students to read relevant Bible passages.",
                  "Plays recorded songs depicting conditions of the prodigal son. “comeback home to the waiting arms of the Father”"
                ],
                "STUDENTS ACTIVITIES": [
                  "Listen and write down definition.",
                  "Participate in reading the Bible.",
                  "Listen, sing, dance, role-play etc."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pictures of quarreling friends reconciling.",
                  "Records of songs e.g. when the going is good and fair, etc. Come back home to the waiting arms of the father",
                  "Illustrations showing land marks in prodigal son’s lives.",
                  "Costume.",
                  "The Holy Bible"
                ],
                "EVALUATION GUIDE": [
                  "define reconciliation;",
                  "give three reasons for reconciliation;",
                  "narrate the story of the prodigal son;",
                  "state two ways we can reconcile with our offenders."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "RELATIONSHIP WITH GOD AND MAN",
        "SUB THEMES": [
          {
            "SUB THEME NAME": null,
            "TOPICS": [
              {
                "TOPIC NAME": "Relationship in the Family",
                "PERFORMANCE OBJECTIVES": [
                  "mention the different types of families;",
                  "mention names of their family members and draw the family tree;",
                  "Identify roles of members of the family;",
                  "State the attributes of a good family name."
                ],
                "CONTENT": [
                  "Meaning and types of family",
                  "Recognition of family members.",
                  "Different roles of members of the family. Eph. 6: 1-9, Eph. 5: 21 – 33; Col. 3: 18-21; I Pet. 3:1– 7.",
                  "Concept of good family name. Prov. 22: 1; Ecc. 17: 1"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to draw the family tree.",
                  "Explains different roles of family members.",
                  "Explains the attributes of a good family using some known families in the community as examples."
                ],
                "STUDENTS ACTIVITIES": [
                  "Participates in class discussions.",
                  "Draw their own family trees.",
                  "Listen and read in turns the Bible passage.",
                  "Mention some families in the community with good name."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pictures of family members.",
                  "Flash cards bearing names of persons.",
                  "Drawing showing family tree of Jesus.",
                  "Students as learning resources.",
                  "The Holy Bible."
                ],
                "EVALUATION GUIDE": [
                  "write names of three members of their family;",
                  "identify different types of family;",
                  "mention three roles of members of the family;",
                  "mention two things that help to maintain a good family name/reputation."
                ]
              },
              {
                "TOPIC NAME": "Relationship in School",
                "PERFORMANCE OBJECTIVES": [
                  "write the name of their principals, form master/mistress, subject teachers, etc;",
                  "identify the factors that aid them in choosing friends;",
                  "explain why they should choose and maintain good friends;",
                  "identify the evils of bad friendship."
                ],
                "CONTENT": [
                  "Names of members of the school, (School Principals, subject teachers, prefects, Friends, etc).",
                  "Choosing friends at school (factors: common interest, age, religion, etc.). As example of good friends.",
                  "As examples of good friends; Friendship between David and Jonathan. I Sam. 18: 1 – 5.",
                  "Bad friendship leads to cultism, stealing, drug addictions, examination malpractice, prostitution, lesbianism, homosexuality, smoking, drinking, laziness, truancy, etc. Prov. 1: 10; 2Thes. 3: 6 -13."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to list names of principal, teachers etc.",
                  "Guides students on how to identify genuine friends.",
                  "Leads students to read relevant Bible passages.",
                  "Guides students to role-play or (and) mime the story of the friend at midnight.",
                  "Leads the students to identify evils of bad friendship."
                ],
                "STUDENTS ACTIVITIES": [
                  "Write down names of teachers and their subject areas.",
                  "Mention factors that aid them in choosing friends.",
                  "Mention qualities of good friendship.",
                  "Mention social evils among youths.",
                  "Role-play the friend at midnight."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Students and school environment as learning resources.",
                  "Wall chart showing qualities of genuine friendship.",
                  "Loaves of bread.",
                  "Mats.",
                  "Classroom chair and space.",
                  "The Holy Bible"
                ],
                "EVALUATION GUIDE": [
                  "make a list of their school teachers;",
                  "mention two factors to consider when choosing friends;",
                  "give four reasons why they must choose good friends;",
                  "list five consequences of choosing bad friends."
                ]
              },
              {
                "TOPIC NAME": "Relationship in Community and Church",
                "PERFORMANCE OBJECTIVES": [
                  "identify names of members and leaders in their communities;",
                  "state ways we maintain relationships in the community;",
                  "Mention ways to maintain relationship in the church;",
                  "Write and discuss their observations at field trips."
                ],
                "CONTENT": [
                  "Identification of the names of community leaders.",
                  "Ways of sustaining relationships in the community: - respect for elders and leaders, - obeying the laws of the land, - participating in community development programmes, - caring for the needy and religious tolerance. Gal.6:2",
                  "Relationship in church. - Love your Christian brother and sister etc. Rom. 12:9-21 - Maintaining relationship in church. Heb.10:25, 1Pt. 3: 8-13; Rom. 13:1-7"
                ],
                "TEACHER ACTIVITIES": [
                  "Leads students to identify names of some community members.",
                  "Guides Bible reading of the relevant passages.",
                  "Takes students on field trips around the community."
                ],
                "STUDENTS ACTIVITIES": [
                  "Search for information about founders of their community and churches.",
                  "Read relevant Bible passages.",
                  "Go on field trips.",
                  "Discuss observations at field trips."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Posters of needy members of the communities",
                  "Cartoons and clippings of men giving or denying alms to beggars and destitute.",
                  "Pictures of rulers, priests, bishops, worshippers, etc.",
                  "The Holy Bible"
                ],
                "EVALUATION GUIDE": [
                  "write names of three community members and rulers;",
                  "state three ways we can maintain relationship in community;",
                  "identify four ways we maintain relationship in the church.",
                  "discuss observations at field trips."
                ]
              },
              {
                "TOPIC NAME": "Relationship with God",
                "PERFORMANCE OBJECTIVES": [
                  "explain what “prayer” is;",
                  "recite the Lords’ prayer and apostle’s creed;",
                  "mention ways we maintain relationship with God;",
                  "mention ways God talks to us."
                ],
                "CONTENT": [
                  "Relating with God through prayer, reading the Bible worshiping God, praising God, etc. Acts.16:25",
                  "Ways God talks to us: - our parents - the Bible (His Word) - teachers - priests/preachers",
                  "Ways of maintaining good relationship with God: - loving God - loving one another - daily prayer - living holy life - worshiping and doing good - reading the Bible - forgiving one another etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads students to identify books of the Bible.",
                  "Guides students in meaningfully saying of the Lord’s Prayer and the apostle’s creed.",
                  "Through questioning leads students in discussing ways of maintaining relationship with God."
                ],
                "STUDENTS ACTIVITIES": [
                  "Copy out books of the Bible sequentially into their notes.",
                  "Participate in class discussion.",
                  "Learn and sing songs; such as read your Bible pray every day if you want to grow."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Wall charts showing names of God and books of the Bible.",
                  "Resource persons e.g. priest/preachers from the local church.",
                  "The Holy Bible"
                ],
                "EVALUATION GUIDE": [
                  "define prayer;",
                  "recite the Lord’s prayer;",
                  "write at least three ways we can maintain relationship with God;",
                  "mention two ways through which God talks to us."
                ]
              }
            ]
          }
        ]
      }
    ]
  },

  "JSS TWO": {
    "THEMES": [
      {
        "THEME NAME": "THE MINISTRY OF JESUS CHRIST",
        "SUB THEMES": [
          {
            "SUB THEME NAME": null,
            "TOPICS": [
              {
                "TOPIC NAME": "The Baptism of Jesus Christ",
                "PERFORMANCE OBJECTIVES": [
                  "narrate the story of Jesus Baptism;",
                  "state the significance of the Baptism of Jesus;",
                  "list the importance of Baptism to Christians."
                ],
                "CONTENT": [
                  "The Baptism of Jesus. Matt.3:3-17; Matt.1:9-11, Lk.3:21-22.",
                  "The significance of the Baptism of Jesus",
                  "The importance of Baptism in the life of Christians."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class discussion on: - the Baptism of Jesus. - the significance of Baptism. - Importance of Baptism in the life of Christians."
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate in class discussions.",
                  "Ask and answer questions.",
                  "Read the Bible passages."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible.",
                  "Bible Pictures",
                  "Charts",
                  "Posters and films."
                ],
                "EVALUATION GUIDE": [
                  "narrate what happened during the Baptism of Jesus;",
                  "give two significance of the Baptism of Jesus;",
                  "list three importance of Baptism in the life of a Christian."
                ]
              },
              {
                "TOPIC NAME": "The Temptation of Jesus",
                "PERFORMANCE OBJECTIVES": [
                  "narrate the story of the temptation of Jesus;",
                  "state the significance of the temptation of Jesus;",
                  "list some temptation in the life of a Christian;",
                  "mention ways of overcoming temptation"
                ],
                "CONTENT": [
                  "The temptation of Jesus Matt 4:1-11, Mk 1:12-13; Lk 4:1-13",
                  "The significance of the temptation of Jesus.",
                  "Temptations in the life of a Christian.",
                  "Ways of overcoming temptation: - Prayer - Be strong in your faith."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class discussion on: - the temptation of Jesus; - the significance of the temptation of Jesus; - temptation in the life of a Christian; - ways of overcoming temptation."
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate in class discussion.",
                  "Ask and answer teacher’s questions.",
                  "Brainstorm on ways of overcoming temptations."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible.",
                  "Bible pictures.",
                  "Charts.",
                  "Posters and films."
                ],
                "EVALUATION GUIDE": [
                  "narrate the three temptation of Jesus and His response to each;",
                  "give two significance of temptation of Jesus;",
                  "explain two ways a Christian can be tempted;",
                  "list four ways a Christian can overcome temptation."
                ]
              },
              {
                "TOPIC NAME": "Call of the Disciples",
                "PERFORMANCE OBJECTIVES": [
                  "name the first four Disciples of Jesus;",
                  "give account of how they were called;",
                  "name the twelve Disciples;",
                  "state what it takes to be a disciple of Jesus."
                ],
                "CONTENT": [
                  "Jesus calls His first four disciples. Matt.4:18-22; Mk.1:14-20; Lk.5:1-11.",
                  "Jesus calls the twelve Disciples/Apostles Mk.3:13-19",
                  "What it takes to be a disciple of Jesus Christ Matt.8:18-27; Lk.9:57-63; Lk.14:25-33."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class discussions on the call of the disciples and the gains of answering the call.",
                  "Leads class to dramatize the call of the four disciples.",
                  "Explains to students the different ways people are called to serve God today."
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate in class discussions.",
                  "Participate in dramatizing the call of the four disciples.",
                  "Mention people they know that answered the call of God."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible.",
                  "Bible Pictures",
                  "Posters",
                  "Charts",
                  "Films showing how Jesus called the first four disciples and others."
                ],
                "EVALUATION GUIDE": [
                  "give two reasons why Jesus called His disciples;",
                  "name the first four disciples of Jesus;",
                  "list the twelve disciples of Jesus;",
                  "List three demands of discipleship;",
                  "State what it takes to be a disciple of Jesus."
                ]
              },
              {
                "TOPIC NAME": "Mission of the Disciples",
                "PERFORMANCE OBJECTIVES": [
                  "state why Jesus called the disciples;",
                  "state the mission of the twelve disciples and the seventy disciples;",
                  "mention the outcome of the mission of the disciples;",
                  "describe the effect of the disciples’ activities on Nigerian Christians today."
                ],
                "CONTENT": [
                  "Fishers of men. Matt.4:18-22, Lk.5:1-11",
                  "The preaching of Gospel and healing of the sick. Matt.10:1-15",
                  "The mission of the twelve apostle and the seventy disciples. Matt.10:1-15; Mk.6:7-13; Lk.9:1-16; Lk.10:1-24.",
                  "The outcome of the mission of the twelve and seventy disciples. Mk. 12; Lk.10:17-20."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class discussions on mission of Jesus’ disciples and the apostles.",
                  "Guides class to identify the effects of the mission of the disciples in Nigeria.",
                  "Leads class discussion on the problems to be faced when embarking on Christ’s mission.",
                  "Explain the difference between the apostle and disciples"
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate in class discussions.",
                  "Ask and answer teacher’s questions.",
                  "Students are to dramatize the duties of missionaries."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible.",
                  "Posters",
                  "Bible pictures of the apostles",
                  "Charts"
                ],
                "EVALUATION GUIDE": [
                  "give three reasons why Jesus called his disciples;",
                  "state three missions of the seventy disciples;",
                  "list five positive outcomes of the disciples work."
                ]
              },
              {
                "TOPIC NAME": "Sermon on the Mount or the Beatitudes",
                "PERFORMANCE OBJECTIVES": [
                  "recite the beatitudes;",
                  "explain the Sermon on the Mount;",
                  "discuss Jesus teaching on forgiveness and revenge;",
                  "discuss Jesus’ teaching on: - prayer, - fasting, - anxiety - love of money."
                ],
                "CONTENT": [
                  "The beatitudes. Matt.5:1-12",
                  "The Sermon on the Mount Matt. 5:13-16 - Forgiveness. Matt. 6:14-15. - Revenge. Matt. 5:38-42. - Fasting and Prayer. Matt. 6:5-13. - Love of money. Matt. 6:19-34 - Worrying Matt. 6:25-34."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class discussion on the teaching of Jesus on the Beatitudes.",
                  "Leads class discussion on Jesus teaching on Sermon on the Mount."
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate in class discussions.",
                  "Study and memorize the beatitudes.",
                  "Read relevant Bible passages"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible.",
                  "Bible Pictures",
                  "Posters, charts and films"
                ],
                "EVALUATION GUIDE": [
                  "recite meaningfully the beatitudes;",
                  "list two teachings of Jesus on Sermon on the Mount;",
                  "state why it is necessary to forgive your enemies;",
                  "explain the importance of prayer and fasting in a Christian’s life."
                ]
              },
              {
                "TOPIC NAME": "Jesus’ Teaching in Parables",
                "PERFORMANCE OBJECTIVES": [
                  "explain the meaning of Parables.",
                  "give reasons why Jesus taught in Parables;",
                  "narrate the categories of Jesus Parable with examples and its interpretations"
                ],
                "CONTENT": [
                  "Meaning of parable. - Why Jesus taught in parables Matt. 13:34-35",
                  "Parables about the Kingdom: - The sower. Matt. 13:1-9, 18-23. - The wheat and Tares, Matt.13.24-30, 36-43,",
                  "Parable illustrating God’s love: - The prodigal son, Lk.15:11-32. - Lost sheep Lk. 15:3-7 - Lost coin. Lk. 15:8-10."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads discussion on: - meaning of parables, - reasons for use of parables by Jesus, - various parables of Jesus.",
                  "Discusses the use of proverbs among Nigerians."
                ],
                "STUDENTS ACTIVITIES": [
                  "Read relevant Bible passages.",
                  "Participate in class discussions.",
                  "Ask and answer teacher’s questions."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible.",
                  "Posters",
                  "Bible pictures",
                  "Charts",
                  "Films"
                ],
                "EVALUATION GUIDE": [
                  "give the meaning of parable;",
                  "list three reasons why Jesus taught in parables;",
                  "mention two parables each that teach: - God’s love for sinners, - about the Kingdom, - the right attitude to earthly possessions, maturity and responsibility.",
                  "Narrate one parable of Jesus."
                ]
              }
            ]
          }
        ]
      }
    ]
  },

  "JSS THREE": {
    "THEMES": [
      {
        "THEME NAME": "THE LIFE AND TEACHINGS OF PAUL",
        "SUB THEMES": [
          {
            "SUB THEME NAME": null,
            "TOPICS": [
              {
                "TOPIC NAME": "Some Teachings of St. Paul",
                "PERFORMANCE OBJECTIVES": [
                  "mention some of the teachings of St. Paul;",
                  "state the meaning of dignity of labour;",
                  "identify various types of work people do;",
                  "state why they should do their work with honour;",
                  "state why it is necessary to obey constituted authority;",
                  "state why they should show love to one another."
                ],
                "CONTENT": [
                  "Paul’s teachings on: - Dignity of Labour. 2Thess. 3:6-15, Col.3:23 - Obedience to constituted authority. Rom. 13:1-7, Eph. 6:5-8 - Love. 1Cor.13, Rom.13:18-10",
                  "Types of work people do.",
                  "Why people should do their work with honour.",
                  "Need to obey constituted authority."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class debate on 'No Job is more important than the other'.",
                  "Encourages students to demonstrate how to show love to their neighbours.",
                  "Shows picture of people of different professions.",
                  "Leads class discussions on student’s ambition in life."
                ],
                "STUDENTS ACTIVITIES": [
                  "Read relevant Bible passages.",
                  "Listen and participate in the discussion.",
                  "Class debates on importance of one job to the other.",
                  "Bring gifts to share with their class mate as evidence of practical love."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible.",
                  "Pictures of people of different profession."
                ],
                "EVALUATION GUIDE": [
                  "mention two different types of work;",
                  "enumerate three ways of showing respect to constituted authority;",
                  "give four reasons why we must love our neighbours;",
                  "list six characteristic of dignity of labour: - punctuality - honesty - commitment - hard work - cooperation."
                ]
              },
              {
                "TOPIC NAME": "Paul’s Trials",
                "PERFORMANCE OBJECTIVES": [
                  "state the accusations that led to Paul’s arrest;",
                  "state the cause of the division among the members of the Council;",
                  "give the reason for Paul’s appeal to Caesar;",
                  "state how Paul’s case revealed the weaknesses of those in authority."
                ],
                "CONTENT": [
                  "Paul’s arrival at Jerusalem and arrest. Acts 21:17-40",
                  "Paul before the Jewish Council (Sanhedrin) and the plot to kill him. Acts 22:30-33; 35",
                  "Paul before Roman Governors (Felix, Festus and Agrippa) and his appeal to Rome. Acts 25:1-21; Felix; Acts 24:1-27; Felix Acts 25:22; Agrippa Festus; Acts:25:13-14."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class discussion on the passage read.",
                  "Leads students to discuss the accusation leveled against Paul,",
                  "Discuss Paul’s defence before Roman Governors."
                ],
                "STUDENTS ACTIVITIES": [
                  "Read relevant Bible passages.",
                  "Participate in class discussion.",
                  "Ask and answer teacher’s questions.",
                  "Copy the chalkboard summary."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible.",
                  "Bible pictures",
                  "Posters",
                  "Charts"
                ],
                "EVALUATION GUIDE": [
                  "list the accusation leveled against Paul;",
                  "list the two major parties of the Sanhedrin;",
                  "state why there was division among the members of the Sanhedrin;",
                  "State why Paul appealed to Caesar in Rome."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "THE CHRISTIAN CHURCH TODAY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": null,
            "TOPICS": [
              {
                "TOPIC NAME": "The Growth of the Church",
                "PERFORMANCE OBJECTIVES": [
                  "relate the evangelisation efforts of the church."
                ],
                "CONTENT": [
                  "The Great Commission. Matt.28:19-20, Mk.16:15-16.",
                  "Marks of growth in the church e.g. organizing crusades, revivals, vigils, prayer meetings, miracles, etc. Acts 2:1-47"
                ],
                "TEACHER ACTIVITIES": [
                  "Leads students to discuss the evangelisation efforts of the church.",
                  "Guides students to list evidence of church growth."
                ],
                "STUDENTS ACTIVITIES": [
                  "List some of the religious activities they had attended.",
                  "Memorize the Great Commission in Mathew 28:18-20."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Films on revivals, crusades, prayer meetings and worship.",
                  "The Holy Bible",
                  "Recorded audio tapes on sermons.",
                  "Paper cutting on religious gatherings.",
                  "Pictures of people, cathedrals, big churches and small churches.",
                  "Drama Costumes."
                ],
                "EVALUATION GUIDE": [
                  "state three activities carried out during evangelism;",
                  "list three factors responsible for the growth of churches respectively;",
                  "list three prominent church leaders in Nigeria today."
                ]
              },
              {
                "TOPIC NAME": "Unity Among Christians",
                "PERFORMANCE OBJECTIVES": [
                  "list some Christian organizations in Nigeria.",
                  "discuss inter-denominational activities in our churches today.",
                  "identify Biblical teachings towards unity of purpose.",
                  "practice Christian assistance to one another in times of need."
                ],
                "CONTENT": [
                  "Christian organizations in Nigeria e.g. Christian Association of Nigeria (CAN), etc.",
                  "Definition of inter-denominational and their activities.",
                  "Christian giving. Phil.4:14-20; 2Cor.8:3-5; 2Cor.9:6-15;",
                  "Teachings that will foster unity. Jn. 17:15, 21. - Faith/Works. Jam. 2:14-18. - Humility. Phil. 2:3-11, 1Pet.5:5-11; - Impartiality. Jam. 2:1-13; - Forgiveness Gal.6:1-2, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides class to read relevant passages.",
                  "Leads class to demonstrate how to love one another.",
                  "Asks and answers questions on Christian giving."
                ],
                "STUDENTS ACTIVITIES": [
                  "Read relevant passages.",
                  "Give gifts to their friends.",
                  "Bring Costumes from their houses."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Drama costumes.",
                  "Pictures of people working and worshiping together.",
                  "Pictures of Christians holding meeting.",
                  "Films of joint programmes.",
                  "The Holy Bible"
                ],
                "EVALUATION GUIDE": [
                  "list any two Christian Organizations in Nigeria.",
                  "mention two inter-denominational activities in our churches today.",
                  "state three attitudes among Christians that will foster unity.",
                  "state why a Christian should render assistance to another Christian in need."
                ]
              },
              {
                "TOPIC NAME": "Christians Living among Non-Christians",
                "PERFORMANCE OBJECTIVES": [
                  "explain the expected attitudes of Christians to non-Christians in society;",
                  "Christian attitude to constituted non-Christian authorities;",
                  "describe Christian attitudes to persecution."
                ],
                "CONTENT": [
                  "Christian living in the community. 1Pet.1:3-17, 2, Matt.5:13-16.",
                  "Christian attitude to persecution. 1Pet.3:13-17, James 1:12-15, 1Pet. 1:6-9; 9 and 10.",
                  "Discussion on Christian’s attitude to non-believing authorities."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to read the passages.",
                  "Directs a play on Christian living among non-Christians.",
                  "Asks questions on persecution of Christians.",
                  "Leads discussion on Christian’s attitude to unbelieving leaders."
                ],
                "STUDENTS ACTIVITIES": [
                  "Read Bible passages.",
                  "Dramatize a play on Christian living among non-Christians.",
                  "Assess the negative effect of persecution on believers.",
                  "Write a letter to a Christian friend in Nigeria where Christians are constantly persecuted."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "The Holy Bible",
                  "Pictures of churches burnt or vandalized during religious crises.",
                  "Christian magazines showing the persecution of Christians in some parts of the world.",
                  "Drama materials."
                ],
                "EVALUATION GUIDE": [
                  "explain how to encourage Christians to remain faithful when tribulations come their way;",
                  "list two nature of persecution meted out to Christians in your area;",
                  "mention five points of advice from the passages on how Christians should live in the community;",
                  "list Christian attitudes to unbelieving leaders."
                ]
              },
              {
                "TOPIC NAME": "Peaceful Co-existence",
                "PERFORMANCE OBJECTIVES": [
                  "explain the term peaceful co-existence;",
                  "list/enumerate instance of people desiring peaceful co-existence in the Bible;",
                  "identify reasons for wanting peaceful coexistence;",
                  "explain the origin of Christianity and Islam as being of one father (Abraham)."
                ],
                "CONTENT": [
                  "Explanation of peaceful coexistence i.e. living in peace with others. Matt.5:21-25. - Instances in the Bible of people desiring peaceful coexistence e.g. Esau and Jacob. Gen. 31:1-11; Gen. 13:1-8, 26:26-29; - Philemon and Onesimus, Phil. 1:1-30 - Isaac and Abimelech. (Gen.26:2-29)",
                  "Demonstration of how people can show desire for peaceful co-existence, e.g. call for dialogue, tolerance, forgiveness, call for reconciliation or settlement of disputes.",
                  "Origin of Christianity and Islam from Abraham as one father. Gen.16:15-16; Gen.21:1-3."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of peaceful coexistence.",
                  "Explains the reasons for peaceful coexistence.",
                  "Enumerates the ways of creating peaceful coexistence",
                  "Explains the problems arising from lack of peaceful coexistence (violence, war)."
                ],
                "STUDENTS ACTIVITIES": [
                  "Ask questions.",
                  "Demonstration of peaceful coexistence by sharing and working together in the classroom."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Picture showing people settling land, religious and community disputes.",
                  "The Holy Bible"
                ],
                "EVALUATION GUIDE": [
                  "explain peaceful coexistence;",
                  "give two examples of those who quarreled but later lived peacefully;",
                  "list two reasons why people should have desire for peaceful coexistence;",
                  "mention two ways to create peaceful coexistence."
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}

