{
  "JSS 1": {
    "THEMES": [
      {
        "THEME NAME": "Concept of History",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Concept of History",
            "TOPICS": [
              {
                "TOPIC NAME": "Meaning of History",
                "PERFORMANCE OBJECTIVES": [
                  "Explain the meaning of History",
                  "Differentiate between History and story telling"
                ],
                "CONTENT": [
                  "Meaning of History",
                  "Differences between History and story telling e.g. History is time-based and factual"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of History to students",
                  "Asks students to read selected texts about the meaning of History",
                  "Guides students to explain History in their own words",
                  "Guides students to discuss the differences between History and storytelling",
                  "Asks students to write the differences between History and story telling, flash cards/note books"
                ],
                "STUDENTS ACTIVITIES": [
                  "Pay attention to teacher’s explanation of the meaning of History",
                  "Read the selected texts and make notes",
                  "Explain the meaning of History in their own words",
                  "Discuss in groups the differences between History and story telling",
                  "Write the differences between History and Story telling on flash cards/note books"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Video clips",
                  "Flashcards",
                  "Relevant pictures",
                  "Other relevant materials"
                ],
                "EVALUATION GUIDE": [
                  "Explain the meaning of History",
                  "State 2 differences between History and story telling"
                ]
              },
              {
                "TOPIC NAME": "Sources of History",
                "PERFORMANCE OBJECTIVES": [
                  "Explain the meaning of sources of History",
                  "Identify the sources of History",
                  "Explain how to access sources of History"
                ],
                "CONTENT": [
                  "Meaning of sources of History",
                  "Primary sources of History. e.g. Oral traditions, Artifacts, Legends, Folklores, Archival materials etc.",
                  "Secondary sources of History e.g. Text books, Journal articles and other articles, Government Publications, Biographies, Autobiographies, etc.",
                  "Tertiary sources of History e.g. Students project, Bulletins, Memos, etc.",
                  "How to access sources of History: Excursion to Historical sites, Exhibitions, Libraries, Cultural festivals, Museums etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of sources of History",
                  "Guides the students to identify primary, secondary and tertiary sources of History",
                  "Provides students with examples of primary, secondary and tertiary sources of History",
                  "Guides students to discuss the identified sources",
                  "Explains how these sources can be accessed"
                ],
                "STUDENTS ACTIVITIES": [
                  "Pay attention to teacher’s explanations",
                  "Identify primary, secondary and tertiary sources of History",
                  "Take notes as teacher provides examples of primary, secondary and tertiary sources of History",
                  "Discuss the identified sources of History",
                  "Explain how these sources can be accessed"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "News-papers",
                  "Archival materials",
                  "Websites",
                  "Audio Clips",
                  "Video Clips",
                  "Posters",
                  "Sample artifacts",
                  "Biographies",
                  "Costumes"
                ],
                "EVALUATION GUIDE": [
                  "Explain the meaning of sources of History",
                  "Identify 3 primary sources of History",
                  "Identify 3 secondary sources of History",
                  "State 4 measures of accessing sources of History"
                ]
              },
              {
                "TOPIC NAME": "Importance of History",
                "PERFORMANCE OBJECTIVES": [
                  "State the importance of History",
                  "Explain the importance of History to: Individuals, Society, Nation"
                ],
                "CONTENT": [
                  "Importance of History to the: a. Individuals Helps individuals to better understand themselves and their environment Serves as a reservoir of knowledge b. Society Helps to transmit culture and values. Aids intergroup relationships. c. Nation Promotes Nationalism and patriotism Helps in the understanding of past and present events and personalities. Guides future planning."
                ],
                "TEACHER ACTIVITIES": [
                  "Asks students to share their ideas on the importance of History",
                  "Explains the importance of History to: Individuals, Society, Nation",
                  "Writes a list of the importance of History on the board for students to copy"
                ],
                "STUDENTS ACTIVITIES": [
                  "Share their ideas on the importance of History with the class",
                  "Listen carefully to the teacher’s explanations",
                  "Ask questions about the lesson",
                  "Copy the teacher’s list of the importance of History into their note books"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Video clips",
                  "Relevant materials",
                  "Historical artifacts",
                  "Maps",
                  "Pictures of Nationalists"
                ],
                "EVALUATION GUIDE": [
                  "State 2 each of the importance of History to the: a. Individuals b. Society c. Nation"
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "Geography and Environment",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Geography and Environment",
            "TOPICS": [
              {
                "TOPIC NAME": "Historical sites in Nigeria a. NOK",
                "PERFORMANCE OBJECTIVES": [
                  "Identify the location of NOK on the map of Nigeria",
                  "Explain the NOK Culture",
                  "State the significance of NOK culture"
                ],
                "CONTENT": [
                  "Location of NOK on the map of Nigeria",
                  "The NOK culture Meaning Artifacts People Occupational activities, etc.",
                  "Significance of NOK culture in the Nigerian History"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to identify the location of NOK on the map of Nigeria",
                  "Shows students a poster about the Terra-cotta heads and other artifacts in the NOK culture",
                  "Discusses the significance of the NOK culture with students",
                  "Gives notes about the NOK culture",
                  "Plans an excursion to NOK village in Kwoi, Kaduna State"
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate actively in locating NOK on the map of Nigeria",
                  "Take note of the various artifacts in the NOK culture",
                  "Contribute to class discussions about the significance of the NOK culture",
                  "Copy notes",
                  "Go on excursion to NOK village and write their reports"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Nigeria showing the NOK area",
                  "Posters",
                  "Video clips",
                  "Internet materials",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Identify the location of NOK on the map of Nigeria",
                  "Explain the NOK culture",
                  "State 2 significance of NOK culture in the Nigerian History"
                ]
              },
              {
                "TOPIC NAME": "Historical sites in Nigeria b. Ile Ife",
                "PERFORMANCE OBJECTIVES": [
                  "Identify the location of Ile Ife on the map of Nigeria",
                  "Explain the Ife culture",
                  "State the significance of Ife culture in Nigerian History"
                ],
                "CONTENT": [
                  "Location of Ile Ife on the map of Nigeria",
                  "The Ife culture and tradition: The place of Ife in Yoruba History Ife figures/artifacts. The people Occupational activities, etc.",
                  "Significance of Ile-Ife in Nigerian History"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to identify the location of Ile-Ife on the map of Nigeria",
                  "Shows students a poster about the different figurines/artifacts in the Ife History",
                  "Discusses the significance of Ife culture in Nigerian History",
                  "Gives students notes about Ile-Ife in the Nigerian History",
                  "Plans an excursion to Ile-Ife"
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate actively in locating Ile Ife on the map of Nigeria",
                  "Take note of the various figurines/artifacts in the Ife History",
                  "Contribute to class discussions about the significance of Ife culture in Nigerian History",
                  "Copy notes",
                  "Go on an excursion to Ife and write their reports"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Nigeria showing Ile Ife",
                  "Posters",
                  "Video clips",
                  "Internet materials",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Identify the location of Ile Ife on the map of Nigeria",
                  "Explain Ife culture",
                  "State 2 significance of Ife culture in Nigerian History"
                ]
              },
              {
                "TOPIC NAME": "Historical sites in Nigeria c. Benin",
                "PERFORMANCE OBJECTIVES": [
                  "Identify the location of Benin on the map of Nigeria",
                  "Explain the Edo (Benin) culture",
                  "State the significance of Edo (Benin) culture in Nigerian History"
                ],
                "CONTENT": [
                  "Location of Benin on the map of Nigeria",
                  "The Edo (Benin) culture and History: Artifacts The people Occupational activities etc.",
                  "Significance of Edo (Benin) in Nigerian History"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to identify the location of Benin on the map of Nigeria",
                  "Shows students a poster about the different artifacts found in the Edo (Benin) culture",
                  "Discusses the significance of Edo(Benin) Culture in Nigerian History",
                  "Gives notes about the Edo (Benin) culture in the Nigerian History",
                  "Arranges a field trip to various Historical sites in Benin"
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate actively in locating Benin on the map of Nigeria",
                  "Take note of the various artifacts found in Edo (Benin) culture",
                  "Contribute to class discussions about the significance of the Edo (Benin) culture in Nigerian History",
                  "Copy notes",
                  "Students go on field trip to various Historical sites in Benin"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Nigeria showing Benin",
                  "Posters",
                  "Video clips",
                  "Internet materials",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Identify the location of Benin on the map of Nigeria",
                  "Explain the Benin culture",
                  "State 2 significance of Benin in Nigerian History"
                ]
              },
              {
                "TOPIC NAME": "Historical sites in Nigeria d. Igbo-Ukwu",
                "PERFORMANCE OBJECTIVES": [
                  "Identify the location of Igbo-Ukwu on the map of Nigeria",
                  "Explain the Igbo-Ukwu culture",
                  "State the significance of Igbo-Ukwu culture"
                ],
                "CONTENT": [
                  "Location of Igbo-Ukwu on the map of Nigeria",
                  "The Igbo-Ukwu culture: Meaning Artifacts People Occupational activities, etc.",
                  "Significance of Igbo-Ukwu culture in the Nigerian History"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to locate Igbo-Ukwu on the map of Nigeria",
                  "Shows students a poster about the different figurines/artifacts in the Igbo-Ukwu culture",
                  "Discusses the significance of Igbo-Ukwu in Nigeria History",
                  "Gives notes about Igbo-Ukwu culture in the History of Nigeria",
                  "Arranges a field trip to Igbo-Ukwu"
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate actively in identifying the location of Igbo-Ukwu on the map of Nigeria",
                  "Take note of the various figurines/artifacts in Igbo-Ukwu culture",
                  "Contribute to class discussions about the significance of Igbo-Ukwu culture",
                  "Copy notes into their note books",
                  "Go on excursion to Igbo-Ukwu and write their reports"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Nigeria showing Igbo-Ukwu",
                  "Posters",
                  "Video clips",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Identify the location of Igbo-Ukwu on the map of Nigeria",
                  "Explain the Igbo-Ukwu culture",
                  "State 2 significance of Igbo-Ukwu in Nigerian History"
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "Political Developments in Nigeria",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Political Developments in Nigeria",
            "TOPICS": [
              {
                "TOPIC NAME": "Major Centralised States in Pre-colonial Nigeria",
                "PERFORMANCE OBJECTIVES": [
                  "Explain the meaning of centralised States",
                  "Identify the characteristics of centralized States",
                  "Give examples of centralised States in pre-colonial Nigeria"
                ],
                "CONTENT": [
                  "Meaning of centralized States",
                  "Characteristics of centralized States",
                  "Examples of centralized States in pre-colonial Nigeria: Hausa states Kanem Borno Nupe Kingdom Oyo Empire Igala Kingdom Benin Empire Niger Delta City States. Calabar"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of centralised States",
                  "Discusses the characteristics of a centralized State with students",
                  "Guides students to identify examples of the centralised States in pre-colonial Nigeria",
                  "Gives students a text to read about the centralised States in pre-colonial Nigeria",
                  "Gives notes about the topic to students"
                ],
                "STUDENTS ACTIVITIES": [
                  "Listen to the teacher’s explanations",
                  "Participate in class discussions about the characteristics of centralised States",
                  "Identify examples of centralized States in pre-colonial Nigeria",
                  "Read the assigned text and ask questions",
                  "Copy notes"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Nigeria",
                  "Video clips",
                  "Posters",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Explain the meaning of centralised States",
                  "Identify 2 characteristics of a centralised State",
                  "Mention 5 examples of centralised States in pre-colonial Nigeria"
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  "JSS 2": {
    "THEMES": [
      {
        "THEME NAME": "Political Developments in Nigeria",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Political Developments in Nigeria",
            "TOPICS": [
              {
                "TOPIC NAME": "Non-Centralised States in Pre-Colonial Nigeria",
                "PERFORMANCE OBJECTIVES": [
                  "Explain the meaning of non-centralised States",
                  "Identify characteristics of non-centralised States",
                  "Give examples of non-centralised States in pre-colonial Nigeria"
                ],
                "CONTENT": [
                  "Meaning of non-centralised States",
                  "Characteristics of non-centralised States",
                  "Examples of non-centralised States in pre-colonial Nigeria: Tiv Idoma Ebira Igbo Urhobo Ijo (Ijaw) Oro (Oron) Ibibio Anang"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of non-Centralised States",
                  "Discusses the characteristics 0f a non-centralised State with students",
                  "Guides students to identify examples of non-centralised States in pre-colonial Nigeria",
                  "Gives students a text to read about non-centralised States in pre-colonial Nigeria",
                  "Gives notes about the topic"
                ],
                "STUDENTS ACTIVITIES": [
                  "Listen to teacher’s explanations",
                  "Participate in class discussions about the characteristics of non-centralised States",
                  "Identify examples of non-centralised States in pre-colonial Nigeria",
                  "Read text assigned and make short notes",
                  "Copy notes into their note books"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Nigeria",
                  "Video clips",
                  "Posters",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Explain the meaning of non-centralised States",
                  "Identify 2 characteristics of non-centralised States",
                  "Mention 5 examples of non-centralised States in pre-colonial Nigeria"
                ]
              },
              {
                "TOPIC NAME": "Inter-relationships of some Centres of Civilisation in Pre-colonial Nigeria",
                "PERFORMANCE OBJECTIVES": [
                  "Explain the relationship between peoples from different centres of civilisation in pre-colonial Nigeria",
                  "State the similarities and differences that exist between different centres of civilisation",
                  "Identify areas of Interaction among peoples of different centres of civilisation in pre-colonial Nigeria"
                ],
                "CONTENT": [
                  "Relationships between peoples from different centres of civilisation in pre-colonial Nigeria: Ife/Benin Kanem Borno/Hausa States Igbo/Niger Delta City States etc.",
                  "Differences that existed between different Centres of civilization in pre-colonial Nigeria: Political structure Culture and customs Religious beliefs, etc.",
                  "Areas of Interaction among peoples of centres of civilization in pre-colonial Nigeria: Trade and commerce Marriage Festivals Wars, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Shows students posters of different Centres of civilization in pre-colonial Nigeria",
                  "Guides students to identify the relationships that existed between the peoples of different centres of civilisation",
                  "Explains the similarities and differences that existed between the different centres of civilisation in pre-colonial Nigeria",
                  "Guides the students to identify the various forms of interaction among peoples of different centres of civilisation in pre-colonial Nigeria",
                  "Asks and answers questions"
                ],
                "STUDENTS ACTIVITIES": [
                  "Observe posters and identify relationships that existed among the various centres of civilization in pre-colonial Nigeria",
                  "Pay attention to teacher’s explanations and write down notes",
                  "Explain the similarities and differences between the centres of civilization in pre-colonial Nigeria",
                  "Explain the various forms of interaction that existed among peoples of different centres of civilization in pre-colonial Nigeria",
                  "Ask and answer questions about the lesson"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Posters",
                  "Charts",
                  "Video Clips",
                  "Internet materials",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Explain the relationship among the peoples from different Centres of civilization in pre-colonial Nigeria",
                  "State 2 differences and 2 similarities among the different centres of civilization in pre-colonial Nigeria",
                  "Mention 3 areas of interaction among the peoples of the different centres of civilisation in pre-colonial Nigeria"
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "Geographical Environment",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Geographical Environment",
            "TOPICS": [
              {
                "TOPIC NAME": "Ghana Empire",
                "PERFORMANCE OBJECTIVES": [
                  "Identify the location of Ghana Empire on the map of Africa",
                  "Describe the socio-political structures of Ghana Empire",
                  "Explain the factors that led to the rise of the Ghana Empire",
                  "Explain the factors that led to the fall of Ghana Empire"
                ],
                "CONTENT": [
                  "Location of Ghana Empire on the map of Africa",
                  "Socio-political structure of Ghana Empire",
                  "Factors that led to the rise of Ghana Empire",
                  "Factors that led to the fall of Ghana Empire"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to identify the location of Ghana Empire on the map of Africa",
                  "Discusses the socio-political structure of Ghana Empire with students",
                  "Guides students to identify the factors that led to the rise of Ghana Empire",
                  "Guides students to identify the factors that led to the fall of Ghana Empire",
                  "Asks and answers questions on the lesson"
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate actively in locating the position of Ghana Empire on the map of Africa",
                  "Contribute to class discussions about the socio-political structure of Ghana Empire",
                  "Identify the factors that led to the rise of Ghana Empire",
                  "Identify the factors that led to the fall of Ghana Empire",
                  "Ask and answer questions"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Africa",
                  "Posters",
                  "Video Clips",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Identify the location of Ghana Empire on the map of Africa",
                  "Describe the socio-political structure of Ghana Empire",
                  "Explain 2 factors that led to the rise of the Ghana Empire",
                  "Explain 2 factors that led to the fall of Ghana Empire"
                ]
              },
              {
                "TOPIC NAME": "Mali Empire",
                "PERFORMANCE OBJECTIVES": [
                  "Identify the location of Mali Empire on the map of Africa",
                  "Describe the socio-political structures of Mali Empire",
                  "Explain the factors that led to the rise of Mali Empire",
                  "Explain the factors that led to the fall of Mali Empire"
                ],
                "CONTENT": [
                  "Location of Mali Empire on the map of Africa",
                  "Socio-political structure of Mali Empire",
                  "Factors that led to the rise and fall of Mali Empire",
                  "Factors that led to the fall of Mali Empire"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to identify the location of Mali Empire on the map of Africa",
                  "Discusses the socio-political structure of Mali Empire with students",
                  "Guides students to identify the factors that led to the rise of Mali Empire",
                  "Guides students to identify the factors that led to the fall of Mali empire",
                  "Asks students questions on the lesson"
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate actively in locating Mali Empire on the map of Africa",
                  "Contribute to class discussions about the socio-political structure of Mali Empire",
                  "Identify the factors that led to the rise of Mali Empire",
                  "Identify the factors that led to the fall of Mali Empire",
                  "Ask and answer questions"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Africa",
                  "Posters",
                  "Video Clips",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Identify the location of Mali Empire on the map of Africa",
                  "Describe the socio-political structure of Mali Empire",
                  "Explain 2 factors that led to the rise of Mali Empire",
                  "Explain 2 factors that led to the fall of Mali Empire"
                ]
              },
              {
                "TOPIC NAME": "Songhai Empire",
                "PERFORMANCE OBJECTIVES": [
                  "Identify the location of Songhai Empire on the map of Africa",
                  "Describe the socio-political structures of the Songhai Empire",
                  "Explain the factors that led to the rise of the Songhai Empire",
                  "Explain the factors that led to the fall of Songhai Empire"
                ],
                "CONTENT": [
                  "Location of Songhai Empire on the map of Africa",
                  "Socio-political structure of Songhai Empire",
                  "Factors that led to the rise of Songhai Empire",
                  "Factors that led to the fall of Songhai Empire"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides students to identify the location of Songhai Empire on the map of Africa",
                  "Discusses the socio-political structure of Songhai Empire with students",
                  "Guides student to identify the factors that led to the rise of Songhai Empire",
                  "Guides students to identify the factors that led to the fall of Songhai Empire",
                  "Asks students questions on the lesson and answers their questions"
                ],
                "STUDENTS ACTIVITIES": [
                  "Participate actively in locating the position Songhai Empire on the map of Africa",
                  "Contribute to class discussions about the socio-political structure of Songhai Empire",
                  "Identify the factors that led to the rise of Songhai Empire",
                  "Identify the factors that led to the fall of Songhai Empire",
                  "Ask and answer questions"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Africa",
                  "Video Clips",
                  "Posters",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Identify the location of Songhai Empire on the map of Africa",
                  "Describe the socio-political structure of the Songhai Empire",
                  "Explain 2 factors that led to the rise of the Songhai Empire",
                  "Explain 2 factors that led to the fall of Songhai Empire"
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  "JSS 3": {
    "THEMES": [
      {
        "THEME NAME": "External Contacts and Trade",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "External Contacts and Trade",
            "TOPICS": [
              {
                "TOPIC NAME": "Origin and Organisation of Trans-Saharan Trade",
                "PERFORMANCE OBJECTIVES": [
                  "Describe the origin and nature of Trans-Saharan Trade",
                  "Identify the commodities traded in the Trans-Saharan Trade",
                  "Identify the trade routes during the Trans-Saharan Trade",
                  "State the effects of Trans-Saharan Trade"
                ],
                "CONTENT": [
                  "Origin and nature of Trans-Saharan Trade",
                  "Commodities traded during the Trans-Saharan Trade: Gold Salt Horses Slaves Ostrich feathers Spices, etc.",
                  "Trade routes during Trans-Saharan Trade: Borno-Tripoli route Kanem Borno –Sudan route. Kano-Fezzan route.",
                  "Effects of Trans-Saharan Trade: Introduction of international trade. Introduction of the use of camels as a means of transportation. Introduction of slave trade across the Sahara. Introduction of Islam and Arabic language Encouraged interaction between North Africa and West Africa, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the origin of Trans-Saharan Trade",
                  "Describes the nature of Trans-Saharan Trade to students",
                  "Shows students the Trans-Saharan Trade routes using the map of Africa",
                  "Guides students to identify the various commodities traded during the Trans-Saharan Trade",
                  "Discusses the effects of Trans-Saharan Trade",
                  "Asks students to make a poster of the Trans-Saharan Trade routes"
                ],
                "STUDENTS ACTIVITIES": [
                  "Listen to the teacher’s explanation and take notes",
                  "Take note of the key features of the Trans-Saharan Trade",
                  "Participate actively in locating the Trans-Saharan Trade routes on the map of Africa",
                  "Identify the various commodities traded in the Trans-Saharan Trade",
                  "Contribute to class discussion about the effects of the Trans-Saharan Trade",
                  "Make a poster showing the Trans-Saharan Trade routes"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Map of Africa",
                  "Cardboard paper",
                  "Posters",
                  "Markers",
                  "Video Clips",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Describe the nature of Trans-Saharan Trade",
                  "Identify 4 commodities sold in the Trans-Saharan Trade",
                  "Identify 2 trade routes during Trans-Saharan Trade",
                  "Mention 3 effects of Trans-Saharan Trade"
                ]
              },
              {
                "TOPIC NAME": "Early European contacts with Nigeria",
                "PERFORMANCE OBJECTIVES": [
                  "Describe the early European contacts with Nigeria",
                  "Identify the early Europeans that came to Nigeria",
                  "Describe the nature of Trans-Atlantic Slave Trade",
                  "Describe the nature of the Legitimate Trade"
                ],
                "CONTENT": [
                  "Nature of early European contacts with Nigeria",
                  "Early Europeans that came to Nigeria: European Explorers (e.g. Mungo Park, H. Clapperton, Richard and John Lander (i.e. the Lander Brothers), etc) European traders and merchants (e.g. Taubman Goldie, John Holt, etc.) Christian Missionaries. (e.g. Mary Slessor, Birch Freeman, Samuel Bill, Henry Townsend, Ajayi Crowther, etc.)",
                  "Nature of the Trans-Atlantic Slave Trade: Organization Impact Abolition of Trans-Atlantic Slave Trade",
                  "The Legitimate Trade (i.e the trade of Palm Oil)"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the nature of the early European contacts with Nigeria",
                  "Discusses the activities of the various early Europeans that came to Nigeria",
                  "Asks students to identify the European explorers, traders and Christian missionaries",
                  "Explains the nature of Tans-Atlantic Slave Trade from its organisation up to when it was abolished",
                  "Guides students to discuss the features of the Legitimate Trade"
                ],
                "STUDENTS ACTIVITIES": [
                  "Listen to the teacher’s explanation and make notes",
                  "Participate in class discussions and ask questions",
                  "Identify the European explorers, traders and Christian Missionaries",
                  "Listen to the teacher’s explanations and write down notes on Trans-Atlantic Slave Trade",
                  "Contribute to class discussions about the features of the Legitimate Trade after the abolition of slave trade"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Video clips",
                  "Posters",
                  "Photographs of early European explorers",
                  "Flash Cards",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Describe the nature of the early European contacts with Nigeria",
                  "Identify 4 early Europeans (explorers, traders and Christian Missionaries) that came to Nigeria",
                  "Describe the nature of Trans-Atlantic slave trade",
                  "Explain the Legitimate Trade"
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "Political Developments in Nigeria",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "Political Developments in Nigeria",
            "TOPICS": [
              {
                "TOPIC NAME": "British Colonisation of Nigerian Territories",
                "PERFORMANCE OBJECTIVES": [
                  "Describe British contact with Nigerian peoples",
                  "Explain how the British conquered Nigeria territories",
                  "Describe the British system of colonialism in Nigeria"
                ],
                "CONTENT": [
                  "British contact with Nigeria: As explorers As traders As missionaries",
                  "How the British conquered Nigerian Territories: Signing of treaties Waging of wars",
                  "British system of colonialism: Direct rule Indirect rule"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the nature of British contact with Nigerian territories",
                  "Discusses the strategies used by the British to conquer Nigerian territories",
                  "Guides students to explain the concepts of direct and indirect rule used by the British to colonise Nigerian territories",
                  "Asks and answers questions on the lesson",
                  "Asks students to read textbooks about the British system of colonialism at home"
                ],
                "STUDENTS ACTIVITIES": [
                  "Listen to the teachers’ explanations and take down notes",
                  "Participate in class discussion about the strategies used by the British to conquer Nigerian territories",
                  "Explain the concepts of direct and indirect rule",
                  "Ask questions about the lesson",
                  "Read textbooks about the British system of colonialism"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Texts books",
                  "Video clips",
                  "Posters",
                  "Internet",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Describe the nature of British contact with Nigerian territories",
                  "Write short notes on one of the strategies used by the British to conquer Nigerian territories",
                  "Describe the British system of colonialism"
                ]
              },
              {
                "TOPIC NAME": "The Evolution of the Nigerian State",
                "PERFORMANCE OBJECTIVES": [
                  "Describe the Berlin Treaty that awarded Nigerian territories to Great Britain",
                  "Explain the roles of the Royal Niger Company in Nigerian territories",
                  "Describe the colonial conquest and administration of Nigerian territories"
                ],
                "CONTENT": [
                  "The Berlin Treaty: Major reasons for the treaty. Major features of the treaty",
                  "The roles of the Royal Niger Company in Nigerian Territories",
                  "Colonial conquest and administration of Nigerian territories"
                ],
                "TEACHER ACTIVITIES": [
                  "Asks students to read a textbook about the Berlin Treaty that awarded Nigerian territories to Britain",
                  "Holds a class discussion about the Berlin Treaty",
                  "Explains the roles of the Royal Niger Company in the administration of Nigerian territories",
                  "Guides students to discuss how Nigerian territories were conquered and administered",
                  "Asks and answers questions"
                ],
                "STUDENTS ACTIVITIES": [
                  "Read assigned textbooks about the Berlin Treaty",
                  "Contribute actively to class discussion",
                  "Listen carefully to the teachers’ explanations and take notes",
                  "Participate in discussions about the conquest and administration of Nigerian territories",
                  "Ask questions about the lesson"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Maps",
                  "Video clips",
                  "Posters",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Describe the Berlin Treaty that awarded Nigerian territories to Great Britain",
                  "Explain the roles of the Royal Niger Company in Nigerian territories",
                  "Describe how Nigerian territories were conquered and administered by the British"
                ]
              },
              {
                "TOPIC NAME": "The Amalgamation of Nigeria",
                "PERFORMANCE OBJECTIVES": [
                  "Explain the meaning of Amalgamation",
                  "Identify the reasons for Amalgamation",
                  "State the process of Amalgamation",
                  "Identify key personalities involved in the Amalgamation of Nigerian Territories"
                ],
                "CONTENT": [
                  "Meaning of Amalgamation",
                  "Reasons for the Amalgamation of Nigerian Territories",
                  "Process of the Amalgamation of Nigerian Territories",
                  "Key personalities and their roles in the Amalgamation of the Nigerian Territories: Taubman Goldie Lord Laggard The European Missionaries Nigerian Traditional rulers, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides the students to discuss the meaning of Amalgamation",
                  "Uses posters of key personalities involved in the Amalgamation to explain the Amalgamation to students and the roles of the personalities involved",
                  "Guides students to identify the reasons for the amalgamation of Nigerian Territories",
                  "Asks questions about the lesson"
                ],
                "STUDENTS ACTIVITIES": [
                  "Contribute to class discussions about the meaning of Amalgamation",
                  "Identify the key personalities involved in the Amalgamation and explain their roles",
                  "Note the reasons for the amalgamation of Nigerian Territories",
                  "Take notes on the nature of Amalgamation from teacher’s explanations and answer questions from the teacher"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Textbooks",
                  "Posters",
                  "Video clips",
                  "Maps",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "State the meaning of Amalgamation",
                  "State 3 key personalities involved in the Amalgamation of Nigerian Territories",
                  "Explain the roles of the 3 personalities",
                  "Explain 2 reasons for the Amalgamation of Nigerian Territories"
                ]
              },
              {
                "TOPIC NAME": "The Independence Movement",
                "PERFORMANCE OBJECTIVES": [
                  "Explain Nationalism",
                  "Describe the factors that contributed to Nigerian Nationalism",
                  "Describe the nature of Nigerian Nationalism"
                ],
                "CONTENT": [
                  "Meaning of Nationalism",
                  "Factors that contributed to Nigerian Nationalism",
                  "The nature of Nigerian Nationalism: The struggle for Independence. People involved in the struggle for Independence (e.g. Nnamdi Azikwe, Herbert Macaulay, Anthony Enahoro, Obafemi Awolowo, Ahmadu Bello, Aminu Kano, etc.) Attainment of Independence in 1960"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of Nationalism to students",
                  "Guides a discussion about the factors that contributed to Nigerian Nationalism",
                  "Guides students to explain the various activities involved in the struggle for independence",
                  "Leads students to list and explain the roles of various personalities involved in the struggle for independence",
                  "Discusses the attainment of Independence in 1960 with students"
                ],
                "STUDENTS ACTIVITIES": [
                  "Pay attention to the teacher’s explanations and take notes",
                  "Contribute to class discussions and ask questions",
                  "Explain the various activities involved in the struggle for independence",
                  "List and explain the roles of the key personalities involved in the struggle for independence",
                  "Participate in the discussion on the attainment of independence in 1960"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant Text books",
                  "Video clips",
                  "News papers",
                  "Pictures",
                  "Posters",
                  "Relevant pictures"
                ],
                "EVALUATION GUIDE": [
                  "Explain the meaning of Nationalism",
                  "Describe 2 factors that contributed to Nigerian Nationalism",
                  "Describe the nature of Nigerian Nationalism",
                  "List 2 personalities involved in the attainment of Nigerian’s independence and state their roles"
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}