{
  "PRIMARY 4": {
    "THEMES": [
      {
        "THEME NAME": "BASIC SCIENCE",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "LEARNING ABOUT OUR ENVIRONMENT",
            "TOPICS": [
              {
                "TOPIC NAME": "Changes in Nature",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of change;",
                  "mention the changes they observe in their surrounding;",
                  "state the differences between temporary and permanent changes;",
                  "give examples of temporary and permanent changes."
                ],
                "CONTENT": [
                  "Types of changes:",
                  "- Temporary (reversible)",
                  "- Permanent (irreversible)"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to state the meaning of change",
                  "Uses posters to initiate and guide class discussion on the changes that have taken place around them.",
                  "Carries out at least two class demonstrations to help pupils distinguish between temporary (reversible) and permanent (irreversible) changes.",
                  "Writes few notes on the chalkboard based on the activities above."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion and group activities.",
                  "Observe and describe changes taking place in their surroundings, e.g. construction of new roads, sprouting of grass in the rainy season, burning of candles; melting of ice blocks; burning pieces of wood; Wetting a piece of cloth etc.",
                  "Differentiate and group these changes as temporary and permanent changes.",
                  "copy notes as written on the chalkboard."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A poster showing changes occurring in school and home surroundings.",
                  "Immediate school surrounding.",
                  "Water.",
                  "Nails",
                  "Candle",
                  "Matches",
                  "Wood",
                  "Pieces of paper",
                  "Container",
                  "Pieces of cloth"
                ],
                "EVALUATION GUIDE": [
                  "state the meaning of change;",
                  "describe two changes around them;",
                  "state two differences between temporary and permanent changes;",
                  "list four examples, each, of permanent and temporary changes."
                ]
              },
              {
                "TOPIC NAME": "Our weather",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of weather;",
                  "identify the factors affecting the weather;",
                  "relate weather conditions to changes in these factors;",
                  "name the standard weather instruments;",
                  "improvise simple weather instruments;",
                  "identify and write simple weather symbols;",
                  "observe weather changes over a period of about three weeks;",
                  "use the weather symbols to keep records of weather changes;",
                  "prepare a weather chart."
                ],
                "CONTENT": [
                  "Weather: meaning.",
                  "Factors affecting weather: sun, cloud, wind, temperature, moisture (rain)",
                  "Weather instruments: wind vane, rain gauge, thermometers, barometers",
                  "Weather records e.g. for: temperature, rainfall.",
                  "Weather symbols: sun, rain, cloud, etc.",
                  "Weather records."
                ],
                "TEACHER ACTIVITIES": [
                  "States the meaning of weather.",
                  "Guides pupils to discuss factors affecting weather and helps them to suggest how these factors determine weather changes.",
                  "Provides and uses pictures of standard instruments to help pupils identify and name standard weather instruments.",
                  "Arranges a visit to a meteorological station",
                  "Guides pupils to improvise weather instruments",
                  "Uses the chart to guide the pupils to identify and draw weather symbols.",
                  "Guides pupils to: make weather observations; and keep weather records."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion and group activities.",
                  "Visit a meteorological station to observe and learn how to use some standard weather instruments.",
                  "Make improvised weather instruments.",
                  "Draw weather symbols.",
                  "Observe the weather and record their observations.",
                  "Make a weather chart of their observations."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A chart showing the weather conditions.",
                  "A chart showing the weather instruments.",
                  "Various sizes of cans, sheets of metal (aluminum)",
                  "cutter",
                  "wires",
                  "stands",
                  "Thermometer",
                  "Tracing paper",
                  "Graph sheet",
                  "A chart showing the weather symbols",
                  "Cardboard papers",
                  "Coloured Pencils;",
                  "Crayons"
                ],
                "EVALUATION GUIDE": [
                  "define weather;",
                  "list two factors affecting the weather;",
                  "describe the effect of changes in the factors;",
                  "improvise simple weather instruments (wind vane);",
                  "draw weather symbols;",
                  "keep weather records; (using personally improvised rain gauge);",
                  "prepare a weather chart to cover a period of 3 weeks."
                ]
              },
              {
                "TOPIC NAME": "Safety in Our Environment",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of safety and 'right to life';",
                  "list ways of keeping safe at: home, school, on the road;",
                  "list simple safety devices;",
                  "state the advantages of road safety."
                ],
                "CONTENT": [
                  "Meaning of safety: 'right to life'; right of everyone to use the road without being injured or killed.",
                  "Ways of keeping safe at: home, school, on the road",
                  "Simple safety devices",
                  "Advantages of road safety."
                ],
                "TEACHER ACTIVITIES": [
                  "States the meaning of safety and 'right to life'",
                  "Guides pupils to discuss ways of keeping safe and participate actively in the discussion.",
                  "Guides pupils to list simple safety devices at home, school, on road (e.g. traffic lights, road signs, road markings like road/zebra crossing rules).",
                  "Provides picture and charts on simple safety devices.",
                  "Initiates and Guides discussion on the advantages of road safety."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussions.",
                  "Make improvised simple safety devices.",
                  "Draw some safety devices, road signs/symbols.",
                  "Practice how to safely cross the road in class."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Road Sign Chart",
                  "Safety Devices",
                  "Chart/ Pictures",
                  "Fire Extinguisher",
                  "Net (e.g. insecticide treated net).",
                  "Shoe",
                  "Water",
                  "Sand bucket"
                ],
                "EVALUATION GUIDE": [
                  "state the meaning of 'right to life';",
                  "state the meaning of safety;",
                  "list some safety measures to take at home;",
                  "list the advantages of road safely."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "LIVING AND NON-LIVING THINGS",
            "TOPICS": [
              {
                "TOPIC NAME": "Changes in Plants and Animals",
                "PERFORMANCE OBJECTIVES": [
                  "observe and describe changes in plants;",
                  "record the changes observed;",
                  "observe and describe changes in different animals;",
                  "mention the names of the young ones of different animals;",
                  "state the major reasons for the observed changes;",
                  "draw and label the life cycle of some common animals."
                ],
                "CONTENT": [
                  "Changes in plants e.g. leaf fall, flower and fruits, etc.",
                  "Changes in animals:",
                  "names of the young ones of animals.",
                  "life cycle of insects;",
                  "other growth or developmental changes;"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to observe changes in a growing plant and make a record of the observed changes.",
                  "Initiates and guides pupils' discussion on other changes in plants e.g. leaf fall, thickening of tree bark as they grow older, etc.",
                  "Uses the chart to initiate class discussion on the life cycle of some insects.",
                  "Guides pupils to: identify and name the young ones of animals; describes the differences between these young ones and their adult members.",
                  "Guides pupils to draw the life cycles of insects."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion on other changes that take place in plants.",
                  "Observe and describe changes in the life cycle of common animals e.g. housefly, cockroach, toad.",
                  "Identify and name the young ones of different animals.",
                  "Compare the young ones with their adults and state reasons for the observed differences.",
                  "Draw the life-cycle of some insects."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Bean seeds",
                  "Glass jars or empty tins.",
                  "Water",
                  "Soil.",
                  "A picture of forest showing leaf fall.",
                  "A record paper.",
                  "A chart on the life cycle of some insects e.g. house fly.",
                  "Specimens of the young ones of some common animals e.g. cockroach, toad, housefly and their young ones e.g. nymph, tadpole respectively."
                ],
                "EVALUATION GUIDE": [
                  "list at least one change that could be observed in a plant as it grows;",
                  "give the names of the young ones of the different animals;",
                  "describe changes in different animals;",
                  "state the reasons for the observed changes;",
                  "draw and label the life cycle of some common insects."
                ]
              },
              {
                "TOPIC NAME": "Human Body (The mouth)",
                "PERFORMANCE OBJECTIVES": [
                  "name the types of teeth in the mouth;",
                  "locate the relative positions of teeth in the mouth;",
                  "mention the uses of each type of teeth;",
                  "state the role of the tongue in feeding;",
                  "state the role of the lips in feeding."
                ],
                "CONTENT": [
                  "The Teeth: incisors, canines, premolars, molars",
                  "The tongue.",
                  "The lips."
                ],
                "TEACHER ACTIVITIES": [
                  "Shows pupils the types of teeth.",
                  "Initiates and guides class discussions on: the uses of the different types of teeth; the roles of the tongue and lips in feeding."
                ],
                "PUPILS ACTIVITIES": [
                  "Work in pairs to identify and locate the types of teeth in their mouths.",
                  "Chew some pieces of bread, or garri, and: note the type of teeth used for chewing; feel the texture of the food items before and after chewing.",
                  "Discuss the uses of the teeth, lips, tongue and saliva in feeding."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pieces of bread.",
                  "Slices of boiled yam.",
                  "Mirror",
                  "A chart of the human teeth.",
                  "Model of the Mouth"
                ],
                "EVALUATION GUIDE": [
                  "name four different types of teeth in the mouth;",
                  "identify and locate the position of each type of teeth in the mouth;",
                  "state the uses of the different types of teeth in feeding;",
                  "describe the roles of the lips and tongue in feeding."
                ]
              },
              {
                "TOPIC NAME": "Water",
                "PERFORMANCE OBJECTIVES": [
                  "identify pure water as a liquid with no colour, taste and odour;",
                  "observe that heated water can disappear as steam;",
                  "observe that steam can change back to water;",
                  "Observe that water can change to ice (solid)."
                ],
                "CONTENT": [
                  "Differentiating water from other liquids",
                  "Evaporation",
                  "Condensation",
                  "freezing"
                ],
                "TEACHER ACTIVITIES": [
                  "Displays water and other liquids in bowls in the class.",
                  "Demonstrates evaporation.",
                  "Demonstrates condensation.",
                  "Leads class discussion and initiates active participation of pupils.",
                  "Presents ice blocks to pupils and guide them to understand that the ice block is frozen water."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe water and other liquids displayed by teacher.",
                  "Observe teacher's demonstration on evaporation.",
                  "Observe teacher's demonstration on condensation.",
                  "Pupils participate actively, making suggestions."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Water and other liquids.",
                  "Source of heat.",
                  "Containers for displaying and boiling water.",
                  "A cool flat surface.",
                  "Ice block."
                ],
                "EVALUATION GUIDE": [
                  "list two features that identify a liquid as water;",
                  "state at least one change that would be observed when water is heated;",
                  "state at least one change that would be observed when steam condenses.",
                  "state one change that would be observed when water freezes"
                ]
              },
              {
                "TOPIC NAME": "Water cycle",
                "PERFORMANCE OBJECTIVES": [
                  "make a chart of water cycle;",
                  "state the relationships between the formation of rain and water cycle."
                ],
                "CONTENT": [
                  "Water cycle",
                  "Rain formation"
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class discussion on: the drying up of streams in the dry season; rain formation and the water cycle"
                ],
                "PUPILS ACTIVITIES": [
                  "Watch teacher's demonstrations.",
                  "Observe dews on leaves and explain how they are formed",
                  "Participate in class discussion.",
                  "Draw the water cycle."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A chart of the water cycle showing how cloud and rain are formed"
                ],
                "EVALUATION GUIDE": [
                  "describe the process of rain formation;",
                  "draw and label the water cycle."
                ]
              },
              {
                "TOPIC NAME": "Measuring liquids",
                "PERFORMANCE OBJECTIVES": [
                  "measure amounts of liquids accurately using graduated measuring cylinders, cups or jars;",
                  "state the metric unit of volume;",
                  "improvise a measuring cylinder with estimated scales for volumes in metric system."
                ],
                "CONTENT": [
                  "Measuring the volume of liquids in: mm³, cm³"
                ],
                "TEACHER ACTIVITIES": [
                  "Provides pupils with measuring cylinders and graduated jars and cups.",
                  "Uses appropriate chart and guide pupils to take correct readings of liquids in the measuring cylinder.",
                  "Guides pupils to improvise measuring cylinders with estimated scales.",
                  "display written volume of content in common soft drinks and juice drink packs (e.g. coke 35cl)"
                ],
                "PUPILS ACTIVITIES": [
                  "Measure the volume of liquids in metric units.",
                  "Record their measurements correctly with units.",
                  "Improve and calibrate measuring cylinders with scales estimated in metrics units.",
                  "Find equivalent volumes of market measures using standard calibrated instruments.",
                  "Finds out volumes of soft drinks and juice drinks on their packs."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Measuring cylinders of different sizes.",
                  "Water.",
                  "Other liquids e.g. kerosene, oil, etc.",
                  "Empty jam jars.",
                  "Rulers",
                  "Strips of paper.",
                  "Pens.",
                  "Notebooks",
                  "Coke bottles",
                  "Juice drink packs"
                ],
                "EVALUATION GUIDE": [
                  "measure amounts of liquids accurately using graduated measuring cylinders;",
                  "state the metric units of volume;",
                  "improvise a measuring cylinder with estimated scales in metric system."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "BASIC TECHNOLOGY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "UNDERSTANDING BASIC TECHNOLOGY",
            "TOPICS": [
              {
                "TOPIC NAME": "Technology and You",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of technology;",
                  "list the importance of technology;",
                  "state the products of technology ."
                ],
                "CONTENT": [
                  "Meaning of technology",
                  "Importance of technology",
                  "Products of technology"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains and defines technology with good illustrations.",
                  "Explains the importance of technology with illustrations.",
                  "Shows films of products of technology",
                  "Produces charts that illustrate the products of technology."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussions",
                  "Identify the products of technology",
                  "Watch the films and ask questions.",
                  "Study the chart and understand the need for technology"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts and pictures showing technological products.",
                  "Video cassettes films etc."
                ],
                "EVALUATION GUIDE": [
                  "state the meaning of technology;",
                  "state three importance of technology;",
                  "list three products of technology."
                ]
              },
              {
                "TOPIC NAME": "Shape construction with paper, wood or metal",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of shape construction;",
                  "list materials used for shape construction;",
                  "identify and state tools used in shape constructions;",
                  "fold and bend metal or cardboard to form an object."
                ],
                "CONTENT": [
                  "Concept of shape construction",
                  "Materials used for shape construction: wood, metal and paper",
                  "Cutting tools used in shape construction e.g. chisel, snips, scissors, saws, etc.",
                  "Shape construction methods: folding, bending."
                ],
                "TEACHER ACTIVITIES": [
                  "Discusses and defines shape construction.",
                  "Displays materials used for cutting in shape construction.",
                  "Demonstrates how objects can be formed by folding and bending: cylinder, cone, box, funnel."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in discussion.",
                  "Observe the materials and cutting tools displays.",
                  "Watch the demonstration of how to construct shapes.",
                  "Construct shapes using cardboard."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Chisel",
                  "Snips",
                  "Scissors",
                  "Pliers",
                  "Hammer",
                  "Mallets",
                  "Cardboard",
                  "Sheet of metal"
                ],
                "EVALUATION GUIDE": [
                  "state what shape construction Means;",
                  "list three tools and materials used in shape construction;",
                  "use cardboard sheet to construct a cylinder, cone and box."
                ]
              },
              {
                "TOPIC NAME": "Vehicles",
                "PERFORMANCE OBJECTIVES": [
                  "state what a vehicle is;",
                  "identify different types of vehicle;",
                  "identify different parts of vehicle (external parts);",
                  "draw different types and parts of vehicles;",
                  "State the use of a vehicle;",
                  "state one disadvantage of a vehicle."
                ],
                "CONTENT": [
                  "Meaning of a vehicle.",
                  "Different types of vehicles: bicycle, motorcycle, car, bus, truck/trailer.",
                  "External parts of vehicle.",
                  "Use and disadvantage of vehicle."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils in defining a vehicle.",
                  "Initiates the class discussion on different types of vehicle, uses and disadvantage with pupils participating actively.",
                  "Guides pupils in drawing different types of vehicles and vehicle parts."
                ],
                "PUPILS ACTIVITIES": [
                  "Pupils participate in the discussion.",
                  "Pupils draw different types of vehicles.",
                  "Pupils state the use of vehicle."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts",
                  "Toy vehicles",
                  "Vehicles in the school compound"
                ],
                "EVALUATION GUIDE": [
                  "state what a vehicle is;",
                  "list different types of vehicles;",
                  "state one use of vehicle;",
                  "state one disadvantage of vehicle."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "YOU AND ENERGY",
            "TOPICS": [
              {
                "TOPIC NAME": "Forms of Energy",
                "PERFORMANCE OBJECTIVES": [
                  "state uses of energy;",
                  "identify different sources of energy."
                ],
                "CONTENT": [
                  "Uses of energy e.g. to work.",
                  "Sources of energy; e.g. sun, tide and waves, fuels, wind and water."
                ],
                "TEACHER ACTIVITIES": [
                  "Uses specific examples in emphasizing the differences between the various forms of energy.",
                  "Uses charts and pictures to guide pupils to identify and name various sources of energy."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussions and group activities",
                  "Name various sources of energy."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Relevant charts and pictures",
                  "Candle",
                  "torch light",
                  "gas",
                  "Oil,",
                  "Charcoal,",
                  "kerosene",
                  "Solar panel in surrounding",
                  "Radio"
                ],
                "EVALUATION GUIDE": [
                  "list two common sources of energy;",
                  "mention two uses of energy"
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "PHYSICAL AND HEALTH EDUCATION",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "BASIC MOVEMENT",
            "TOPICS": [
              {
                "TOPIC NAME": "Moving our Body Parts",
                "PERFORMANCE OBJECTIVES": [
                  "list the basic locomotor movements;",
                  "explain how to perform each of the movements;",
                  "demonstrate movement patterns;",
                  "practice the skills of locomotor movement."
                ],
                "CONTENT": [
                  "Locomotor movements: Walking, Running, Skipping, Sliding, Hopping, Jumping, Leaping."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the basic movement skills",
                  "Demonstrates the basic movement skills.",
                  "Observes and supervises the basic movement skills.",
                  "Corrects the pupils practice errors."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teacher",
                  "Watch the teacher's demonstration",
                  "Practice the activities."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts",
                  "Pictures",
                  "Video clips",
                  "mats",
                  "rope",
                  "rings."
                ],
                "EVALUATION GUIDE": [
                  "list any 5 locomotor activities;",
                  "perform any two Locomotor activities;",
                  "list any five apparatus used in locomotor activities."
                ]
              },
              {
                "TOPIC NAME": "Moving our Body Parts II",
                "PERFORMANCE OBJECTIVES": [
                  "list any five non-locomotor movements;",
                  "state how to perform each of the non-locomotor activities;",
                  "perform non-locomotor movements."
                ],
                "CONTENT": [
                  "Non-locomotor movements: Stretching, Bending, Twisting, Swinging, Pulling, Pushing"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the activities.",
                  "Demonstrates the activities.",
                  "supervises the pupils practices."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teacher's explanation.",
                  "Practice the activities in groups and individually."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Mats",
                  "Swings",
                  "Rope"
                ],
                "EVALUATION GUIDE": [
                  "list at least 4 non-locomotor movements;",
                  "perform at least 4 non-locomotor movements."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "GAMES AND SPORTS",
            "TOPICS": [
              {
                "TOPIC NAME": "Athletics",
                "PERFORMANCE OBJECTIVES": [
                  "list the types of middle and long distance races;",
                  "mention the skills in middle and long distance races."
                ],
                "CONTENT": [
                  "Types of middle and long distance races: middle distance (800m, 1500m), Long distance races (3000m, 3000m steeple chase, 5000m).",
                  "Skill in Middle and long distance races: standing, take-off, running, arm action, finish"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the skills involved in middle and long distance races.",
                  "Demonstrates the skills involved in middle and long distance races.",
                  "Observes pupils demonstration and make corrections."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teacher",
                  "Practice all skills as demonstrated by the teacher."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts",
                  "Video clips",
                  "Posters",
                  "books",
                  "shoes",
                  "tracks",
                  "whistle or starting gun",
                  "Chalkboard.",
                  "Baton",
                  "Video Clips",
                  "stop watches"
                ],
                "EVALUATION GUIDE": [
                  "mention the skills involved in middle and long distance races;",
                  "perform the middle and long distance races skills."
                ]
              },
              {
                "TOPIC NAME": "Ball Games",
                "PERFORMANCE OBJECTIVES": [
                  "list the football skills;",
                  "perform the skills in football;",
                  "Perform the skills in tennis;",
                  "demonstrate the position of players on the court;",
                  "perform the skills in basketball.",
                  "list the skills in volleyball;",
                  "perform the skills in volleyball and count points."
                ],
                "CONTENT": [
                  "Football skills: dribbling, shooting, ball control, goal keeping.",
                  "Tennis skills: the grip, service, forehand drive, backhand drive, scoring",
                  "Basketball skills: forwards, guards, Centre pass, jump ball, dribbling, passing, shooting, rebounding",
                  "Volleyball skills e.g. serving, passing, scoring"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains and demonstrates the skills in: football, table tennis, basketball, volley ball",
                  "Supervises the pupil's as they practice.",
                  "Explains the position of players in the games."
                ],
                "PUPILS ACTIVITIES": [
                  "Practice skills as many times as possible"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Footballs",
                  "Whistle",
                  "Football Pitch",
                  "Chalkboard.",
                  "Table.",
                  "Bats",
                  "Tennis Balls,",
                  "Net",
                  "Score Board",
                  "Volleyball Ball",
                  "Volleyball Court",
                  "Flags.",
                  "Whistle",
                  "Basketball Court",
                  "Basketball Balls.",
                  "Stop Watch",
                  "Bell",
                  "Score Board."
                ],
                "EVALUATION GUIDE": [
                  "list two football skills;",
                  "perform the skills in football;",
                  "perform the skills in table tennis;",
                  "demonstrate the position of players on the court;",
                  "Perform the skills in basket ball.",
                  "list three volleyball skills;",
                  "perform the skills in volleyball and state how scoring is done."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "HEALTH EDUCATION",
            "TOPICS": [
              {
                "TOPIC NAME": "Personal Hygiene",
                "PERFORMANCE OBJECTIVES": [
                  "describe ways of taking care of the human body parts."
                ],
                "CONTENT": [
                  "What to do to take care of parts of the human body."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains and demonstrates various ways people can take care of the human body parts."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teacher and participate actively in class discussions.",
                  "State ways of taking care of human body parts.",
                  "Write down the ways of caring for the body parts."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Wall charts",
                  "Soap",
                  "Brush",
                  "Comb",
                  "Toothpaste",
                  "Towels etc."
                ],
                "EVALUATION GUIDE": [
                  "list three ways each of taking care of identified human body parts."
                ]
              },
              {
                "TOPIC NAME": "First Aid and Safety Education",
                "PERFORMANCE OBJECTIVES": [
                  "Group the contents of the First Aid Box into components;",
                  "state the uses of each content of the First Aid Box;",
                  "list some safety measures."
                ],
                "CONTENT": [
                  "Grouping the content of a first aid box",
                  "Components of a First Aid Box: Food, Water, Medication, Support objects.",
                  "Uses of the Materials in the First Aid Box.",
                  "Safety measures e.g. putting on appropriate sports attire."
                ],
                "TEACHER ACTIVITIES": [
                  "Shows the contents of a First Aid box to pupils.",
                  "Leads pupils in class discussion."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to teacher's explanations.",
                  "participate actively in class discussion.",
                  "Write notes."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "First Aid box and its contents",
                  "charts",
                  "pictures",
                  "Textbooks"
                ],
                "EVALUATION GUIDE": [
                  "list 5 First Aid box materials;",
                  "state 2 uses of first aid box materials;",
                  "state 2 safety measures."
                ]
              },
              {
                "TOPIC NAME": "Safety Education and accident prevention",
                "PERFORMANCE OBJECTIVES": [
                  "define safety;",
                  "state the causes of accidents;",
                  "list safety rules to prevent accidents;",
                  "state the meaning of road safety;",
                  "list road safety guidelines;",
                  "distinguish between general crashes and road traffic crashes;",
                  "state the meaning of 'medicine vigilance';",
                  "Identify examples of adverse medicine reactions;",
                  "state steps to be taken in the event of any adverse reactions due to medicine intake."
                ],
                "CONTENT": [
                  "Meaning of safety.",
                  "Causes of accidents.",
                  "Prevention of accidents.",
                  "Meaning of Road safety.",
                  "Road Safety measures: Traffic control, Vehicle maintenance, Road maintenance, Road signs, Road markings, Pavement marking, Public education.",
                  "Road safety guidelines for Pedestrians, Cyclists, Motorcyclists, Animals.",
                  "Consequences of not observing road safety guidelines.",
                  "General crashes.",
                  "Road traffic crashes.",
                  "Medicine vigilance (to be aware of any adverse reactions when medicine is taken)."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils discussion on what safety is.",
                  "Assists pupils to identify the causes of accidents- at home, in school or on the road.",
                  "Explains ways by which accidents can be prevented.",
                  "Explains road safety and road safety guidelines.",
                  "Distinguishes between general crashes and road traffic crashes.",
                  "Displays some safety devices e.g. gloves, caps, aprons, etc.",
                  "Invites the FRSC officials to visit the class or visit the FRSC command where possible.",
                  "Invites a NAFDAC official or a pharmacist to visit the class or visit a nearby pharmacy.",
                  "Guides pupils to dramatize medicine vigilance.",
                  "Initiates the formation of NAFDAC consumers' safety club."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion and group activities.",
                  "Touch and put on safety devices.",
                  "Differentiate between general crashes and road traffic crashes.",
                  "Listen to talk given by the visiting FRSC Official and NAFDAC Official/pharmacist.",
                  "Dramatize medicine vigilance.",
                  "Visit nearby NAFDAC office/pharmacy."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts showing accidents and their causes.",
                  "Charts or pictures that show safe action",
                  "Charts/video -clips on 'medicine vigilance'",
                  "Safety devices: gloves, caps, aprons, shield",
                  "Pieces of sharp objects.",
                  "Real objects"
                ],
                "EVALUATION GUIDE": [
                  "state three causes of accidents",
                  "list three ways accidents can be prevented;;",
                  "distinguish between general crashes and road traffic crashes;",
                  "mention four consequences of not observing road safety guide lines;",
                  "discuss some road safety measures;",
                  "State five road safety guidelines;",
                  "list three examples of adverse reactions due to medicine intake;",
                  "state what should be done when a person reacts adversely to intake of medicine."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "INFORMATION TECHNOLOGY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "BASIC COMPUTER OPERATIONS",
            "TOPICS": [
              {
                "TOPIC NAME": "Computer hard ware",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of computer hardware components;",
                  "list the hardware components of a computer."
                ],
                "CONTENT": [
                  "Meaning of Computer Hardware: (Hardware is the part of computer system we can see and touch).",
                  "Hardware Components: keyboard, Monitor, system unit, CD /DVD -ROM."
                ],
                "TEACHER ACTIVITIES": [
                  "Shows the hardware components that make up the computer.",
                  "Displays pictures of the hardware components."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe the hardware components in groups.",
                  "Draw and label the hardware components."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Keyboard",
                  "Monitor",
                  "System unit",
                  "Joystick",
                  "Mouse",
                  "Pictures"
                ],
                "EVALUATION GUIDE": [
                  "explain the meaning of hardware;",
                  "identify two components of the computer hardware."
                ]
              },
              {
                "TOPIC NAME": "Computer Software.",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of software;",
                  "mention common operating system, games and word processing software and state the uses of the software above;",
                  "list examples of each type of software above;",
                  "play games software on a computer;",
                  "type text using MS-Word;",
                  "draw and paint simple objects using the PAINT."
                ],
                "CONTENT": [
                  "Meaning: (A set of instructions given to computer to make it function).",
                  "Types of software (Mention only common operating systems including those of mobile phones."
                ],
                "TEACHER ACTIVITIES": [
                  "Boots the computer to demonstrate what the operating system does.",
                  "Guides pupils to identify different types of common operating systems and that of phone. Types short text to demonstrates word processing.",
                  "Draws objects to demonstrate graphics.",
                  "Plays available game in computer/mobile phone to demonstrate entertainment.",
                  "Writes notes on the chalkboard for pupils to copy."
                ],
                "PUPILS ACTIVITIES": [
                  "Repeat each activity demonstrated by the teacher."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A computer system with all the necessary software installed."
                ],
                "EVALUATION GUIDE": [
                  "state what software means;",
                  "state three different types of software;",
                  "write down two examples of each type of software;",
                  "mention the uses of each type of software mentioned;",
                  "use PAINT software to draw a chair and ball."
                ]
              },
              {
                "TOPIC NAME": "Starting up the Computer",
                "PERFORMANCE OBJECTIVES": [
                  "explain the term booting",
                  "list ways of booting;",
                  "describe the steps for booting a computer;",
                  "boot a computer."
                ],
                "CONTENT": [
                  "Meaning of Booting.",
                  "Types of Booting: cold booting, warm booting.",
                  "The steps for booting."
                ],
                "TEACHER ACTIVITIES": [
                  "Displays an already connected computer set.",
                  "Explains what booting is.",
                  "Demonstrates how to boot a computer system."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe the teacher demonstrate how to boot a computer system..",
                  "Practice booting a computer.",
                  "Boot a computer system."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Computer system.",
                  "Power source."
                ],
                "EVALUATION GUIDE": [
                  "define booting;",
                  "mention three steps in booting a computer system;",
                  "state two ways of booting."
                ]
              },
              {
                "TOPIC NAME": "Data and Information",
                "PERFORMANCE OBJECTIVES": [
                  "state the meaning of data and information;",
                  "mention sources of information;",
                  "describe computer as Input - Process - Output (IPO) system;",
                  "list characters on the keyboard as data."
                ],
                "CONTENT": [
                  "Meaning of: Data (unprocessed facts), Information (processed facts)",
                  "Sources of information: radio; television; newspaper; computer.",
                  "Computer as IPO system: collects data and enter it using keyboard; processes data through central processing unit; produces results as information through the output devices."
                ],
                "TEACHER ACTIVITIES": [
                  "Brings some information devices to the classroom and plays/shows them to the pupils.",
                  "Demonstrates the uses of computer as a source of information."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe and make use of information devices",
                  "Use keyboard to enter data."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Radio",
                  "Television",
                  "Newspaper/ magazine",
                  "Computer System",
                  "Charts",
                  "Pictures"
                ],
                "EVALUATION GUIDE": [
                  "state the meaning of data and information;",
                  "list three sources of information;",
                  "list three ways computer can be used as a source of information;",
                  "use keyboard to enter characters as data."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "BASIC CONCEPTS OF INFORMATION TECHNOLOGY",
            "TOPICS": [
              {
                "TOPIC NAME": "Common IT Gadgets",
                "PERFORMANCE OBJECTIVES": [
                  "state what IT stands for.",
                  "identify IT gadgets.",
                  "operate common IT gadgets."
                ],
                "CONTENT": [
                  "IT: Information and Communications Technology",
                  "IT gadgets: computer, mobile phones, remote control, V sat dish, DVD, etc",
                  "Operating common IT gadgets: computer, GSM phone, remote control"
                ],
                "TEACHER ACTIVITIES": [
                  "Displays common IT gadgets in class.",
                  "Guides pupils to identify the gadgets.",
                  "Leads pupils in class discussion on use of IT gadgets.",
                  "Guides pupils to draw the IT gadgets.",
                  "Demonstrate how to operate IT gadgets and guides them to operate them."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe and recognize each IT gadget displayed.",
                  "Participate actively in class discussion.",
                  "Operate IT gadgets under teacher's supervision.",
                  "Draw IT Gadgets."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Computer.",
                  "Remote control.",
                  "Mobile phones.",
                  "V-sat dish."
                ],
                "EVALUATION GUIDE": [
                  "State what IT stands for;",
                  "list at least two common IT gadgets;",
                  "State at least one use of any two different IT gadgets."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  "PRIMARY 5": {
    "THEMES": [
      {
        "THEME NAME": "BASIC SCIENCE",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "LEARNING ABOUT OUR ENVIRONMENT",
            "TOPICS": [
              {
                "TOPIC NAME": "Environmental Changes",
                "PERFORMANCE OBJECTIVES": [
                  "describe erosion and state the causes of erosion;",
                  "list the effects or dangers of erosion;",
                  "identify, discuss and implement simple strategies for controlling erosion;",
                  "define pollution and list some water and air pollutants;",
                  "list common sources of pollution;",
                  "describe the consequences of water pollution on the people and on the environment;",
                  "describe the roles of the communities, industries and oil exploration in air and water pollution;",
                  "suggest ways of reducing the risks of pollution."
                ],
                "CONTENT": [
                  "Erosion: causes, effects, control",
                  "Air and Water Pollution: pollutants, sources, effects, control"
                ],
                "TEACHER ACTIVITIES": [
                  "Shows pupils charts, photographs of areas devastated by erosion.",
                  "Guides pupils to: explain the meaning of erosion, state the causes and dangers (effects) of erosion, suggest control measures.",
                  "Arranges for pupils to visit and observe erosion sites in the locality.",
                  "Guides pupils to carry out a project on controlling erosion.",
                  "Shows pictures of polluted water.",
                  "Arranges for pupils to visit industrial areas and observe the emission of gases into the air; the release of effluent waste into the rivers, etc.",
                  "Guides pupils' discussion on the various ways the community, industries etc pollute water and air.",
                  "Guides discussion on measures of controlling pollution"
                ],
                "PUPILS ACTIVITIES": [
                  "Look at photographs of erosion sites and discuss the causes, effect and control measures.",
                  "Visit erosion sites in their locality.",
                  "Participate in a project to control erosion at the site.",
                  "Look at pictures of polluted water and describe what they observe.",
                  "Visit industrial areas to observe ways industries pollute air and water."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Photographs, Charts and Pictures on erosion.",
                  "Hoe, Cutlasses",
                  "Shovel and spade",
                  "Tree seedlings.",
                  "Grass, etc.",
                  "Photographs and charts showing polluted water, industries letting, fumes into the air.",
                  "Posters/ photographs showing areas affected by oil spillage"
                ],
                "EVALUATION GUIDE": [
                  "describe erosion;",
                  "state three causes of erosion;",
                  "state three effects of erosion;",
                  "state three ways of controlling erosion;",
                  "describe pollution and list five air and water pollutants respectively;",
                  "identify three sources of air and water pollution respectively;",
                  "state three consequences each of air and water pollution on people and the environment;",
                  "suggest three ways of controlling or reducing the risks of air and water pollution."
                ]
              },
              {
                "TOPIC NAME": "Waste and Waste Disposal",
                "PERFORMANCE OBJECTIVES": [
                  "explain what constitute waste;",
                  "identify different types of waste;",
                  "mention methods of disposal of waste;",
                  "suggest different ways of recycling waste and the advantages of recycling waste."
                ],
                "CONTENT": [
                  "Types of waste: refuse, sewage etc",
                  "Waste Disposal.",
                  "Re-using waste (Recycling)."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads discussion on proper disposal of wastes.",
                  "Displays pictures and diagrams of ways of disposing waste.",
                  "Guides pupils to make compost pit, as a way of disposing or recycling waste.",
                  "Arranges for a guest to talk on recycling waste.",
                  "Arranges visit to land fill area where wastes are recycled"
                ],
                "PUPILS ACTIVITIES": [
                  "Listen, ask questions and discuss waste and how to recycle waste.",
                  "Prepare and develop a compost pit.",
                  "Prepare posters that teach proper disposal of household waste.",
                  "Discuss the dangers of not disposing waste properly."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Picture/charts of waste disposal van, buckets, wheel barrows, drums, shovel, spade, etc.",
                  "Waste dumps: bottles, paper, sticks, empty cans, water, wood ash, leaf litters etc."
                ],
                "EVALUATION GUIDE": [
                  "describe waste and group waste as solid (refuse) and liquid (sewage) waste;",
                  "state two methods of proper disposal of waste;",
                  "mention three dangers of improper disposal of waste;",
                  "identify two methods of recycling refuse waste."
                ]
              },
              {
                "TOPIC NAME": "Environmental Quality",
                "PERFORMANCE OBJECTIVES": [
                  "state the advantages of a healthy environment;",
                  "state the disadvantages of degrading the environment;",
                  "identify ways of maintaining healthy and beautiful school environment;",
                  "list materials for maintaining healthy environment."
                ],
                "CONTENT": [
                  "Environmental quality.",
                  "Advantages of a healthy environment.",
                  "Disadvantages of degrading the environment.",
                  "Ways of maintaining a healthy environment.",
                  "The materials for maintaining a healthy environment."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads class discussion on environmental quality",
                  "Helps pupils plan, clean and beautify their school environment"
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion",
                  "Plant flowers to beautify the school surrounding",
                  "Sweep and clean their school surrounding everyday"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Potted plants",
                  "Materials: brooms, rakes, hoes, cutlasses, machetes, baskets.",
                  "Pictures of an attractive surrounding."
                ],
                "EVALUATION GUIDE": [
                  "state four advantages of a healthy environment;",
                  "mention three disadvantages of degrading our surrounding;",
                  "state two ways of beautifying the environment;",
                  "list four materials for maintaining a healthy environment."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "LIVING AND NON-LIVING THINGS",
            "TOPICS": [
              {
                "TOPIC NAME": "The Human Body (The Skeleton)",
                "PERFORMANCE OBJECTIVES": [
                  "identify the major bones in the body;",
                  "identify the major joints in the body;",
                  "state the functions of bones and joint."
                ],
                "CONTENT": [
                  "Types of bones: long bones (femur, humerus), vertebrae (cervical, thoracic), phalanges (toes)",
                  "Types of joints: ball and socket, (shoulder), hinge joint (elbow, knee)",
                  "Functions of bones and joints."
                ],
                "TEACHER ACTIVITIES": [
                  "Using charts or model of human skeleton: describes the major bones, describes the major joints",
                  "Guides pupils to state the functions of bones and joints."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe the chart on skeletal system or the model of human skeleton.",
                  "Name the major bones in the body.",
                  "Observe and describe what bones are like e.g. hard, strong.",
                  "State the major joints in the body",
                  "State the functions of bones and joints in the human body."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Chart or model of human skeleton showing types of bones and joints.",
                  "X-ray film."
                ],
                "EVALUATION GUIDE": [
                  "name and describe major bones of the human body;",
                  "describe major joints;",
                  "state two functions each of bones and joints."
                ]
              },
              {
                "TOPIC NAME": "Reproduction in Plants",
                "PERFORMANCE OBJECTIVES": [
                  "identify parts of a flower;",
                  "explain the meaning of pollination;",
                  "identify agents and types of pollination;",
                  "identify parts of a flower that are concerned with pollination and fertilization;",
                  "describe stages of development from flower to fruit;",
                  "distinguish between pollination and fertilization."
                ],
                "CONTENT": [
                  "Parts of a flower.",
                  "Pollination: types, process, agents",
                  "Fertilization.",
                  "Stages of development from flower to fruits."
                ],
                "TEACHER ACTIVITIES": [
                  "Provides flowers e.g. hibiscus to guide the pupils to identify parts of a flower.",
                  "Draws a flower and labels its parts.",
                  "Guides the pupils to identify parts of a flower that produce fruit.",
                  "Guides discussion on pollination.",
                  "Guides discussion on the development of fruits."
                ],
                "PUPILS ACTIVITIES": [
                  "Bring flowers to the class.",
                  "Identify and name parts of a flower.",
                  "Draw a flower and label its parts.",
                  "Identify parts of a flower that produce fruit.",
                  "Participate in the discussion on pollination/ fertilization.",
                  "Identify stages of development from flower to fruit."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Life flowers e.g. hibiscus, cowpea flower.",
                  "Chart or diagram of a flower , agents of pollination, development from flower to fruit.",
                  "Drawing book.",
                  "Pencil."
                ],
                "EVALUATION GUIDE": [
                  "name and identify parts of a flower;",
                  "list the types of pollination;",
                  "list the agents of pollination;",
                  "list the changes that occur at different stages of development from flower to fruit;",
                  "distinguish between pollination and fertilization in flowering plant;",
                  "draw and label a given flower."
                ]
              },
              {
                "TOPIC NAME": "Rocks",
                "PERFORMANCE OBJECTIVES": [
                  "identify and classify rocks according to colour, hardness, texture, etc.;",
                  "list some important uses of rocks such as construction, beautification, etc;",
                  "name some major landmark rocks in Nigeria."
                ],
                "CONTENT": [
                  "Types of Rocks: Igneous, Metamorphous, Sedimentary",
                  "Uses of Rocks",
                  "Major landmark rocks in Nigeria e.g. Zuma rock in Madalla, Shere rock in Jos, Olumo rock in Abeokuta, Kufena rock in Zaria"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to: classify rocks, state the major uses of rocks.",
                  "Gives examples of major landmark e.g. Rocks in Nigeria."
                ],
                "PUPILS ACTIVITIES": [
                  "Collect, observe and classify rocks on the basis of colour, shape hardness etc.",
                  "State some important uses of rocks.",
                  "Read about major land mark rocks in Nigeria."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Different samples of rocks.",
                  "Charts showing types of rocks and their uses."
                ],
                "EVALUATION GUIDE": [
                  "classify rocks based on their shape, colour, texture etc.;",
                  "name three major landmark rocks in Nigeria;",
                  "list 3 importance of rocks;"
                ]
              },
              {
                "TOPIC NAME": "Acids and Bases",
                "PERFORMANCE OBJECTIVES": [
                  "give examples of acids and bases;",
                  "list some physical properties of acids and bases;",
                  "state types of acids and bases;",
                  "list some uses of acids and bases;",
                  "distinguish between acids and bases;",
                  "name local materials used in making soap;",
                  "identify the active ingredients in the local material used in making soap;",
                  "make soap from local materials;",
                  "state the uses of soap."
                ],
                "CONTENT": [
                  "Acid and Base: meaning and examples",
                  "Some physical properties of acids and base.",
                  "Types of acid and bases.",
                  "Uses of acids and bases.",
                  "Soap making.",
                  "Uses of soap."
                ],
                "TEACHER ACTIVITIES": [
                  "Provides materials needed for the lesson (Lemon, wood ash, water, red and blue litmus paper.",
                  "Demonstrates physical properties of acids and bases by: using blue litmus paper on lemon which will turn it red; using red litmus paper on mixture of wood ash in water which will turn it blue.",
                  "Gives names of acids and bases",
                  "Guides the pupils to taste lemon and dissolve ash in water and report their observation.",
                  "Initiates discussion on uses of acids and bases to include soap making.",
                  "Take safety precautions"
                ],
                "PUPILS ACTIVITIES": [
                  "Carry out teacher directed activities on: Lemon (acid), Mixture of wood ash and water (base), Use of red and blue litmus papers, Use of acids and bases especially in soap making.",
                  "Use palm oil and dissolved wood ash to make soap",
                  "Identify active ingredients used in making soap from palm oil and wood ash.",
                  "State the uses of soap"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Lemon,",
                  "Wood ash,",
                  "Water,",
                  "Blue and red litmus papers,",
                  "Glass or plastic container.",
                  "Palm oil",
                  "Stove",
                  "Cans and containers",
                  "Spatula or wooden spoon",
                  "Dirty Handkerchief"
                ],
                "EVALUATION GUIDE": [
                  "explain the meaning of acid and base",
                  "give three examples each of acids and bases;",
                  "state physical properties of acids and bases;",
                  "distinguish between acids and bases using litmus papers etc;",
                  "list two uses of acids and bases.",
                  "state two types each of acids and bases;",
                  "name local materials used in making soap;",
                  "identify acids and bases as ingredients used in making soap;",
                  "make soap using local materials;",
                  "state 3 uses of soap."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "BASIC TECHNOLOGY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "UNDERSTANDING BASIC TECHNOLOGY",
            "TOPICS": [
              {
                "TOPIC NAME": "Materials and Maintenance",
                "PERFORMANCE OBJECTIVES": [
                  "identify materials used in technology;",
                  "list types of wood, metal and plastic;",
                  "state what these materials are used for;",
                  "explain the meaning of maintenance;",
                  "state the need for maintenance;"
                ],
                "CONTENT": [
                  "Identification of materials: wood, metal, plastic.",
                  "Type of wood, metal, plastic.",
                  "Uses of materials.",
                  "Meaning of maintenance.",
                  "Importance of maintenance."
                ],
                "TEACHER ACTIVITIES": [
                  "Displays materials and discusses the materials used in technology.",
                  "Guides students to identify and classify the materials.",
                  "Explains what these materials are used for.",
                  "Discusses the meaning of maintenance.",
                  "Leads the pupils to identify the importance of maintenance."
                ],
                "PUPILS ACTIVITIES": [
                  "Take a survey around the school compound and identify materials used. Suggest reasons why particular materials are used. E.g. metal for door handles.",
                  "Touch and feel the nature of the materials.",
                  "Participate in class discussions and group activities."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Wood",
                  "Metal",
                  "Plastic",
                  "Oil",
                  "Rag",
                  "Pieces of metal"
                ],
                "EVALUATION GUIDE": [
                  "list three types of materials used in technology;",
                  "state three uses of each of the following: wood, metal, plastic;",
                  "state two reasons why maintenance is needed."
                ]
              },
              {
                "TOPIC NAME": "Basic Motor Vehicle Parts (Internal)",
                "PERFORMANCE OBJECTIVES": [
                  "mention the internal parts of motor vehicle;",
                  "identify the internal parts of a motor vehicle;",
                  "discuss the basic functions of the internal parts of a motor vehicle."
                ],
                "CONTENT": [
                  "Internal parts of motor vehicle e.g. air bags, seat belts, steering, brakes, clutches, pedals, gear, etc.",
                  "Functions of the internal parts of motor vehicle."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads the pupils to list and identify the internal parts of a motor vehicle.",
                  "Explains the basic functions of the internal parts of the motor vehicles.",
                  "Organizes a visit to a mechanic workshop/ organizes the pupils to see the internal parts of a car in the neighbourhood."
                ],
                "PUPILS ACTIVITIES": [
                  "Mention the internal parts of a motor vehicle.",
                  "Identify the internal parts of a vehicle.",
                  "Visit a mechanic workshop.",
                  "Discuss the basic functions of the internal parts of a motor vehicle."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A motor vehicle",
                  "Labeled diagram of internal parts of a motor vehicle.",
                  "Posters",
                  "Pictorials",
                  "Motor Mechanic Workshop."
                ],
                "EVALUATION GUIDE": [
                  "identify the internal parts of a motor vehicle;",
                  "mention five internal parts of a motor vehicle and their functions."
                ]
              },
              {
                "TOPIC NAME": "Drawing Instruments",
                "PERFORMANCE OBJECTIVES": [
                  "identify drawing instruments;",
                  "list five drawing instruments;",
                  "state the uses of drawing instruments;",
                  "Use some drawing instruments."
                ],
                "CONTENT": [
                  "Definition of drawing",
                  "Identification of drawing instruments.",
                  "Uses of drawing instruments.",
                  "Draw circles using compass, straight lines using rulers."
                ],
                "TEACHER ACTIVITIES": [
                  "Defines drawing",
                  "Displays the drawing instruments",
                  "Explains the uses of each drawing instruments: T-square, set square, drawing board, dividers, pair of compass, protractor, pencils, cleaner, etc.",
                  "Demonstrates the use of the instruments."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe the instruments displayed.",
                  "Touch and clean the instruments.",
                  "Draw circles using a pair of compass.",
                  "Draw straight lines using a ruler."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "T-square",
                  "Set- Square",
                  "Drawing Board",
                  "Drawing Sheets",
                  "Compasses",
                  "Dividers",
                  "Ruler",
                  "Protractor, etc."
                ],
                "EVALUATION GUIDE": [
                  "define drawing;",
                  "list five drawing instruments and their uses;",
                  "draw a circle and a straight line."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "YOU AND ENERGY",
            "TOPICS": [
              {
                "TOPIC NAME": "Energy Conversion",
                "PERFORMANCE OBJECTIVES": [
                  "explain the meaning of energy conversion;",
                  "name forms of energy conversions;",
                  "state the importance of energy conversions."
                ],
                "CONTENT": [
                  "Concept of energy conversion.",
                  "Forms of energy conversions: electrical to heat energy e.g. pressing iron; chemical to heat energy e.g. kerosene stove; electrical to mechanical e.g. blender; mechanical to electrical e.g. bicycle dynamo.",
                  "Importance of energy conversions."
                ],
                "TEACHER ACTIVITIES": [
                  "Discusses the meaning of energy conversion.",
                  "Demonstrates the conversion of energy from one form to another.",
                  "Discusses the importance of energy conversions."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion",
                  "List the forms and importance of energy conversion",
                  "Carry out simple activities on energy conversion."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Electric pressing iron.",
                  "Immersion heater (boiling ring).",
                  "Kerosene Stove.",
                  "Charcoal Pressing iron.",
                  "Bicycle Dynamo."
                ],
                "EVALUATION GUIDE": [
                  "define energy conversion",
                  "list at least three forms of energy conversion;",
                  "state at least three importance of energy conversion."
                ]
              },
              {
                "TOPIC NAME": "Heat and Temperature",
                "PERFORMANCE OBJECTIVES": [
                  "distinguish between heat and temperature;",
                  "identify and name different types of thermometers;",
                  "identify and write the units and symbol of temperature scale;",
                  "use the thermometer to measure the temperature of objects accurately."
                ],
                "CONTENT": [
                  "Differences between Heat and Temperature.",
                  "Temperature.",
                  "Thermometer.",
                  "Units and symbols of temperature scale (degree Celsius (°C)/ degree Farenheight (°F))."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils discussion of differences between Heat and Temperature.",
                  "Provides the pupils with different types of thermometers.",
                  "Uses charts to guide the pupils to: identify different types of thermometers; identify and name the units and symbols for temperature.",
                  "Demonstrate the correct method of using the thermometers to measure the temperature of objects."
                ],
                "PUPILS ACTIVITIES": [
                  "Handle and examine thermometer.",
                  "Practice, measure and record accurately the temperature of things e.g. hot water, their bodies, etc,"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A chart showing different thermometers",
                  "A chart showing the units and symbols of temperature correctly.",
                  "Different thermometers",
                  "Flask of hot water.",
                  "Some ice water."
                ],
                "EVALUATION GUIDE": [
                  "state the differences between heat and temperature;",
                  "name any three types of thermometers;",
                  "write the units and symbols of temperature;",
                  "use thermometers to measure temperature accurately."
                ]
              },
              {
                "TOPIC NAME": "Basic Electricity",
                "PERFORMANCE OBJECTIVES": [
                  "identify types of electricity;",
                  "explain how electricity is produced (generated) and used;",
                  "explain how electricity travels (conducted) from one point to another;",
                  "group materials into conductors (metals) and nonconductors (wood, glass, plastic);",
                  "make a simple electric circuit connection."
                ],
                "CONTENT": [
                  "Types of electricity: static, current.",
                  "Methods of Generating Electricity.",
                  "Conductors and nonconductors.",
                  "Electrical circuits.",
                  "Uses of electricity."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to produce electricity from: friction, magnets, chemicals.",
                  "Provides a variety of materials and guides pupils to: produce electricity; sort materials into conductors and non- conductors; make an electric circuit.",
                  "Uses electric circuit to demonstrate that it can: light bulbs; make magnets or magnetic field; generate heat.",
                  "Guides pupils to complete an electric circuit."
                ],
                "PUPILS ACTIVITIES": [
                  "Rub wool materials firmly on a hard rubber rod or comb and move the rod close to small pieces of paper or pins. Note what happens.",
                  "Rub fur or silk material on a glass rod and move the rod close to small pieces of paper or pin and note what happens.",
                  "Record findings and draw conclusions.",
                  "Using a simple dry cell (Battery), wires, and a light bulb, make a simple electric circuit."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Wool, fur or silk.",
                  "Hard rubber rod or comb.",
                  "Glass rod",
                  "Dry cell (1.5v)",
                  "Bar magnets",
                  "Nails, pieces of paper, ropes, threads.",
                  "Light bulbs,",
                  "Connecting wires",
                  "Circuit board",
                  "Lamp holders",
                  "Switch key",
                  "Pins.",
                  "Bar magnets",
                  "Iron fillings",
                  "Paper clips",
                  "Coins",
                  "Rubber bands"
                ],
                "EVALUATION GUIDE": [
                  "name types of electricity;",
                  "describe how electricity is generated and conducted from one point to another;",
                  "group materials into conductors and non- conductors (insulators) of electricity;",
                  "use the materials provided to complete an electric circuit."
                ]
              },
              {
                "TOPIC NAME": "Magnetism",
                "PERFORMANCE OBJECTIVES": [
                  "state the properties of magnets;",
                  "group materials into magnetic and non-magnetic;",
                  "state common applications of magnetism;",
                  "make and use magnets."
                ],
                "CONTENT": [
                  "Properties of magnets",
                  "Uses of magnets",
                  "Making magnets"
                ],
                "TEACHER ACTIVITIES": [
                  "Collects different types of magnets, e.g. horseshoe, bar.",
                  "Plans and organizes simple activities to enable pupils find out about magnetism.",
                  "Leads class discussions on the uses of magnets in some household appliances e.g. doorbell, loudspeakers, magnetic stickers for fridge's, magnetic screw drivers etc.",
                  "Guides pupils to make temporary magnets."
                ],
                "PUPILS ACTIVITIES": [
                  "Play with magnets to discover their properties e.g. - magnets will attract or repel one another - can act through non-magnetic materials, etc.",
                  "Examine toys and household appliances for magnets.",
                  "Group materials as magnetic and non-magnetic.",
                  "Make temporary magnets."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Bar magnets",
                  "Nails, pieces of paper, ropes, threads.",
                  "Light bulbs",
                  "Connecting wires",
                  "Circuit board,",
                  "Lamp holders",
                  "Switch key",
                  "Pins.",
                  "Bar magnets",
                  "Nails",
                  "Iron fillings",
                  "Paper clips",
                  "Coins",
                  "Rubber bands",
                  "Paper",
                  "Cork",
                  "Thread",
                  "Wires",
                  "Wool",
                  "Wooden blocks",
                  "Soft iron",
                  "loud speaker"
                ],
                "EVALUATION GUIDE": [
                  "state two of properties of a magnet;",
                  "name three common appliances that use magnets;",
                  "group materials into magnetic and non-magnetic materials;",
                  "make temporary magnets."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "PHYSICAL AND HEALTH EDUCATION",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "BASIC MOVEMENT",
            "TOPICS": [
              {
                "TOPIC NAME": "Creative Rhythmic Activities",
                "PERFORMANCE OBJECTIVES": [
                  "explain rhythmic activities;",
                  "mention any two types of rhythmic activities;",
                  "perform any two types of rhythmic activities;",
                  "mention some physical fitness components;",
                  "identify activities for measuring endurance, strength and speed;",
                  "explain how endurance, and speed are measured;",
                  "measure their endurance strength and speed levels."
                ],
                "CONTENT": [
                  "Marching",
                  "Galloping",
                  "Hopping",
                  "Physical Fitness components:",
                  "a) Endurance; press up, minute run, walk-bench step on and off, squat thrust",
                  "b) Strength; pull ups, sit ups",
                  "c) Speed: 50 meters dash"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains rhythmic activities.",
                  "Demonstrates marching, galloping and hopping.",
                  "Discusses the activities for measuring: endurance, strength and speed.",
                  "Demonstrates the measurement of endurance, strength and speed.",
                  "Supervises pupils' activities."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teacher",
                  "Watch the teacher's demonstration.",
                  "Practice the activity.",
                  "Measure their physical fitness levels."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Video clip",
                  "Drum sets",
                  "Flute",
                  "Drumming sticks",
                  "Charts",
                  "Mats",
                  "Benches",
                  "Pull up bars",
                  "Track",
                  "Stop watch etc."
                ],
                "EVALUATION GUIDE": [
                  "explain rhythmic activities;",
                  "list two rhythmic activities;",
                  "perform any two types of rhythmic activities",
                  "Mention any three physical fitness components;",
                  "identify activities for measuring endurance, strength and speed;",
                  "describe how endurance, strength and speed are measured;",
                  "measure other pupils' endurance, strength and speed correctly."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "GAMES AND SPORTS",
            "TOPICS": [
              {
                "TOPIC NAME": "Field Events",
                "PERFORMANCE OBJECTIVES": [
                  "mention the basic skills of long jump;",
                  "perform the skills in long jump;",
                  "mention the basic skills of high jump;",
                  "perform the skills in high jump."
                ],
                "CONTENT": [
                  "Long jump: the approach run or run up, the take off, the flight, the landing, recovery",
                  "High jump skills: run up, take off, flight, landing, recovery"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the skills involved in long jump.",
                  "Demonstrates the skills in long jump.",
                  "supervises and corrects demonstrations by pupils.",
                  "Explains the skills in high jump.",
                  "Demonstrates run up, take off, flight, landing and recovery skills.",
                  "Supervises pupils demonstrations",
                  "List skills on the chalkboard"
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to teachers explanations.",
                  "Watch and practice the skills.",
                  "Practice the different skills."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts,",
                  "Take off board",
                  "long jump pit",
                  "Video clip",
                  "measuring tape",
                  "Cross bar stand",
                  "High jump pit landing foam.",
                  "Chalkboard."
                ],
                "EVALUATION GUIDE": [
                  "mention any three skills in long jump;",
                  "perform the long jump skills;",
                  "mention any three skills in high jump;",
                  "perform the skills in high jump."
                ]
              },
              {
                "TOPIC NAME": "Ball Games",
                "PERFORMANCE OBJECTIVES": [
                  "define ball games;",
                  "state the facilities and equipment used to play Volley Ball, Basketball, Football, Hockey and Tennis;",
                  "play Volley Ball, Basketball, Football, Hockey and Tennis;",
                  "state the advantages of playing Volley Ball, Basketball, Football, Hockey and Tennis;",
                  "mention safety measures in participating in Ball Games."
                ],
                "CONTENT": [
                  "Definition of Ball games.",
                  "Facilities and equipment used in Volley Ball, Basketball, Football, Hockey and Tennis.",
                  "Skills for playing Volley Ball, Basketball, Football, Hockey and Tennis.",
                  "The advantages of playing Volley Ball, Basketball, Football, Hockey and Tennis.",
                  "Safety measures in playing Ball games."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains what ball games are.",
                  "Discusses the facilities and equipment used in Volley Ball, Basketball, Football, Hockey and Tennis.",
                  "Demonstrates skills for playing Volley Ball, Basketball, Football, Hockey and Tennis.",
                  "Leads pupils to discuss the advantages of playing Volley Ball, Basketball, Football, Hockey and Tennis.",
                  "Leads pupils to identify safety measures when playing the games"
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class and group discussions on the facilities and equipment used in ball games.",
                  "Play Volley Ball, Basketball, Football, Hockey and Tennis.",
                  "Discuss safety measures to put in place when playing ball games.",
                  "Discuss the advantages of playing ball games."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Chart",
                  "Picture",
                  "Video Clips",
                  "Volley Ball, Basketball, Football, Hockey and Tennis",
                  "Volleyball court",
                  "Basketball court",
                  "Football field",
                  "Tennis Court",
                  "Table Tennis board(please improvise where appropriate)",
                  "Nets",
                  "Whistle etc."
                ],
                "EVALUATION GUIDE": [
                  "state what ball games are;",
                  "mention the facilities and equipment used in playing Volley Ball, Basketball, Football, Hockey and Tennis;",
                  "play Volley Ball, Basketball, Football, Hockey and Tennis skillfully in teams;",
                  "state at least three advantages of playing Volley Ball, Basketball, Football, Hockey and Tennis;",
                  "mention at least five safety measures when playing the ball game."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "HEALTH EDUCATION",
            "TOPICS": [
              {
                "TOPIC NAME": "Nutrition",
                "PERFORMANCE OBJECTIVES": [
                  "mention sources of food nutrients;",
                  "list three nutritional diseases;",
                  "describe the characteristics of nutritional deficient persons;",
                  "describe the effect of family size on nutrition."
                ],
                "CONTENT": [
                  "Sources of food nutrients.",
                  "Nutritional deficiency diseases: Kwashiorkor, Rickets, Pellagra, Scurvy",
                  "Characteristics of these deficiency diseases.",
                  "Family size and its effect on nutrition."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads pupils to list the sources of food nutrients.",
                  "Guides the pupils to list the kinds of nutritional deficiency diseases that are common in the society.",
                  "Guides the pupils to list the effect of large family size on the nutrition of family members."
                ],
                "PUPILS ACTIVITIES": [
                  "With the help of the teacher mention the sources of food nutrients.",
                  "Discuss the effect of large family size on the nutrition of the family.",
                  "List nutritional deficiency diseases and the characteristics of nutritional deficient person"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Samples of food items.",
                  "Charts/photo graphs showing different kinds of foodstuff.",
                  "Photographs showing people suffering from nutritional deficiency diseases."
                ],
                "EVALUATION GUIDE": [
                  "mention sources of food nutrients;",
                  "mention three nutritional deficiency diseases;",
                  "mention the effects of family size on the available nutrition;",
                  "list some characteristics of nutritional deficient persons."
                ]
              },
              {
                "TOPIC NAME": "Diseases",
                "PERFORMANCE OBJECTIVES": [
                  "differentiate between sickness and illness;",
                  "differentiate between signs and symptoms;",
                  "distinguish between communicable and non-communicable diseases."
                ],
                "CONTENT": [
                  "Differentiate between sickness and illness.",
                  "Signs and symptoms.",
                  "Communicable and non-communicable diseases."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads pupils to identify the differences between: Sickness and illness; Signs and symptoms; Communicable and non- communicable diseases."
                ],
                "PUPILS ACTIVITIES": [
                  "Take part in the discussions and group activities."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pictures",
                  "Flip Charts",
                  "Posters."
                ],
                "EVALUATION GUIDE": [
                  "differentiate between sickness and illness;",
                  "state the difference between signs and symptoms;",
                  "distinguish between communicable and non-communicable diseases."
                ]
              },
              {
                "TOPIC NAME": "Drug Education",
                "PERFORMANCE OBJECTIVES": [
                  "list ways drugs can be taken into the body;",
                  "differentiate between alcohol and tobacco;",
                  "state reasons why people drink or smoke;",
                  "differentiate between the effects of alcohol and tobacco on human body;",
                  "explain the effects of drug abuse on an individual;",
                  "list effects of drug abuse on the family;",
                  "list 3 effects of drug abuse on the society;",
                  "define herbal medicine;",
                  "differentiate between NAFDAC registered and listed herbal medicine."
                ],
                "CONTENT": [
                  "Drug use and their consequences.",
                  "Ways of taking drugs: through mouth, rubbing on skin, injecting, inhaling.",
                  "Alcohol and tobacco: description of alcohol, types of alcoholic drinks and tobacco, reasons for drinking or smoking, effects of smoking.",
                  "Effects of drug abuse on: individuals, family, society.",
                  "Herbal Medicine."
                ],
                "TEACHER ACTIVITIES": [
                  "Uses charts to explain ways drugs can be taken into the body.",
                  "Uses posters to explain to the pupils the differences between alcohol and tobacco.",
                  "Leads pupils to discuss reasons why people drink and smoke.",
                  "Discusses the effects of drug abuse on individuals, family and society.",
                  "Explains the meaning of herbal medicine.",
                  "Teacher guides the pupils to identify NAFDAC listed and registered herbal medicine."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teacher and ask questions.",
                  "Participate in classroom discussion and group activities.",
                  "Answer teacher's questions.",
                  "Define herbal medicine.",
                  "Differentiate NAFDAC listed and registered herbal medicines."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts showing various drugs.",
                  "Posters showing different alcohol and tobacco.",
                  "Posters showing different herbal medicines.",
                  "NAFDAC symbol for registered and listed herbal medicine.",
                  "Samples of herbal medicine."
                ],
                "EVALUATION GUIDE": [
                  "state the ways drugs can be taken into the body;",
                  "differentiate between alcohol and tobacco;",
                  "state at least one reason why people drink or smoke;",
                  "differentiate between the effects of alcohol and tobacco on human health;",
                  "explain the effects of drug abuse on an individual;",
                  "list at least three effects of drug abuse on the family;",
                  "list at least three effects of drug abuse on the society;",
                  "define herbal medicine;",
                  "explain the symbols for NAFDAC registered and listed herbal medicines."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "INFORMATION TECHNOLOGY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "BASIC COMPUTER OPERATION",
            "TOPICS": [
              {
                "TOPIC NAME": "Computer Games",
                "PERFORMANCE OBJECTIVES": [
                  "play the games;",
                  "predict actions of the key players;",
                  "suggest possible solutions to the key problems."
                ],
                "CONTENT": [
                  "Academically inclined adventure games e.g. Prince, Test drive, Dave, Mario, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Displays latest adventure games.",
                  "Demonstrates adventure game e.g. Prince.",
                  "Asks leading questions on the problems encountered by the adventurers."
                ],
                "PUPILS ACTIVITIES": [
                  "Play adventure computer games to predict actions and results.",
                  "Provide answers to teacher's questions."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Computer with adventure games (.e. Prince, Dave, Test drive) installed."
                ],
                "EVALUATION GUIDE": [
                  "play computer adventure games in groups;",
                  "predict the action of the key players;",
                  "suggest possible solutions to the key problems."
                ]
              },
              {
                "TOPIC NAME": "Care and Protection of Computers",
                "PERFORMANCE OBJECTIVES": [
                  "list ways of taking good care of a computer system;",
                  "State reasons for taking care of computers;",
                  "List ways of protecting computers."
                ],
                "CONTENT": [
                  "Steps for caring for Computer Hardware - Position the computer properly. - Keep in an appropriate (air conditioned) environment. - Avoid liquid dropping into the system. - Avoid food particles. - Use dust covers. - Unplug the system when not in use for long.",
                  "Reasons for taking care of computer: - avoid damages; - protect the system; - prolong the life of the files in the system; - make the user comfortable for maximum efficiency.",
                  "Ways of protecting computers e.g. use of password, use of antivirus."
                ],
                "TEACHER ACTIVITIES": [
                  "Demonstrates ways of caring for the computer.",
                  "Guide pupils to clean the system using neat duster.",
                  "Explains to pupils why they need to take good care of the computer system.",
                  "Guide the pupils to draw up a roster for caring for the school computers.",
                  "Explains ways of protecting computers using password and antivirus."
                ],
                "PUPILS ACTIVITIES": [
                  "Watch teacher demonstrate care of the computer.",
                  "Participate in caring for the computers in the school computer laboratory.",
                  "Listen to the teacher, ask and answer questions, participate in class discussions.",
                  "Clean the computer system in their school",
                  "Examine antivirus packages and how it works."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Neat duster",
                  "Cotton wool.",
                  "Computer system.",
                  "Furniture.",
                  "Spirit.",
                  "Antivirus CD"
                ],
                "EVALUATION GUIDE": [
                  "name three ways of caring for the computer;",
                  "give two reasons for caring for the computer;",
                  "list two ways of protecting computers."
                ]
              },
              {
                "TOPIC NAME": "Internet I",
                "PERFORMANCE OBJECTIVES": [
                  "define: the internet, world wide web (www), electronic mail (e-mail), e-mail address, website;",
                  "identify: Internet browser on the computer, e-mail address, Website address on the address bar;",
                  "access the internet;",
                  "send and receive e-mail;",
                  "mention the benefits of internet;",
                  "mention the misuse of the internet."
                ],
                "CONTENT": [
                  "Terms and their meanings: Internet (the largest computer network in the world), e-mail address worldwide web (www) etc",
                  "Internet browsers: Microsoft Internet Explorer, Netscape, Mozilla etc.",
                  "Creating e-mail account.",
                  "Sending and receiving e-mail.",
                  "Chatting on the internet.",
                  "Uses and benefits of internet.",
                  "Abuses of internet: Fraud, Pornography, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Leads pupils to define the internet, e-mail address, website, web browser.",
                  "Organizes visit to cyber café to demonstrate the various uses of internet.",
                  "Guides pupils to: create e-mail accounts, write valid samples of e-mail and website addresses, send and receive mails, chat on the internet."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion.",
                  "Watch teacher's demonstration.",
                  "Practice writing valid e-mail and web addresses.",
                  "Visit a cyber café and do the following: create e-mail accounts, write valid samples of e-mail and website addresses, send and receive mails, chat on the internet."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Internet connected computer lab or cyber café."
                ],
                "EVALUATION GUIDE": [
                  "describe the: internet, world wide web (www); electronic mail, (e-mail) e-mail address; website;",
                  "list three internet browsers;",
                  "distinguish between e-mail and website addresses;",
                  "state three uses of internet;",
                  "state two abuses of internet."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  "PRIMARY 6": {
    "THEMES": [
      {
        "THEME NAME": "BASIC SCIENCE",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "LEARNING ABOUT OUR ENVIRONMENT",
            "TOPICS": [
              {
                "TOPIC NAME": "The Solar System",
                "PERFORMANCE OBJECTIVES": [
                  "identify and name some planets in our Solar System;",
                  "identify the components of the solar system, their location and importance;",
                  "state the relationships among the earth, sun, moon other planets and the stars;",
                  "demonstrate that the earth exerts a pull on objects and bodies."
                ],
                "CONTENT": [
                  "Our Solar System",
                  "The Planets",
                  "Gravity and Weightlessness in space"
                ],
                "TEACHER ACTIVITIES": [
                  "Uses charts to guide pupils to: name natural bodies in our solar system such as stars, moon, sun and planets; describe the characteristic features of planets and also mention the new status of Pluto; state the relationships among stars, planets, sun, moon, etc.",
                  "Uses pictures of people in space and on Earth and other simple activities to illustrate the existence and effect of gravity on objects.",
                  "Use Charts (or balls of various sizes placed on concentric circles) to show the location of planet Earth and other planets within our Solar System."
                ],
                "PUPILS ACTIVITIES": [
                  "Name natural bodies that can be found in our Solar System.",
                  "Model the solar system and name the planets.",
                  "Observe photographs of people walking in space and on land, compare them.",
                  "Throw stones, dusters, etc vertically and describe what happens."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Picture of people in space",
                  "Chart showing the solar system",
                  "Paper",
                  "Glue/gum",
                  "Scissors",
                  "Clay",
                  "Cardboard",
                  "Stone",
                  "Duster",
                  "Ruler",
                  "Strings",
                  "Balls of different sizes."
                ],
                "EVALUATION GUIDE": [
                  "identify natural bodies that can be found in our Solar System, their location and importance;",
                  "name the planets;",
                  "state some relationships among the earth, planets; stars, sun, and moon;",
                  "demonstrate the earth's pull on objects."
                ]
              },
              {
                "TOPIC NAME": "The Earth and its movements",
                "PERFORMANCE OBJECTIVES": [
                  "describe the two important movements of the earth (rotation and revolution) and their effects;",
                  "explain the causes of lunar and solar eclipse and their effects e.g. tide;",
                  "discuss some effects of the earth movement on the environment;",
                  "identify the major sources of light for the earth and other planets."
                ],
                "CONTENT": [
                  "The Sun.",
                  "Effects of the interaction between the Sun and the Earth: rotation, revolution, eclipses (solar and lunar)",
                  "Sources of light for the earth -the Sun , Moon and the Stars"
                ],
                "TEACHER ACTIVITIES": [
                  "Uses simple activities to illustrate: the Earth's rotation on its Axis and its effects; the earth's revolution around the Sun and its effects; the Earth's Orbit; lunar and solar eclipses",
                  "Initiates and guides discussions about causes of some of the observable natural phenomena like tides, seasons, moon phases, etc and their effects on the environment, e.g. heavy rains and tide destroying the environment through erosion.",
                  "Guides pupils to observe and record changes in the moon (moon phases)."
                ],
                "PUPILS ACTIVITIES": [
                  "Demonstrate causes of day and night.",
                  "Observe stars in the night, notice the constellation.",
                  "Read about stars constellation and learn the names of some of the stars.",
                  "Keep record of moon phases.",
                  "Participation in class discussion."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts",
                  "Pictures of moon phases",
                  "Light from a Torch light",
                  "Model of the Earth, Moon and the Sun"
                ],
                "EVALUATION GUIDE": [
                  "explain rotation and revolution of the earth and describe their effects on; the length of day and night; seasons.",
                  "mention the causes of lunar and solar eclipse and their effects;",
                  "mention two effects of earth movement on the environment;",
                  "name the major source of light for the earth and other planets."
                ]
              },
              {
                "TOPIC NAME": "Changes in Our Climate",
                "PERFORMANCE OBJECTIVES": [
                  "identify and write simple weather symbols;",
                  "observe changes in our climate over a period of time;",
                  "use the weather symbols to keep records of weather and climatic changes;",
                  "identify some effects of climate change on the Earth."
                ],
                "CONTENT": [
                  "Weather symbols: sun, rain, cloud, etc.",
                  "Weather records e.g. for: temperature, rainfall.",
                  "Global Warming some causes (e.g. Pollution, release of harmful gases) and effects (e.g. rising sea levels, flooding etc.) of increasing world temperatures."
                ],
                "TEACHER ACTIVITIES": [
                  "Uses charts to guide the pupils to identify and draw weather symbols.",
                  "Guides pupils to: make weather observation, keep weather records.",
                  "Show pictures of flooding landslides, hurricanes, wild fire, tsunamis etc."
                ],
                "PUPILS ACTIVITIES": [
                  "identify and draw weather symbols.",
                  "Observe weather and keep record of their observations.",
                  "Make a weather chart.",
                  "Compile various images of events that show effects of changes in the climate."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Chart showing the weather symbols.",
                  "Cardboard papers.",
                  "Coloured Pencils.",
                  "Crayons",
                  "Pictures/ newspaper or magazine cuttings showing effects of climate change."
                ],
                "EVALUATION GUIDE": [
                  "identify and draw weather symbols;",
                  "observe changes in our climate over a period of time;",
                  "use the weather symbols to keep records of weather and climatic changes;",
                  "identify at least three effects of climate change on the Earth."
                ]
              },
              {
                "TOPIC NAME": "Force",
                "PERFORMANCE OBJECTIVES": [
                  "explain forces as a push or pull;",
                  "give examples of forces - gravity, friction, magnetic etc;",
                  "demonstrate the effect of force on objects;",
                  "explain Frictional Force as the resistance between two surfaces in contact;",
                  "mention instances of the application of Frictional Force in daily activities;",
                  "state the advantages and disadvantages of friction."
                ],
                "CONTENT": [
                  "Meaning of Push and Pull",
                  "Examples of force.",
                  "Evidence of force",
                  "Effects of force",
                  "Meaning of friction",
                  "Effects of friction",
                  "Advantages and disadvantages of friction"
                ],
                "TEACHER ACTIVITIES": [
                  "Shows the effects of force for pupils to observe",
                  "Guides pupils' activity on force.",
                  "Guides pupils to demonstrate friction",
                  "Shows the effects of friction for pupil to observe",
                  "Plans and takes the class on visits to places such as metal fabrication workshop etc for pupils to observe friction"
                ],
                "PUPILS ACTIVITIES": [
                  "Play with springs, magnets, batteries, rubber bands etc to demonstrate the existence of force.",
                  "Describe the effect of force.",
                  "Push things in the class.",
                  "Rub the following surfaces together and describe their experiences: their palms; a rough surfaces against a smooth one; two smooth surfaces.",
                  "Describe what happens when: they rub their palms together; rub two stones together; strike two stones together; they strike a sharp edge of a machete against a stone.",
                  "Use different lubricants, ball- bearing, rollers to reduce friction.",
                  "Identify and discuss the effect of friction on the machines and tools found in the workplaces visited."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Nails",
                  "Stones and pebbles",
                  "Rough surfaces e.g. wood.",
                  "Smooth surfaces e.g. glass",
                  "Magnets",
                  "Batteries",
                  "Pieces of foam",
                  "Springs",
                  "Rubber bands, etc.",
                  "Palms",
                  "Balls bearings",
                  "Machete",
                  "Knife",
                  "Water",
                  "Vaseline",
                  "Sand paper",
                  "Oil",
                  "Soapy Water"
                ],
                "EVALUATION GUIDE": [
                  "define force;",
                  "give three examples of force;",
                  "describe the effect of force on materials;",
                  "define friction;",
                  "state two instance of the application of friction in daily activities;",
                  "mention two advantages and disadvantages each of friction."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "LIVING AND NON-LIVING THINGS",
            "TOPICS": [
              {
                "TOPIC NAME": "The Human Body system: Blood circulation",
                "PERFORMANCE OBJECTIVES": [
                  "name some parts of the human heart and major blood vessels;",
                  "differentiate among arteries, veins and capillaries;",
                  "state some basic functions of the human heart and blood vessels;",
                  "describe in simple terms how food and materials are distributed to different parts of the body by the blood."
                ],
                "CONTENT": [
                  "The human heart - structure - function.",
                  "Blood vessels - arteries - vein - capillaries.",
                  "Blood circulation."
                ],
                "TEACHER ACTIVITIES": [
                  "Sources and brings the models of human heart and blood vessels to the class.",
                  "Guides pupils to name parts of the heart and the blood vessels using diagrams in the textbook or charts.",
                  "Guides and moderates class discussion on blood circulation."
                ],
                "PUPILS ACTIVITIES": [
                  "Draw and label the human heart and the blood vessels.",
                  "Trace the movement of food and other materials by the blood to all parts of the human body using a chart.",
                  "State the basic functions of human heart and blood vessels."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Model of the human heart",
                  "Model of blood vessel.",
                  "Chart/ Diagram showing blood circulation."
                ],
                "EVALUATION GUIDE": [
                  "identify the parts of the human heart and the blood vessels;",
                  "state two distinguishing features of the arteries, veins and capillaries;",
                  "state two functions each of the heart and the blood vessels;",
                  "describe the blood circulation process."
                ]
              },
              {
                "TOPIC NAME": "The Human Body system: Reproduction",
                "PERFORMANCE OBJECTIVES": [
                  "explain reproduction in human beings;",
                  "identify the male and female reproductive organs;",
                  "state the functions of the male and female reproductive organs."
                ],
                "CONTENT": [
                  "Reproductive system",
                  "Meaning of reproduction",
                  "Male reproductive organs.",
                  "Female reproductive organs.",
                  "Functions of the reproductive organs"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of reproduction in human beings.",
                  "Uses charts to explain the male and female reproductive organs.",
                  "Guides pupils to state the functions of male and female reproductive organs.",
                  "Draws the male and female reproductive organs."
                ],
                "PUPILS ACTIVITIES": [
                  "Explain reproduction in human being.",
                  "Differentiate between male and female reproductive organs.",
                  "State the functions of male and female reproductive organs.",
                  "Draw and label the male and female reproductive organs."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts or models of male and female reproductive organs."
                ],
                "EVALUATION GUIDE": [
                  "explain the meaning of reproduction in human beings;",
                  "mention the various organs of male and female reproductive system;",
                  "state the functions of the organs of male and female reproductive system."
                ]
              },
              {
                "TOPIC NAME": "Air",
                "PERFORMANCE OBJECTIVES": [
                  "demonstrate that air presses on every object;",
                  "explain why things move in air;",
                  "explain why boats fixed with sails move faster on windy days;",
                  "state some of the applications of air pressure in: navigation; generation of electricity; floatation; suction."
                ],
                "CONTENT": [
                  "Air Pressure",
                  "Things that fly in air.",
                  "Why things move in air.",
                  "Applications: navigation, generating electricity, floatation, suction"
                ],
                "TEACHER ACTIVITIES": [
                  "Demonstrates the collapsible can experiment.",
                  "Uses an inverted tumbler filled with water and sealed with nylon or leaf to illustrate and explain air pressure.",
                  "Guides and moderates class discussion on: how air pressure enables things to move in air (airplanes, air balloons, birds etc.); effects of air pressure on boats sailing on the sea; special features of things that move in air (shape, light weight, possession of wings: hollow bones) etc.; the applications of air pressure in: generating electricity; (wind mill) navigation; and suction."
                ],
                "PUPILS ACTIVITIES": [
                  "Pump a deflated football; deflate it and describe their experience",
                  "Demonstrate air pressure using the inverted tumbler with water; and explain what keeps the water from pouring.",
                  "Make and operate: air propelled balloon; air propelled paper boat and discuss what makes them move.",
                  "Examine things that float in air and identify their special characteristics (lightness, shape)",
                  "use inflated balloons to lift objects.",
                  "Look at a picture or model of a Wind Mill."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Water tumbler",
                  "Cardboard",
                  "Cell phone",
                  "Balloons",
                  "Bicycle tyre",
                  "Pumps",
                  "Football",
                  "Paper",
                  "String",
                  "Kites",
                  "Water basin",
                  "Sticks",
                  "Gum",
                  "Picture or model of a Wind Mill"
                ],
                "EVALUATION GUIDE": [
                  "use simple activities to demonstrate air pressure;",
                  "explain why things move in air.",
                  "make things fly in air",
                  "observe their kites, parachutes etc;",
                  "mention two instances of the application of air pressure to do work e.g. lifting load; generating electricity etc."
                ]
              },
              {
                "TOPIC NAME": "Mineral Resources",
                "PERFORMANCE OBJECTIVES": [
                  "name some of the mineral resources found in Nigeria and their sources;",
                  "identify the mineral resources based on observable characteristics;",
                  "state the importance of mineral resources to Nigeria."
                ],
                "CONTENT": [
                  "Types of mineral resources in Nigeria.",
                  "Physical characteristics of some major mineral resources",
                  "Importance of mineral resources in: industries, transport/ communication, the economy, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Collects samples of minerals e.g. tin ore, coal, iron ore, crude oil etc for class activities. (Can use pictures where samples are not available).",
                  "Leads pupils to identify minerals.",
                  "Uses charts and relevant pictures to explain the sources of the minerals.",
                  "Guides class discussion on the uses and importance of mineral;",
                  "Arranges for a guest talk on the exploitation, development and use of mineral resources."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe the minerals provided and describe their characteristics (colour, shine, smell, hardness, etc.).",
                  "Examine crude petroleum and compare it with products such as kerosene, engine oil, Vaseline, grease, wax, polythene bags, clothing materials, etc.",
                  "Group the minerals into solid and liquid minerals.",
                  "State some importance of mineral resources to Nigeria."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Samples of minerals/ores (or pictures) e.g. tin- ore, crude oil, alum, marble.",
                  "Kerosene",
                  "Grease",
                  "Engine Oil",
                  "Polythene bags",
                  "Clothing materials",
                  "Vaseline, etc."
                ],
                "EVALUATION GUIDE": [
                  "give three examples of mineral resources in Nigeria and their sources;",
                  "group minerals into solid and liquid;",
                  "state three importance of mineral resources to Nigeria."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "BASIC TECHNOLOGY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "UNDERSTANDING BASIC TECHNOLOGY",
            "TOPICS": [
              {
                "TOPIC NAME": "Primary and Secondary Colours",
                "PERFORMANCE OBJECTIVES": [
                  "separate white light into the component colours;",
                  "identify and name the colours of light; (rainbow)",
                  "name objects that have characteristics of natural colours;",
                  "collect and list materials that produce colours.",
                  "sort primary and secondary colours from a collection of coloured plates;",
                  "identify characteristics of colour shades;",
                  "mix primary and secondary colours and identify the shades of colours produced."
                ],
                "CONTENT": [
                  "The components of light i.e. (ROYGBIV)",
                  "Primary colours (Red, Blue, Green)",
                  "Secondary colours e.g. Purple, Magenta.",
                  "Producing known colours from primary colours"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides the pupils to separate white light into its components, using glass prism.",
                  "Uses the colour chart to help pupils identify various colours e.g. primary and secondary.",
                  "Provides pupils with coloured plates or discs and guide them to use it to blend the colours.",
                  "Takes pupils on a nature walk to collect materials that produce colours",
                  "Provides pupils with colour filters, coloured discs/plates",
                  "Guides pupils to produce new colours by mixing two or more colours"
                ],
                "PUPILS ACTIVITIES": [
                  "Separate white light and identify the colours of light, using glass prism.",
                  "Use memory and (ROYGBIV) to list the colours of light (Red, Orange, Yellow, Green, Blue, Indigo, Violet).",
                  "Sort coloured plates into primary and secondary colours",
                  "Collect materials that produce colours, e.g. kolanuts, acalypha leaves, bitter leaf, water leaf, clay soil etc.",
                  "Make and spin their coloured wheels to obtain different shades of colours.",
                  "Mix different dyes to obtain various colour shades."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Glass prism,",
                  "White screen or wall.",
                  "A colour chart",
                  "Coloured plates or discs",
                  "Flowers",
                  "Leaves",
                  "Clay soil",
                  "Water",
                  "Mortar and pestle",
                  "Cardboard papers",
                  "Crayons",
                  "Water colour",
                  "Colour filter",
                  "Various coloured objects",
                  "Colour poster",
                  "Colour discs"
                ],
                "EVALUATION GUIDE": [
                  "separate white light into the component colours;",
                  "identify and name the colours of light; (rainbow)",
                  "name at least two objects that have characteristics of natural colours;",
                  "collect and list at least three materials that produce colours;",
                  "sort primary and secondary colours from a collection of coloured plates;",
                  "identify characteristics of colour shades;",
                  "mix colours and identify the shades of colours produced."
                ]
              },
              {
                "TOPIC NAME": "Use of Drawing Instruments (Board practice)",
                "PERFORMANCE OBJECTIVES": [
                  "use drawing instruments;",
                  "draw circles using compasses;",
                  "draw horizontal lines using T - square;",
                  "draw vertical lines."
                ],
                "CONTENT": [
                  "Use of drawing instruments: dividers, compasses, rules, T-square, set square, drawing board, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Demonstrates the use of each instrument",
                  "Demonstrates how to place drawing sheet on the drawing board."
                ],
                "PUPILS ACTIVITIES": [
                  "Watch and practice the use of the various instruments"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Drawing instruments: T-square, set square, drawing board, compasses, dividers, masking type, ruler, protractor etc."
                ],
                "EVALUATION GUIDE": [
                  "draw a circle;",
                  "draw horizontal lines;",
                  "draw vertical lines."
                ]
              },
              {
                "TOPIC NAME": "Introduction to Woodwork Hand Tools",
                "PERFORMANCE OBJECTIVES": [
                  "Explain what hand tools are;",
                  "list three cutting tools in woodwork;",
                  "list three marking tools in woodwork;",
                  "identify measuring tools."
                ],
                "CONTENT": [
                  "Hand Tools",
                  "Measuring tools: tape rule, metal rule",
                  "Marking tools: scriber, divider, centre punch",
                  "Cutting tools: saws, planes"
                ],
                "TEACHER ACTIVITIES": [
                  "Defines hand tools",
                  "Displays the woodwork tools.",
                  "Explain the uses of tools",
                  "Shows how to handle the tools correctly."
                ],
                "PUPILS ACTIVITIES": [
                  "Handle the tools correctly.",
                  "Identify the cutting tools",
                  "Identify measuring tools",
                  "Identify marking tools"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "T-square",
                  "Tape rule",
                  "Scriber",
                  "Saws",
                  "Centre punch",
                  "Planes",
                  "Divider"
                ],
                "EVALUATION GUIDE": [
                  "Explain what hand tools are;",
                  "list at least two cutting tools in woodwork;",
                  "list at least two marking tools in woodwork;",
                  "identify at least three measuring tools."
                ]
              },
              {
                "TOPIC NAME": "Maintenance and Safety on Our Roads",
                "PERFORMANCE OBJECTIVES": [
                  "explain the meaning of maintenance;",
                  "list types of maintenance;",
                  "state the importance of maintenance;",
                  "define safety;",
                  "list some safety precautions;",
                  "state two causes of accident in the workshop and on the road;",
                  "list some safety devices."
                ],
                "CONTENT": [
                  "Meaning of Maintenance.",
                  "Types of maintenance: corrective, preventive.",
                  "Meaning of safety.",
                  "Methods of preventing accidents in the workshop and on the road.",
                  "Safety precautions."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of maintenance",
                  "Explains the types of maintenance",
                  "Defines safety",
                  "Explains safety precautions in the workshop",
                  "Explain some safety precautions to be taken on our roads",
                  "Displays safety devices and demonstrates the use: fire extinguishers, apron, boots, hand gloves, eye shield, caution signs, seat belts, road signs, zebra crossing"
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussions on safety and safety precautions.",
                  "Watch teacher's demonstration of the safety devices.",
                  "mention some dangers in the workshop and on the road"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Safety devices",
                  "apron",
                  "boots",
                  "hand gloves",
                  "eye shield",
                  "Reflective Caution triangle",
                  "Road Safety Manual."
                ],
                "EVALUATION GUIDE": [
                  "explain the meaning of maintenance;",
                  "list two types of maintenance;",
                  "state the importance of maintenance;",
                  "define safety;",
                  "list at least three safety precautions;",
                  "state two causes of accident in the workshop and on the road;",
                  "list at least four safety devices."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "YOU AND ENERGY",
            "TOPICS": [
              {
                "TOPIC NAME": "Simple Machines - Levers",
                "PERFORMANCE OBJECTIVES": [
                  "collect and identify simple machines;",
                  "identify the parts of the lever;",
                  "list common uses of levers."
                ],
                "CONTENT": [
                  "Meaning of: machine, lever.",
                  "Examples of levers.",
                  "Parts of a lever.",
                  "Use of levers."
                ],
                "TEACHER ACTIVITIES": [
                  "Collects examples of levers for pupils to identify, name and group.",
                  "Guides pupils to identify parts of lever."
                ],
                "PUPILS ACTIVITIES": [
                  "Collect and identify some simple machines.",
                  "Take turns to play with lever, e.g. the see-saw and explain how it works.",
                  "Make and use simple lever.",
                  "Draw the different types of lever and identify the parts.",
                  "List common uses of levers."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Bottle opener",
                  "Can opener",
                  "Scissors",
                  "Pliers",
                  "Chart/diagram of some common levers",
                  "Nut cracker"
                ],
                "EVALUATION GUIDE": [
                  "name five common levers and machines in their homes;",
                  "locate the Pivot, Load and Effort arms in common lever machines;",
                  "state five common uses of levers."
                ]
              },
              {
                "TOPIC NAME": "Simple Machines - Pulleys",
                "PERFORMANCE OBJECTIVES": [
                  "recognize and identify simple pulley machines;",
                  "identify and describe the different uses of pulley machines in everyday life;",
                  "distinguish between fixed and movable pulleys;",
                  "make and use pulley machines to do work."
                ],
                "CONTENT": [
                  "Types of Pulleys: fixed, movable.",
                  "Examples of pulley machines.",
                  "Common applications of pulleys."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides and helps in the collection of simple pulley machines.",
                  "Guides pupils to identify the application of pulleys.",
                  "Guides pupils to construct and use pulleys.",
                  "Takes the class on visits to places where they can observe the application of pulleys."
                ],
                "PUPILS ACTIVITIES": [
                  "Collect simple pulley machines",
                  "Identify the application of pulleys",
                  "Examine and observe pulleys at work.",
                  "Construct simple pulleys",
                  "Use pulleys to lift loads"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Strings",
                  "Metal/ wooden/plastic rollers",
                  "Nails",
                  "Wood",
                  "Charts showing uses of simple pulleys",
                  "Simple pulleys"
                ],
                "EVALUATION GUIDE": [
                  "give three examples of simple pulleys;",
                  "state two applications of pulley machines",
                  "differentiate between fixed and movable pulleys;",
                  "construct and use pulleys."
                ]
              },
              {
                "TOPIC NAME": "Inclined Plane",
                "PERFORMANCE OBJECTIVES": [
                  "mention examples of inclined plane;",
                  "construct and use inclined plane to lift loads;",
                  "state the advantages of inclined plane."
                ],
                "CONTENT": [
                  "Examples of inclined plane",
                  "Advantages of inclined plane"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to give examples of inclined plane",
                  "Arranges for pupils to visit construction sites to observe the use of inclined plane",
                  "Leads class discussions on the advantages of inclined plane."
                ],
                "PUPILS ACTIVITIES": [
                  "List examples of inclined planes.",
                  "Use planks to make inclined plane.",
                  "Observe the use of inclined plane at construction sites",
                  "Participate in the discussion of the advantages of inclined plane"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Wooden plank.",
                  "Charts showing inclined plane and staircases.",
                  "Cement blocks",
                  "Drums",
                  "Nails",
                  "Saw",
                  "Hammer"
                ],
                "EVALUATION GUIDE": [
                  "mention three examples of inclined plane;",
                  "construct and use inclined plane to move objects;",
                  "state two advantages of inclined plane."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "PHYSICAL AND HEALTH EDUCATION",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "BASIC MOVEMENT",
            "TOPICS": [
              {
                "TOPIC NAME": "Physical Fitness and Body Conditioning",
                "PERFORMANCE OBJECTIVES": [
                  "mention some components of Physical Fitness and Body conditioning e.g. agility, power, flexibility and balance;",
                  "demonstrate the execution of agility, power, flexibility and balance;",
                  "Identify activities for measuring agility, power, flexibility and balance;",
                  "measure their agility, power, flexibility and balance levels;",
                  "mention the benefits of these fitness components."
                ],
                "CONTENT": [
                  "Components of Physical Fitness and Body conditioning.",
                  "Measurement of agility (10 metres shuttle run)",
                  "Power: sergeant jump, Standing broad jump.",
                  "Flexibility: Straight knee toe touch.",
                  "balance: Beam walk.",
                  "Benefit of agility, power, flexibility and balance"
                ],
                "TEACHER ACTIVITIES": [
                  "Mentions some components of Physical Fitness and Body conditioning e.g. agility, power, flexibility and balance.",
                  "States the benefits of agility, power, flexibility and balance",
                  "Demonstrates the activities for measuring: agility, power, flexibility, balance",
                  "Demonstrates the measurement of the above physical fitness components.",
                  "Supervises pupils' activities."
                ],
                "PUPILS ACTIVITIES": [
                  "Mention some components of Physical Fitness and Body conditioning e.g. agility, power, flexibility and balance.",
                  "States the benefits of agility, power, flexibility and balance",
                  "Measure their agility, power, flexibility and balance."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts",
                  "Video Clips",
                  "Balance beams",
                  "Wall",
                  "Chalk",
                  "Measuring tape/ruler",
                  "Stopwatch",
                  "Field etc."
                ],
                "EVALUATION GUIDE": [
                  "mention any three physical fitness exercises and body conditioning;",
                  "state the benefits of agility, power, flexibility and balance;",
                  "demonstrate the physical fitness exercises used to measure agility, power etc. e.g. 10 metres shuttle jump, sergeant jump, standing broad jump etc.",
                  "measure their agility, power, flexibility and balance levels."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "GAMES AND SPORTS",
            "TOPICS": [
              {
                "TOPIC NAME": "Athletics I",
                "PERFORMANCE OBJECTIVES": [
                  "list the skills involved in Track Events such as relay races; hurdles;",
                  "perform the skills involved in Track Events such as relay races; Hurdles."
                ],
                "CONTENT": [
                  "Types of relay races: 4 x 100 meters, 4 x 400 meters, Medley relay.",
                  "Relay skills: baton grip, take off, non visual take over exchange.",
                  "Basic skills in hurdles: Starting position, approach to the 1st hurdle, clearing the hurdle, landing, strides between hurdles."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the skills involved in: a) relay races b) hurdles.",
                  "Demonstrates the skills involved in: a) relay races b) hurdles.",
                  "Supervises the pupils practice and make corrections."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teacher",
                  "Watch teacher's demonstration",
                  "Practice the skills as demonstrated by the teacher in: a) relay races b) hurdles",
                  "Pair up to practice baton exchange"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Video clips",
                  "Posters",
                  "Whistle/Starting gun",
                  "Flying board",
                  "Athletics track",
                  "Stop watches",
                  "Bell",
                  "Charts",
                  "Track",
                  "Shoes",
                  "Baton",
                  "Hurdle sticks"
                ],
                "EVALUATION GUIDE": [
                  "mention the skills in track events e.g. relay races, hurdles;",
                  "perform baton change;",
                  "mention any four skills in hurdles;",
                  "perform hurdle skills."
                ]
              },
              {
                "TOPIC NAME": "Athletics II",
                "PERFORMANCE OBJECTIVES": [
                  "explain the meaning of high jump and long jump;",
                  "demonstrate the styles and stages in high jump and long jump;",
                  "mention the rules in high jump and long jump;",
                  "Draw and label the high jump poles and long jump pitch."
                ],
                "CONTENT": [
                  "Meaning of high jump and long jump.",
                  "Basic styles in high jump: the flop, straddle, western roll, Eastern roll, scissors",
                  "Rules in high jump.",
                  "Basic styles in long jump: the sail, the hang, hitch kick, landing, recovery.",
                  "Stages in long jump: run- up, take-off, flight, landing.",
                  "Rules and regulations in long jump."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of: high jump, long jump",
                  "Demonstrates the basic skills and styles in: high jump, long jump",
                  "Supervises pupils practices",
                  "Explains the rules in long jump and high jump",
                  "Explains the dimensions in long jump"
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teachers explanations.",
                  "Practice styles on high or long jump.",
                  "draw and label the: high jump poles, long jump pitch."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Poles",
                  "Cross bar",
                  "Chalkboard",
                  "Textbooks",
                  "Whistle",
                  "Measuring tape.",
                  "The Pitch",
                  "Take off",
                  "board",
                  "Flags",
                  "Pictures",
                  "Video clips"
                ],
                "EVALUATION GUIDE": [
                  "explain high Jump",
                  "list 3 styles in high jump;",
                  "mention 4 rules of high jump;",
                  "explain the long jump;",
                  "List 3 styles in long jump;",
                  "mention 2 rules in long jump.",
                  "draw and label: high jump poles, long jump pitch."
                ]
              },
              {
                "TOPIC NAME": "Ball Games",
                "PERFORMANCE OBJECTIVES": [
                  "list the rules and regulations (including safety rules) of: football, table tennis, volley ball, basket ball, hockey, handball;",
                  "mention the key officials of these games.",
                  "play the following games observing the rules: football, table tennis, volley ball, basket ball, hockey, handball;",
                  "Draw the pitch and position of players in: football, basket ball, hockey."
                ],
                "CONTENT": [
                  "The rules and regulations of: a) Football b) Table Tennis c) Volley ball d) Basketball e) Hockey f) Handball",
                  "The key officials of: football, table tennis, volley ball, basket ball, hockey, handball",
                  "Playing the game of: football, table tennis, volley ball, basket ball, hockey, handball by observing the rules.",
                  "Positioning players in: football, basket ball, hockey"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the rules and regulations of: football, table tennis, volley ball, basket ball, hockey, handball",
                  "Describes the key officials of these games.",
                  "Demonstrates the skills of each game.",
                  "Supervises pupils as they play the games.",
                  "Draws the pitch and position of players in Football, Basketball and Hockey"
                ],
                "PUPILS ACTIVITIES": [
                  "Listen to the teacher.",
                  "Play the game of: football, table tennis, volley ball, basket ball, hockey, handball by applying the rules.",
                  "Write notes"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Football",
                  "Whistle",
                  "Textbook",
                  "Video clips",
                  "Stop watch.",
                  "Table tennis board",
                  "Table Tennis balls",
                  "Nets",
                  "Bats",
                  "Volleyball balls",
                  "Volleyball court",
                  "Basketball balls",
                  "Basketball court",
                  "Hockey sticks",
                  "Hockey balls",
                  "Hockey pitch",
                  "Handball balls",
                  "Handball court",
                  "score board"
                ],
                "EVALUATION GUIDE": [
                  "list the officials in: football, table tennis, volley ball, basket ball, hockey, handball;",
                  "state and apply the rules and regulations of: football, table tennis, volley ball, basket ball, hockey, handball;",
                  "draw the pitch and position of players in: football, basket ball, hockey."
                ]
              },
              {
                "TOPIC NAME": "Indigenous Games",
                "PERFORMANCE OBJECTIVES": [
                  "list indigenous games;",
                  "demonstrate the skills of some indigenous games;",
                  "perform some indigenous games;",
                  "perform the basic skills in indigenous games.",
                  "list safety rules in indigenous games"
                ],
                "CONTENT": [
                  "Indigenous games e.g. Dambe, Kokowa, mgba, Ayo, Langa",
                  "Skills of indigenous games.",
                  "Safety rule in indigenous games"
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the indigenous games to the pupils.",
                  "Demonstrates the various indigenous games.",
                  "Explains the skills in indigenous games.",
                  "List safety rules."
                ],
                "PUPILS ACTIVITIES": [
                  "Observe the teachers demonstrations.",
                  "Practice the skills of the indigenous games.",
                  "Play the indigenous games.",
                  "Mention safety rules."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Play ground",
                  "Balls",
                  "Costumes",
                  "Seeds",
                  "Boards",
                  "Rackets"
                ],
                "EVALUATION GUIDE": [
                  "mention indigenous games;",
                  "list the skills involved in indigenous games;",
                  "list some materials needed to play each of the listed indigenous games;",
                  "List some safety rules in each indigenous game."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "HEALTH EDUCATION",
            "TOPICS": [
              {
                "TOPIC NAME": "Personal and Environmental Health",
                "PERFORMANCE OBJECTIVES": [
                  "explain the meaning and importance of personal health;",
                  "explain the meaning and importance of environmental health;",
                  "state the importance of vision;",
                  "draw and label structure of the tooth;",
                  "list 2 dental problems and their prevention;",
                  "mention some methods and importance of waste disposal;",
                  "write on the effects of noise pollution on human beings."
                ],
                "CONTENT": [
                  "Meaning and importance of personal health.",
                  "Meaning and importance of environmental health.",
                  "Importance of vision.",
                  "Structure of the tooth.",
                  "Dental problems and prevention.",
                  "Methods and importance of waste disposal",
                  "Noise pollution."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning and importance of personal and environmental health.",
                  "Leads discussion on importance of vision.",
                  "Guide the pupils through drawing and labelling the tooth.",
                  "Guides the pupils to recall discussion on methods and importance of waste disposal.",
                  "Leads discussion on the effects of noise pollution on human beings."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in the various discussions.",
                  "Draw and label the tooth.",
                  "Listen attentively to teacher's explanation",
                  "Write notes",
                  "Ask questions",
                  "Participate in the class discussion."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Diagram of the tooth",
                  "The charts",
                  "Posters.",
                  "IEC materials",
                  "Textbooks",
                  "Flip Chart",
                  "Cartoon"
                ],
                "EVALUATION GUIDE": [
                  "explain the meaning of personal and environmental health;",
                  "state three importance each of personal and environmental health;",
                  "state two importance of vision;",
                  "draw and label the tooth.",
                  "list any two dental problems and their prevention;",
                  "describe two different methods of waste disposal;",
                  "write on one effect of noise pollution on human beings."
                ]
              },
              {
                "TOPIC NAME": "Use of Medicine",
                "PERFORMANCE OBJECTIVES": [
                  "mention the features for identifying fake medicines;",
                  "list some normal use of common drugs;",
                  "describe the effects of normal use of medicines;",
                  "discuss the effects of excessive use of medicines."
                ],
                "CONTENT": [
                  "features for identifying fake medicines.",
                  "Normal use of medicines.",
                  "Excessive use of medicines."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to identify fake medicines using the features",
                  "Guides class discussions on the normal and excessive use of medicines.",
                  "Guides class discussions on effects of normal and excessive use of drugs.",
                  "Plans simple demonstrations to show the effects of excessive use of drugs."
                ],
                "PUPILS ACTIVITIES": [
                  "Identify fake medicines using the features",
                  "Talk about the effects of normal and excessive use of medicines and give examples."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Samples of empty packets of fake and genuine common medicines e.g. paracetamol, antimalarial, etc.",
                  "Living organism eg. earth worms",
                  "salt",
                  "water",
                  "containers",
                  "Poster illustrating effects use of medicines."
                ],
                "EVALUATION GUIDE": [
                  "identify the normal dosage of common medicines like paracetamol, etc.;",
                  "state three effects of excessive use of medicines;",
                  "mention three features for identification of fake medicines.",
                  "describe the effect of normal use of medicine."
                ]
              },
              {
                "TOPIC NAME": "Effects of Drug Abuse",
                "PERFORMANCE OBJECTIVES": [
                  "list names of some common hard drugs;",
                  "identify the health effects of drugs abuse;",
                  "discuss the socio-economic effects of drug/ substance abuse;",
                  "educate others on drug abuse."
                ],
                "CONTENT": [
                  "Drugs: Heroin, Cocaine, Valium, Madrax, Indian hemp.",
                  "Drug abuse.",
                  "Effects of drug abuse on health e.g. respiratory tract infection, blood pressure, stroke, weight loss, death.",
                  "Socio-economic effects of drug abuse: poor performance in school, truancy, prostitution, financial problems, HIV infection, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides class discussions on the health and socio economic effects of drugs/ substance abuse",
                  "Tells children stories about people who abuse drugs.",
                  "Arranges for a guest talk on drug/substance abuse.",
                  "Produces drama sketches on drug."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen and learn from the stories and guest talk.",
                  "Dramatize the effects of drug abuse.",
                  "Tell some stories about victims of drug abuse.",
                  "Make posters for campaigning against drug abuse.",
                  "Educate others against drug abuse."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pictures/drawings of mad people",
                  "Posters on identification of drug abuse.",
                  "Cardboard papers",
                  "Scissors",
                  "Gum",
                  "Crayons etc."
                ],
                "EVALUATION GUIDE": [
                  "mention the names of some hard drugs;",
                  "enumerate three health problems associated with drug abuse;",
                  "explain the social and economic effects of drug/substance abuse;",
                  "display posters and use them to educate against drug abuse."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "INFORMATION TECHNOLOGY",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "BASIC COMPUTER OPERATIONS",
            "TOPICS": [
              {
                "TOPIC NAME": "Learning Word Processing With the Computer",
                "PERFORMANCE OBJECTIVES": [
                  "identify Word processing Software;",
                  "mention some of the uses of Word Processing software;",
                  "identify and use the Title Bar, Menu Bar and Tool Bars;",
                  "create and edit documents;",
                  "save and retrieve documents."
                ],
                "CONTENT": [
                  "Word Processing Software: Microsoft Office Word",
                  "Uses of the Word Processing Software",
                  "Word Processing Environment: Title Bar, Tool Bars and their uses, Menu bar and its uses",
                  "Word Processing Skills; e.g. opening the Microsoft Office, quitting the software, creating documents, editing documents, saving documents, retrieving documents."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains what Word Processing software is.",
                  "Mentions some uses of the Word Processing software",
                  "Minimizes and restores document to demonstrate Title and Menu Bar options.",
                  "Guides class by typing and moving within the documents to demonstrate creating and editing of documents.",
                  "Types and moves within the document to demonstrate: saving of documents, retrieving of documents."
                ],
                "PUPILS ACTIVITIES": [
                  "Listen and learn what Word Processing software is and what it is used for.",
                  "Observe the teacher and learn to use the Title and Menu Bars.",
                  "Type and move within the document to demonstrate creating and editing of documents",
                  "Type and move within the document to: save documents, retrieve documents."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A functional computer system."
                ],
                "EVALUATION GUIDE": [
                  "identify Word processing Software;",
                  "mention at least three uses of Word Processing software;",
                  "identify and use the Title Bar, Menu Bar and Tool Bars;",
                  "create and edit documents;",
                  "save and retrieve documents."
                ]
              },
              {
                "TOPIC NAME": "Drawing with the Computer",
                "PERFORMANCE OBJECTIVES": [
                  "identify computer drawing packages.",
                  "draw geometrical figures(lines, ellipses and rectangles);",
                  "do freehand drawing of objects and figures;",
                  "use the 'fill' tool to colour objects and figures;",
                  "use the alphabet tool to label drawings;",
                  "print a drawing."
                ],
                "CONTENT": [
                  "Drawing Packages (Corel Draw, Paint Artist etc.)",
                  "Drawing with Paint Artist: Geometrical drawings, Freehand drawings",
                  "Painting objects (using the Fill tool)."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides class to identify drawing packages in the system.",
                  "Guides pupils to: explore the paint environment and identify its components, draw objects and figures using Paint Artist, use the fill tool and alphabet tool to colour and label their drawings, print their drawings",
                  "Writes down the procedure of drawing with Paint Artist on the chalkboard."
                ],
                "PUPILS ACTIVITIES": [
                  "Working in small groups: Identify the drawing packages in the system.",
                  "Open the drawing packages in the system.",
                  "Draw lines, ellipses and rectangles.",
                  "Draw objects like boxes, fish, tins, cow, fan, cars etc using freehand.",
                  "Use the fill tool to colour their objects.",
                  "label their drawings using the alphabet tool.",
                  "Print their drawings."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "common objects or pictures/drawings of common objects like boxes, fish, tins, cow, fan, cars etc",
                  "A functional computer system with Paint Artist software (or Corel Draw) installed.",
                  "Papers",
                  "Printer."
                ],
                "EVALUATION GUIDE": [
                  "mention one computer drawing package.",
                  "draw geometrical figures(lines, ellipses and rectangles);",
                  "do freehand drawing of objects and figures;",
                  "use the 'fill' tool to colour objects and figures;",
                  "use the alphabet tool to label drawings;",
                  "print a drawing."
                ]
              },
              {
                "TOPIC NAME": "Precautions in the Use of Computers",
                "PERFORMANCE OBJECTIVES": [
                  "identify some precautions that should be taken in the use of the computer;",
                  "enumerate some precautions that should be taken by computer users;",
                  "state reasons why we should take care of human ware (users of the computer)."
                ],
                "CONTENT": [
                  "Precautions in the use the computer hardware. e.g. use of Uninterruptible Power Supply (UPS), stabilizers and surge protectors; not overloading the sockets etc.",
                  "Care for the Human ware: sitting posture, use of anti-glare, positioning of the monitor, positioning of the hands, keeping dust and moisture away.",
                  "Why we should care for the users: to reduce fatigue, to avoid minor and serious injuries, to improve efficiency, to protect sensitive organs like the eyes"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides class discussion on: precautions in the use the computer hardware, care for the Human ware",
                  "Demonstrates correct arrangement of hardware e.g. monitor, UPS, sockets and stabilizers",
                  "Demonstrates correct postures and sitting arrangements that are safe and that promote comfort and efficiency."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion.",
                  "Observe the demonstrations and ask questions as well as answer.",
                  "Practice correct arrangement of hardware e.g. monitor, UPS, sockets and stabilizers.",
                  "Practice correct postures and sitting arrangements that are safe and that promote comfort and efficiency."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Chairs",
                  "Tables.",
                  "A functional computer system.",
                  "UPS",
                  "Extension socket",
                  "Surge Protector",
                  "Printer.",
                  "Stabilizer."
                ],
                "EVALUATION GUIDE": [
                  "identify at least three precautions that should be taken in the use of the computer;",
                  "enumerate at least four precautions that should be taken by computer users;",
                  "state at least three reasons why we should take care of human ware (users of the computer)."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "BASIC CONCEPTS OF INFORMATION TECHNOLOGY",
            "TOPICS": [
              {
                "TOPIC NAME": "Classification Uses Common IT Gadgets",
                "PERFORMANCE OBJECTIVES": [
                  "classify common IT gargets;",
                  "state the uses of some common IT gargets;",
                  "operate at least two common IT gargets."
                ],
                "CONTENT": [
                  "Classification of common IT gadgets: Computers:-laptops, handheld computers, Palmtop, ipad, itab; Audio/Video gadgets:- ipod, Home theatre, mp3, mp4, digital cameras, handy cams/ camcorders; Storage Devices:- flash drives, memory cards,