{
  "PRIMARY 4": {
    "THEMES": [
      {
        "THEME NAME": "AGRICULTURE",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "INTRODUCTION AND MEDIUM OF AGRICULTURAL PRODUCTION",
            "TOPICS": [
              {
                "TOPIC NAME": "Meaning of Agriculture",
                "PERFORMANCE OBJECTIVES": [
                  "define agriculture.",
                  "list the importance of agriculture in Nigeria.",
                  "identify people involved in agricultural activities."
                ],
                "CONTENT": [
                  "Meaning of Agriculture: - growing of crops like corn, rice, guinea corn, cassava - rearing of animals like chicken, pig, goat, cattle - processing and selling of agricultural products",
                  "Importance of agriculture: - as source of food - Income generation - as job or employment - for producing industrial raw materials - for cloth making, - medicines etc.",
                  "People in agriculture: - animal rearers - crop farmers - fishermen - market people - gardeners - agriculture teachers.",
                  "Displays live samples in class."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of agriculture.",
                  "Guides the pupils to mention activities that can build up the definition in a broad sense.",
                  "Guides pupils to mention the importance of agriculture in Nigeria. Explain briefly each of the importance named.",
                  "Asks pupils to name different activities that people engaged in agriculture do.",
                  "Explains the role performed by each group of people named.",
                  "Give a board summary."
                ],
                "PUPILS ACTIVITIES": [
                  "Pupils suggest definition of agriculture.",
                  "Mention what they know as the importance of agriculture to the community.",
                  "List the different activities that people engaged in agriculture do in their localities.",
                  "identify the various crops displayed",
                  "Copy board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Pictorial display of people planting crop, rearing animals, processing agricultural products, selling agricultural products.",
                  "Simple chart or pictures showing the importance of Agriculture in Nigeria.",
                  "Live samples of some crops produce."
                ],
                "EVALUATION GUIDE": [
                  "define Agriculture.",
                  "mention four importance of agriculture in Nigeria.",
                  "mention five groups of people involved in agriculture."
                ]
              },
              {
                "TOPIC NAME": "Soil Types and Enrichment",
                "PERFORMANCE OBJECTIVES": [
                  "define soil",
                  "list soil types.",
                  "mention the causes of soil fertility reduction",
                  "describe ways of enriching soil fertility.",
                  "maintain the soil fertility of the school farm."
                ],
                "CONTENT": [
                  "Meaning of soil",
                  "Soil classification day, Sandy and loamy.",
                  "Causes of soil fertility reduction: - burning - leaching - overgrazing - clean clearing - erosion, etc.",
                  "Ways of making the soil fertile: - adding fertilizer - manuring - mulching - crop rotation - leaving fallow."
                ],
                "TEACHER ACTIVITIES": [
                  "Collects soil samples to show their characteristics",
                  "Performs simple soil experiments to show their properties.",
                  "Guides soil fertility discussions",
                  "Collects samples of fertile soil (loam) and non-fertile soil (sand) in separate pots.",
                  "Plants maize in the pots to illustrate effect of soil fertility level on the plants.",
                  "Give a board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Observe and identify soil types.",
                  "Collect different soil types and note their differences.",
                  "Participate in class discussions.",
                  "Participate in carrying out the experiments set up by the teacher.",
                  "Copy board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Soil samples: - sandy, clayey & loamy",
                  "Funnel",
                  "Water",
                  "Measuring glass",
                  "Filter paper",
                  "Cotton wool",
                  "Pots",
                  "Maize grains"
                ],
                "EVALUATION GUIDE": [
                  "define soil.",
                  "identify soil types.",
                  "state the best soil for growing crops.",
                  "explain what makes the soil to loose its fertility.",
                  "describe various methods involved in enriching the soil."
                ]
              },
              {
                "TOPIC NAME": "Agricultural Tools and Equipment",
                "PERFORMANCE OBJECTIVES": [
                  "name farm tools.",
                  "identify and describe the tools and their uses.",
                  "maintain the tools after use."
                ],
                "CONTENT": [
                  "Farm tools: - Cutting tools e.g. cutlass, sickle, axe, etc. - Digging tools e.g. hoe, pick axe, spade, etc. - Carrying tools e.g. basket, head pan, wheel barrow, etc. - Gathering tools e.g. rake.",
                  "Animal farm tools: - fishing nets, traps, hook and line, baskets, watering troughs, feeding troughs, etc.",
                  "Maintenance and care of the tools: - store in a cool dry place - wash/clean and dry - rub oil on metal ends to avoid rusting - sharpening blunt edges, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Displays the tools in class.",
                  "Helps pupils to identify farm tools and their uses.",
                  "Demonstrates the use of farm tools.",
                  "Demonstrates proper maintenance of farm tools.",
                  "Give a board summary."
                ],
                "PUPILS ACTIVITIES": [
                  "Identify and narrate the uses of farm tools.",
                  "Use some farm tools on the school farm.",
                  "Carry out proper maintenance of tools after use.",
                  "Copy board summary."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Different farm tools e.g. hoe, cutlass, spade, shovel, rake, pick axe, wheelbarrow, fishing nets, hook and line, baskets, watering troughs, feeding troughs, etc.",
                  "Poster, charts and pictures of farm tools"
                ],
                "EVALUATION GUIDE": [
                  "list 4 farm tools.",
                  "state the uses of hoe, hand trowel, rake, matchet, on the farm, fishing net, hook and line.",
                  "mention the uses of wheel barrow, watering can, head pan in the farm.",
                  "maintain farm tools."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "HOME ECONOMICS",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "INTRODUCTION TO HOME ECONOMICS",
            "TOPICS": [
              {
                "TOPIC NAME": "Meaning, Scope and Importance of Home Economics",
                "PERFORMANCE OBJECTIVES": [
                  "define and explain the meaning of Home Economics",
                  "enumerate the different areas of Home Economics",
                  "list various careers in Home Economics",
                  "outline the importance of Home Economics to the society."
                ],
                "CONTENT": [
                  "Meaning of Home Economics.",
                  "Scope (Areas) of Home Economics.",
                  "Careers in Home Economics.",
                  "Importance of Home Economics to the society."
                ],
                "TEACHER ACTIVITIES": [
                  "Defines and explains the meaning of Home Economics.",
                  "Enumerates the scope of Home Economics",
                  "Lists the careers in Home Economics",
                  "Explains the importance of Home Economics to the society",
                  "Gives a board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussion.",
                  "Ask and answer questions.",
                  "Give examples of people in Home Economics careers",
                  "Copy the board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Chart showing the scope and careers in Home Economics.",
                  "Chart and pictures illustrating careers in Home Economics, etc."
                ],
                "EVALUATION GUIDE": [
                  "define and explain the meaning of Home Economics;",
                  "list three areas of Home Economics;",
                  "mention five careers in Home Economics;",
                  "explain five reasons for the importance of Home Economics to the society"
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "HOME MANAGEMENT",
            "TOPICS": [
              {
                "TOPIC NAME": "Personal Grooming and Use of Basic Cosmetics",
                "PERFORMANCE OBJECTIVES": [
                  "identify parts of the human body;",
                  "state functions of the parts of human body.",
                  "enumerate the traditional and modern materials used for taking care of the body and their uses.",
                  "demonstrate how to take care of the body.",
                  "use basic and safe cosmetics correctly"
                ],
                "CONTENT": [
                  "Parts of the human body: i. head: hair, eyes, nose, mouth, teeth, ear, neck, nose. ii. trunk: chest, arm, belly, pubic region. iii. Limb: legs: legs, hands, with nails.",
                  "Functions of each part",
                  "Classify materials used for the care of the body, stating their uses.",
                  "Reasons for daily care of the body",
                  "Care for each part of the body.",
                  "Correct use of basic and safe cosmetics.",
                  "Adverse effects of some chemicals used in cosmetics."
                ],
                "TEACHER ACTIVITIES": [
                  "Displays a properly labelled chart of parts of the body.",
                  "Discusses reasons for taking care of the body;",
                  "Brings all materials for taking care of the body to show pupils",
                  "Displays different materials for taking care of the body on table including traditional ones e.g. cam-wood or “uhie” (Igbo) or “osun” (Yoruba), antimony or Otajele (Igbo) or Tiroo (Yoruba) “laali” (Yoruba) “lalle” (Hausa).",
                  "Displays other cosmetics e.g. oils, creams, pomades, powder, nail/polish, body spray, perfume, lipsticks, eye pencil.",
                  "Classify cosmetics into safe and dangerous cosmetics",
                  "Explains directions on labels",
                  "Demonstrates the correct use of each cosmetic on the body.",
                  "Gives board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Touch different parts of their own body;",
                  "Display their finger, toe, nails for inspection;",
                  "Observe clean nails, clean clothing.",
                  "Differentiate between traditional and modern materials for the care of the body.",
                  "Identify information on containers of cosmetics e.g. use, expiry date, making list of ingredients. Bring empty containers of cosmetics containing labels",
                  "Copy the board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "A labelled diagram of the body.",
                  "Soap, towel, sponge, water, tooth paste and brush, chewing stick, etc",
                  "Traditional and modern cosmetics;",
                  "Baby doll;",
                  "Labelled chart of safe and harsh or dangerous cosmetics."
                ],
                "EVALUATION GUIDE": [
                  "identify different parts of the body and their uses",
                  "state how to wash their body;",
                  "name materials for cleaning the body;",
                  "identify clean pupils;",
                  "identify different basic and safe cosmetics for good grooming.",
                  "use baby doll to demonstrate the care of different body parts.",
                  "mention one side effect of harsh cosmetics"
                ]
              },
              {
                "TOPIC NAME": "Types and Care of Personal Clothing",
                "PERFORMANCE OBJECTIVES": [
                  "identify types of personal clothing;",
                  "mention reasons for wearing clothes and footwears;",
                  "state the reasons for caring for clothing",
                  "mention the steps in care of clothing",
                  "demonstrate how to care for shoes/bags e.g polishing",
                  "launder personal cloth."
                ],
                "CONTENT": [
                  "Types of personal clothing: shirts, blouses, skirts, pants, trousers, vests, scarves, wrappers, pyjamas, nightgown, footwears, caps etc.",
                  "Reasons for wearing clothing: i. protection ii. beauty iii. identification/status iv. for special occasions e.g. party",
                  "Laundry agents, tools and equipment: i. agent eg water, soap/detergents ii. tools eg basin, bath iii. equipment eg Iron washing machine",
                  "Steps in care of clothes i. washing ii. ironing iii. airing iv. storing"
                ],
                "TEACHER ACTIVITIES": [
                  "Displays a variety of personal clothing/ items.",
                  "Produces a chart of variety of personal clothing articles.",
                  "Discusses the reasons for wearing clothes, and care of clothing articles",
                  "Provides pictures of people of various professions in uniforms e.g. i. nurses ii. police iii. fire service etc.",
                  "Demonstrates steps for caring of personal clothing",
                  "Gives board a summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Identify and name different kinds of clothing",
                  "Practice how to hang and store their clothes and reasons for wearing clothes",
                  "Identify different people from the pictures according to their type of clothing.",
                  "State the materials needed for taking care of clothes.",
                  "Demonstrate how to launder clothes.",
                  "Copy the board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Different articles of clothing",
                  "Laundry agents e.g soap, water, detergent, etc.",
                  "Laundry tools and equipment e.g. irons, line/rope for hanging clothes to dry, basin, pegs"
                ],
                "EVALUATION GUIDE": [
                  "state three reasons for caring for clothes;",
                  "mention three materials for laundering clothes;",
                  "explain steps in laundering of clothes",
                  "launder a personal clothing"
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "FOOD AND NUTRITION",
            "TOPICS": [
              {
                "TOPIC NAME": "Food: Classification and Functions of Food",
                "PERFORMANCE OBJECTIVES": [
                  "define food.",
                  "state reasons for eating food",
                  "list the six classes of food and their uses",
                  "mention classes of food nutrient",
                  "explain the functions of each food nutrient",
                  "mention deficiency diseases of nutrients"
                ],
                "CONTENT": [
                  "Meaning of food",
                  "Classification of foods and their sources",
                  "Classes of food nutrients and their functions",
                  "Explain an adequate diet",
                  "Deficiency diseases of each nutrient"
                ],
                "TEACHER ACTIVITIES": [
                  "Defines food and states reasons for eating of food",
                  "Discusses the types of food nutrients, sources and their functions with the pupils.",
                  "Provides real food items and chart of the classes of food based on their nutrients.",
                  "Displays charts and discusses deficiency diseases of nutrients.",
                  "Gives a board summary."
                ],
                "PUPILS ACTIVITIES": [
                  "Define food",
                  "Observe the chart on display.",
                  "Classify the real food items on display",
                  "Copy the board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts on food groups",
                  "Real food items",
                  "Charts on food nutrients, sources and functions",
                  "Pictures of people affected with deficiency of nutrients e.g. marasmus."
                ],
                "EVALUATION GUIDE": [
                  "define food.",
                  "explain five reasons for eating food",
                  "list the six classes of food and one source each.",
                  "state one function of each food nutrient.",
                  "mention two deficiency diseases associated with food."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  "PRIMARY 5": {
    "THEMES": [
      {
        "THEME NAME": "AGRICULTURE",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "PROCESSES OF AGRICULTURAL PRODUCTION",
            "TOPICS": [
              {
                "TOPIC NAME": "How to Grow Crops",
                "PERFORMANCE OBJECTIVES": [
                  "give examples of crops.",
                  "narrate and demonstrate the processes involved in raising crops.",
                  "raise seedlings of some vegetables and flowers in the nursery.",
                  "transplant seedlings from nursery to the field.",
                  "identify safety signs, labels and symbols on agricultural inputs"
                ],
                "CONTENT": [
                  "Examples of crops: cereals, legumes, tubers.",
                  "Procedure for raising farm crops: a). Pre-planting activities: - land clearing and stumping, - preparing nursery beds and sowing. - selection and transplanting seedlings, - planting locally grown crops on ridges and beds in the school farm. b). Post planting activities: - watering, mulching, thinning and supplying, - application of fertilizer/manure. - weeding, - staking (where applicable), - application of pesticides, -harvesting of mature crops.",
                  "Post-Harvesting Activities: - processing/ preservation, - storage, - marketing.",
                  "Safety signs, symbols, labels e.g.: - skull and crossbones - chemical warning labels - treated seeds - veterinary drugs - implements, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to raise either a cereal or legume or tuber crops during the growing season.",
                  "Supplies appropriate tools and planting materials.",
                  "Takes pupils to the school farm and maps out the area to use for the year.",
                  "Allows pupils to prepare land themselves.",
                  "Guides pupils in identifying and explaining safety signs, labels and symbols on agricultural inputs before and during planting, harvesting activities, including safe handling of treated seeds, veterinary drugs, implements, etc.",
                  "Give a board summary."
                ],
                "PUPILS ACTIVITIES": [
                  "Bring the required farm tools from home.",
                  "Prepare the land for planting.",
                  "Plant seeds in the nursery and transplant to the field.",
                  "Care for the farm themselves.",
                  "Carry out planting activities as directed by the teacher.",
                  "Pupils keep farm records",
                  "Copy board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "School farm.",
                  "Farm tools. e.g. tape, machetes, hoes, spades, pegs, digging fork, hand trowel, knapsack sprayer, etc",
                  "Planting materials and inputs. such as. seeds of vegetables e.g. pepper, okra garden egg, onions, fluted pumpkin, tomato, rice, maize, millet, guinea corn, potato & yam sets, cassava cuttings.",
                  "Fertilizer/ manure pesticides.",
                  "charts of safety signs and symbols.",
                  "samples of labels."
                ],
                "EVALUATION GUIDE": [
                  "list three crops grown in your area.",
                  "state the various activities involved in growing a named field crop.",
                  "grow any field crop from land clearing to marketing.",
                  "demonstrate how to transplant seedlings.",
                  "care and maintain the school farm.",
                  "harvest crops when mature.",
                  "keep records of farm activities performed",
                  "Explain 2 safety signs or symbols on agricultural inputs.",
                  "Bring 2 labels on agricultural inputs."
                ]
              },
              {
                "TOPIC NAME": "Control of Crop Weeds, Pests and Diseases",
                "PERFORMANCE OBJECTIVES": [
                  "define weeds and name some common local weeds.",
                  "state the problem of weeds to farmers.",
                  "control weeds in the farm.",
                  "define and identify common pests on our farm.",
                  "describe the damages caused by pests.",
                  "state ways of controlling pests.",
                  "list the causes of plant diseases.",
                  "state how the diseases can be controlled.",
                  "state the effects of eating contaminated food."
                ],
                "CONTENT": [
                  "Definition and identification of weeds.",
                  "Problems of weeds to farmers.",
                  "Control measures: - biological - cultural - chemical",
                  "Pests: a) Meaning, and Identification b) Identification of insects pests, - Beetle/weevil, - Grasshopper/locust, - Caterpillar, - Termite. c). Other pests on: - rodents, - quela birds, - bats, - monkeys.",
                  "Damages caused by pests: - eat crop leaves & - roots - destroy grains, - damaging stalk, fruits and roots of crops - Contaminating stored produce.",
                  "Methods of control: - Spraying chemicals to kill them. - Storing farm produce properly - Clearing surrounding bushes - shooting, trapping - scare-crow - baiting - proper storage",
                  "Causal agents of crop diseases: - fungi, bacteria, viruses, - nematodes.",
                  "Control measures - keeping farm free of weeds - planting healthy seeds, seedlings and cuttings",
                  "Effects of eating contaminated food: - poisoning - Sickness - Purging - Vomiting - Stomach disorder - death"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides pupils to define and identify common weeds on the environment.",
                  "Discusses problems created by weeds on farms.",
                  "Discusses control measures and their side effects.",
                  "Displays and identifies samples of: - fresh or preserved pest. - partly eaten/damaged vegetable leaves - Weevilled maize, beans guinea corn.",
                  "Displays charts and posters of rodents, birds, squirrels, grass-cutters, rats.",
                  "Discusses how to prevent or avoid eating contaminated food.",
                  "Guides pupils to identify some of the common pests.",
                  "Helps the pupils to identify crop materials that are contaminated.",
                  "Give a board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Make a weed album",
                  "Observe and identity pests",
                  "Observe and describe the damages done to crops by pests.",
                  "Participate in collection of common pests.",
                  "Find out more about possible side effects of eating contaminated produce."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Samples of weeds common in the locality.",
                  "Charts and pictures showing control measures.",
                  "Fresh or preserved specimens of pests.",
                  "Specimen of maize, bean, guinea corn seeds infested by weevil, beetle or termite.",
                  "Chart showing local farm pests.",
                  "Insect-killing chemicals with warnings of poison clearly written.",
                  "Chart showing storage facilities.",
                  "Charts and posters of squirrels, rats, grass cutter, birds, crabs, etc.",
                  "Specimen of catapult, trap, plastic container, air tight cover."
                ],
                "EVALUATION GUIDE": [
                  "State the meaning of weeds.",
                  "name three common weeds in the locality.",
                  "list two problems of weeds to farmers.",
                  "mention three control measures.",
                  "state the meaning of farm pests.",
                  "name five pests in the locality.",
                  "identify two damages caused by pests.",
                  "list three control measures of pests.",
                  "list three causal agents of crop diseases.",
                  "describe two methods of controlling diseases of crops.",
                  "state two effects of contaminated crop materials on health."
                ]
              },
              {
                "TOPIC NAME": "Rearing of Farm Animal",
                "PERFORMANCE OBJECTIVES": [
                  "state the needs of young animals for healthy growth.",
                  "mention steps involved in raising livestock.",
                  "describe how to raise a named farm animal.",
                  "identify and select appropriate housing and equipment for rearing: - Rabbits - guinea pigs - chicken",
                  "feed the livestock with the appropriate rations.",
                  "produce hutches, cages, brooder boxes for livestock.",
                  "keep the house/cages clean and keep proper farm records.",
                  "identify common pests and parasites of farm animals.",
                  "state the symptoms of ill-health in farm animals.",
                  "name some common diseases and remedy.",
                  "State the effects of consuming infected animals."
                ],
                "CONTENT": [
                  "Needs of growing farm animals: - balanced ration - clean water - adequate - medication - clean environment.",
                  "Procedures for rearing farm animals: - construct a house or - provide shelter - provide necessary rearing equipment - buy the young animal to rear. - provide feed and - water daily - provide medications when necessary - clean the house regularly - routine check by veterinary personnel - removal of sick or dead animals. - sell or slaughter when matured.",
                  "Rearing of named animals - Rabbit rearing. - Rearing of guinea pig. - identical management practice with Rabbit except that guinea pigs are reared in cages or deep litter. - Rearing of chicken",
                  "Meaning of pests and parasites.",
                  "Common pests and parasites of farm animals: - Lice, - housefly, - worms, - ticks, - tsetse fly etc.",
                  "Common diseases of farm animals: - ring worm, - scabies, - sleeping sickness, - pneumonia, - tuberculosis, - new castle disease, - foot and mouth, diseases etc.",
                  "The diseases, symptoms and remedy.",
                  "Effects of consuming infected animal: - transfer of animal diseases to human, etc."
                ],
                "TEACHER ACTIVITIES": [
                  "Discusses the needs of animals for healthy growth.",
                  "Guides the Pupils to rear any livestock and apply all the necessary skills.",
                  "Assists Pupils to select quality young animals e.g. young rabbit/young guinea pig, chicks for rearing.",
                  "Guides pupils to construct hutches.",
                  "Encourages Pupils to practice good sanitation and keep proper farm records.",
                  "Guides Pupils to identify sick animals, isolate them and invite a veterinary Doctor",
                  "Discusses these pests and guide the Pupils to collect some common pests and parasites.",
                  "Highlights animal diseases that are contagious and the danger of eating infected animal meat, milk, egg, etc.",
                  "Guides discussion on how to control animal pests, parasite and diseases.",
                  "Give a board summary."
                ],
                "PUPILS ACTIVITIES": [
                  "Care for young animals by feeding, cleaning, providing water, beddings, etc.",
                  "Working in groups to care for the animals and apply necessary skills and procedures.",
                  "Observe and note the qualities of a healthy animal.",
                  "Collect different feed stuffs and feed the animal.",
                  "Clean the livestock area.",
                  "Keep records of daily activities.",
                  "Collect materials to construct hutches and cages.",
                  "Identify sick animals, isolate them and call a veterinary doctor.",
                  "Sell, cull, matured or sick animals.",
                  "Collect common pests and parasites and identify them.",
                  "Discuss the dangers of consuming infected animal products e.g. meat, milk, egg, etc."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "School farm.",
                  "Balanced ration feed",
                  "Water",
                  "Medications",
                  "Animals to rear.",
                  "Shelter, etc.",
                  "Samples of pests/parasite",
                  "Posters of sick animals.",
                  "Chalkboard or white board"
                ],
                "EVALUATION GUIDE": [
                  "list four necessary management practices required in rearing animals.",
                  "describe how to raise an animal farm to maturity.",
                  "construct good hutches and cages.",
                  "keep proper farm records.",
                  "identify two features of sick animal.",
                  "list three ways of controlling pests and diseases of farm animals.",
                  "narrate the effects of consuming infested animal products."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  "PRIMARY 6": {
    "THEMES": [
      {
        "THEME NAME": "AGRICULTURE",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "PRODUCE PACKAGING, MARKETING AND FARM RECORDS",
            "TOPICS": [
              {
                "TOPIC NAME": "Preservation of Farm Produce",
                "PERFORMANCE OBJECTIVES": [
                  "state what farm produce preservation means.",
                  "give reasons why farm produce should be preserved.",
                  "state methods of farm produce preservation."
                ],
                "CONTENT": [
                  "Meaning of farm produce preservation.",
                  "Reasons for preservation of farm produce: - retain freshness, - reduce loss, - prolong shelf life, - prevent possible contamination and infection from unpreserved food items",
                  "Methods of farms produce preservation: - sun-drying, - smoking, - salting, - frying, - refrigeration, - canning, - bagging, - bottling etc"
                ],
                "TEACHER ACTIVITIES": [
                  "Provides beans and maize grains with holes and discuss why they have holes.",
                  "Guides Pupils to separate fresh from decaying spoilt food items (mouldy and decaying).",
                  "Guides Pupils to preserve food items using familiar method.",
                  "Ask Pupils to make a list of foods processed and preserved by members of the family.",
                  "Give a board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Observe and identify weeviled maize or beans.",
                  "Discuss reasons for preserving food items.",
                  "Observe procedure and do group practices of different preservation methods.",
                  "Make a list of foods processed and preserved by family members.",
                  "Copy board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Weeviled unpreserved crops.",
                  "Preserved/ fresh grains.",
                  "Frozen meat or fish.",
                  "Bottled drink.",
                  "Canned meat, fish, milk etc.",
                  "Food items for preservation: - meat, fish, grains, cassava, yams, etc.",
                  "Posters or charts showing the different methods of food preservation e.g. people frying/ smoking/ drying fish"
                ],
                "EVALUATION GUIDE": [
                  "define and explain food preservation.",
                  "state four reasons for preserving farms produce items.",
                  "list five methods of farm produce preservation."
                ]
              },
              {
                "TOPIC NAME": "Packaging Methods",
                "PERFORMANCE OBJECTIVES": [
                  "give reasons why farm produce are packaged",
                  "identify packaging materials"
                ],
                "CONTENT": [
                  "Why package farm produce?: - to make produce appealing to buyers, - for ease of transportation, - for proper identification",
                  "Packaging items: - cans, - cellophane wrappers, - cardboard boxes, - baskets, - cages."
                ],
                "TEACHER ACTIVITIES": [
                  "Produce some agricultural packaging for local farm produce",
                  "Explains reasons for packaging.",
                  "Provides packaging items.",
                  "Give a board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Partake in the production of packaging items for fruits and vegetables, eggs, poultry chick",
                  "Copy board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "canned food",
                  "Sun-dried foods",
                  "smoked produce",
                  "fried food etc.",
                  "local packaging materials."
                ],
                "EVALUATION GUIDE": [
                  "give 3 reasons for packaging produce",
                  "list 5 packaging items used in agriculture"
                ]
              },
              {
                "TOPIC NAME": "Marketing and Farm Records",
                "PERFORMANCE OBJECTIVES": [
                  "define marketing",
                  "explain marketing activities in agriculture",
                  "state the types of agricultural markets.",
                  "define farm records",
                  "list farm records.",
                  "state the uses of farm records.",
                  "keep good farm records."
                ],
                "CONTENT": [
                  "Definition of market and marketing",
                  "Agricultural marketing activities",
                  "Types of markets for agricultural produce",
                  "Meaning of farm record.",
                  "Types of farm records: - farm diary - cash record - production record",
                  "Uses of farm record - to know items in the farm. - quantity of farm produce realized - amount of money realized from sales",
                  "Record Keeping: - daily diary of events on the farm."
                ],
                "TEACHER ACTIVITIES": [
                  "Guides classroom discussion.",
                  "Guides pupils to write proper and correct records of activities in their note books(diary)",
                  "Give a board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Classroom discussion",
                  "Record all activities in the farm diary",
                  "Copy board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Real agricultural product in the localities.",
                  "Charts of agricultural products.",
                  "Charts of simple farm records"
                ],
                "EVALUATION GUIDE": [
                  "state what is meant by a market",
                  "give simple explanation of marketing.",
                  "list three agricultural marketing activities.",
                  "mention four types of agricultural markets.",
                  "define farm records.",
                  "list three types of record that can be kept in the farm.",
                  "state four uses of farm records.",
                  "record the activities carried out on the school farm."
                ]
              }
            ]
          }
        ]
      },
      {
        "THEME NAME": "HOME ECONOMICS",
        "SUB THEMES": [
          {
            "SUB THEME NAME": "FAMILY LIVING AND RESOURCE MANAGEMENT",
            "TOPICS": [
              {
                "TOPIC NAME": "Healthy Home Environment",
                "PERFORMANCE OBJECTIVES": [
                  "state reasons for cleaning their homes, classroom and home and school environment",
                  "list tools and agents for cleaning the home and its surroundings",
                  "state guidelines for cleaning the home and its surroundings",
                  "describe processes for cleaning the home and surroundings",
                  "clean their rooms/classroom."
                ],
                "CONTENT": [
                  "Reasons for cleaning the home, classroom and environment",
                  "Tools and agents for cleaning the home",
                  "Guidelines for cleaning the home and its surroundings",
                  "Processes for cleaning the home eg-dusting, sweeping, washing, scrubbing, etc.",
                  "Application of processes"
                ],
                "TEACHER ACTIVITIES": [
                  "Guides discussion on reasons, cleaning tools, and agents, guidelines and processes for cleaning the home, classroom and surroundings.",
                  "Demonstrates the cleaning processes.",
                  "Gives a board summary."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in discussion.",
                  "Bring cleaning materials",
                  "Practice cleaning of room/classroom and environment",
                  "Copy the board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Tool and agents for cleaning different parts of a room: e.g. broom, water, buckets, mop, brushes, detergents, towels, dust bin, etc."
                ],
                "EVALUATION GUIDE": [
                  "mention three reasons for cleaning the home and surrounding",
                  "list five tools for cleaning the home.",
                  "state three guidelines for cleaning a room.",
                  "clean the classroom/toilet"
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "CLOTHING AND TEXTILE",
            "TOPICS": [
              {
                "TOPIC NAME": "Stitches: Types and Uses",
                "PERFORMANCE OBJECTIVES": [
                  "define stitches",
                  "classify types of stitch",
                  "state the general uses of stitches",
                  "describe the steps in making both temporary, permanent and decorative stitches",
                  "produce articles using the different types of stitch."
                ],
                "CONTENT": [
                  "Meaning of stitches.",
                  "Types of stitch and their uses, e.g. temporary, permanent and decorative stitches.",
                  "Guidelines of making different types of stitch.",
                  "Production of articles with different types of decorative stitches."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains the meaning of stitches",
                  "Lists the different classes of stitch.",
                  "Demonstrates the process of making temporary, permanent and decorative stitches.",
                  "Use different types of stitch in producing food cover, pillow slips/cases, head band.",
                  "Give a board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussions.",
                  "Practice the making of temporary, permanent and decorative stitches.",
                  "Produce articles using different stitches.",
                  "Copy the board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Charts showing stages of making stitches",
                  "Pieces of fabrics for making stitches",
                  "Sewing tools e.g. needles, pins, tapes",
                  "An album showing stages of making temporary, permanent and decorative stitches."
                ],
                "EVALUATION GUIDE": [
                  "define stitches",
                  "identify the classes and types of stitch",
                  "state three uses of stitches;",
                  "describe the steps in making stitches",
                  "make specimens of temporary, permanent and decorative stitches."
                ]
              },
              {
                "TOPIC NAME": "Clothing Construction Process",
                "PERFORMANCE OBJECTIVES": [
                  "define seam and mention types of seam.",
                  "state uses of seam",
                  "describe the steps for making seams",
                  "produce an album showing stages of making seams"
                ],
                "CONTENT": [
                  "Meaning of seam;",
                  "Types of seam e.g. - plain/open seam; - run and fell seam; - french seam;",
                  "Uses of seams;",
                  "Steps in making the different seams;",
                  "Making seams on brown paper"
                ],
                "TEACHER ACTIVITIES": [
                  "Defines a seam;",
                  "Discusses types of seam;",
                  "Exhibits different types of seam;",
                  "Discusses uses of seams;",
                  "Discuss the stages of making seams;",
                  "Demonstrates the steps in making of seams,",
                  "Gives a board summary."
                ],
                "PUPILS ACTIVITIES": [
                  "Examine seams exhibited by the teacher;",
                  "Practice how to make seams on brown paper following teacher’s demonstration;",
                  "Copy board the summary."
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Different garments showing different seams;",
                  "Charts showing stages of seam making",
                  "Album showing samples of stages of seam making",
                  "Brown paper, coloured threads, scissors, needles, pins, etc."
                ],
                "EVALUATION GUIDE": [
                  "Explain the meaning of seam,",
                  "name two types of seam,",
                  "state three uses of seams",
                  "produce an album showing the steps of plain seam run and fell seams, french seam",
                  "produce needle work bag for display."
                ]
              }
            ]
          },
          {
            "SUB THEME NAME": "FOOD AND NUTRITION",
            "TOPICS": [
              {
                "TOPIC NAME": "Meal Planning for Healthy Living",
                "PERFORMANCE OBJECTIVES": [
                  "explain the meaning of meal planning and eating for healthy living;",
                  "discuss the importance and guidelines for healthy eating;",
                  "state factors influencing meal planning",
                  "identify the right foods for the three meals of the day;",
                  "plan a simple breakfast, lunch and supper/dinner;",
                  "write a menu card."
                ],
                "CONTENT": [
                  "Meaning of meal planning;",
                  "importance and guidelines for healthy eating",
                  "Effects of wrong meal planning and Eating Habit",
                  "Three Major meals of the day;",
                  "Factors to consider in planning meal",
                  "Guidelines for meal planning;",
                  "Menu cards."
                ],
                "TEACHER ACTIVITIES": [
                  "Explains: a) meaning of meal planning b) importance and guidelines for healthy eating",
                  "Explains factors that influence meal planning",
                  "Discusses the three major meals of the day.",
                  "Explains the effects of wrong meal planning.",
                  "Mentions the guidelines in meal planning",
                  "Plans meal with pupils.",
                  "Gives a chalkboard summary."
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in class discussions;",
                  "explain the effect of healthy and unhealthy eating habits.",
                  "plan a day’s meal;",
                  "Write menu card.",
                  "Copy the board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Chart showing the food groups",
                  "Charts on food nutrients",
                  "Charts showing various meal plans",
                  "Simple menu cards",
                  "Pictures of obese children and adults"
                ],
                "EVALUATION GUIDE": [
                  "explain the meaning of meal planning;",
                  "state four guidelines for healthy eating",
                  "name the three meals of a day;",
                  "state two guidelines for meal planning",
                  "list the factors that influence meal planning",
                  "Plan a day’s menu for a family."
                ]
              },
              {
                "TOPIC NAME": "Kitchen: Definition, Types",
                "PERFORMANCE OBJECTIVES": [
                  "define a kitchen",
                  "explain types of kitchen",
                  "describe different types of kitchen arrangement",
                  "mention the reasons for maintaining kitchen hygiene",
                  "discuss common accidents in the kitchen",
                  "list the contents of a First Aid Box"
                ],
                "CONTENT": [
                  "Meaning of kitchen and types:",
                  "Different types of kitchen layout or plans or arrangement.",
                  "Reasons for cleaning kitchens (kitchen hygiene): - to avoid household pests, odour and accidents - to prevent diseases.",
                  "Home accidents",
                  "Content of a First Aid Box and their uses.",
                  "Guidelines for kitchen hygiene and prevention of home accidents."
                ],
                "TEACHER ACTIVITIES": [
                  "Discusses types of kitchen arrangement, reasons for cleaning in a kitchen.",
                  "Demonstrates processes of cleaning a kitchen",
                  "Discusses the content of the First Aid Box and their uses.",
                  "Gives a board summary"
                ],
                "PUPILS ACTIVITIES": [
                  "Participate in the discussion;",
                  "Participate in cleaning a kitchen;",
                  "Help in preparing a First Aid Box for the class;",
                  "Copy the board summary"
                ],
                "TEACHING AND LEARNING RESOURCES": [
                  "Materials for making a First Aid Box",
                  "Chart showing First Aid Box items",
                  "Pictures of traditional and modern kitchen",
                  "Chart on kitchen plan/ arrangement",
                  "Mop, floor cloth, mop-bucket, soap, water, scrubbing brush, long and short broom, dust pan and trash bin,",
                  "Towels, napkins, apron, cap, head-tie."
                ],
                "EVALUATION GUIDE": [
                  "define kitchen",
                  "list two types of kitchen",
                  "mention two types of kitchen plan/arrangement.",
                  "give two reasons for cleaning a kitchen.",
                  "mention five items used in cleaning a kitchen.",
                  "mention five items found in a First Aid Box."
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}

